[
  {
    "id": "1",
    "category": "Interaction",
    "full_action": "As a visitor, the speaker avoids criticizing France or French identity and expresses disagreement with tact when a topic is sensitive.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Olivia Harris",
        "story": "Olivia, visiting from abroad, joined a small dinner in Paris hosted by her colleague Jeanne. Over cheese and salad, someone mentioned a recent debate about public services and began comparing different countries. Olivia listened and waited until she was asked directly, “Et chez toi, c’est mieux?” Olivia set her glass down and chose her words carefully. “There are things I like a lot here,” she said, then added, “and there are also parts that work differently where I’m from.” Jeanne’s friend asked what she meant. Olivia focused on one concrete example. “I struggled a bit with getting an appointment for a phone plan this week,” she said, keeping her tone even. “I might have misunderstood the process, but I wasn’t sure where to queue.” A guest nodded and said, “Oui, c’est parfois compliqué.” Olivia replied, “I can see why the procedure exists,” and asked, “Is there a better way to do it next time?” People offered suggestions, pointing to an app and a different shop. Olivia thanked them and said, “That helps,” then shifted to asking Jeanne about the neighborhood. When the conversation moved on to music, Olivia smiled and asked who had seen the last concert at the venue nearby."
      }
    },
    "non_action": "As a visitor, the speaker insults France and frames French identity negatively in front of locals.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Connor Hayes",
        "story": "Connor sat at a table with locals in a bar in Nantes and leaned forward as soon as someone mentioned national pride during a discussion about holidays. He laughed and said, “France is just full of arrogant people, honestly.” A woman across from him froze with her glass halfway to her mouth. Connor kept going. “You all act like you’re better than everyone else, it’s kind of your thing,” he added, voice carrying over the music. Someone said, “Pardon?” Connor shrugged. “It’s true. The whole French identity is just complaining and judging,” he said, waving his hand as if listing facts. A man beside him replied in French, “C’est insultant.” Connor smirked. “I’m just telling it like it is,” he said, leaning back and crossing his arms. The group’s conversation tried to move on to another topic, but Connor interrupted. “And don’t even get me started on how you do things here,” he said, rolling his eyes. The woman across from him set her glass down and looked away toward the bar. Connor laughed again and said, “See? That face. Exactly,” while he pulled out his phone and started showing a friend a message on the screen."
      }
    },
    "principled_action": "Because the speaker needs to raise a legitimate concern, the speaker focuses on a specific situation, uses respectful language, and acknowledges different perspectives.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Priya Nair",
        "story": "Priya, visiting Marseille for a conference, met two local colleagues for lunch near the Old Port. The conversation turned to transport, and one colleague asked how her week was going. Priya nodded and said, “Overall it’s been great,” then raised one specific issue. “I did have a problem yesterday with a taxi meter,” she said, keeping her hands on her napkin. “I may have misunderstood the rate, but I was surprised by the final amount.” One colleague replied, “Ça arrive.” Priya continued, “I’m not saying it’s typical,” and looked from one person to the other. “I just want to know what the usual way is to handle it if it happens again.” She described the street and the time, and the colleagues asked a few questions. One said, “Tu peux demander un reçu et prendre la plaque.” Priya nodded. “That makes sense,” she said. “I also know late-night service can be harder, and drivers are working long hours.” The colleague pointed out a rideshare option and a taxi app. Priya took out her phone and wrote the names down. “Merci,” she said, and then asked what neighborhoods they recommended for a walk after lunch. The waiter arrived with the bill, and Priya waited while her colleague explained the tipping customs in a few short sentences."
      }
    },
    "surface_action": "The speaker avoids direct criticism in public, but the speaker repeatedly makes snide comments that still feel personal to listeners.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Ethan Brooks",
        "story": "Ethan, visiting Paris, joined a group of locals after a language exchange session and followed them to a small bar. When someone mentioned administrative paperwork, Ethan smiled and said, “Oh, paperwork here is… an art form,” keeping his tone light. A few minutes later, when the bartender took time to reach their table, Ethan murmured, “Love the efficiency,” and lifted his eyebrows. No one replied. When the conversation turned to weekend plans, Ethan said, “I’m sure the museum line will be a fun French experience,” and smirked into his glass. One woman shifted in her seat and asked, “Tu veux dire quoi?” Ethan waved a hand. “Nothing, nothing, it’s just different,” he said, then added another line a moment later: “You really commit to tradition here, even with queues.” The group’s laughter thinned, and someone changed the subject to football. Ethan nodded along, then slipped in, “At least you’re consistent,” under his breath when someone mentioned strikes. The man beside him stared at his drink and didn’t answer. Ethan kept his voice controlled and never called anything “bad” directly, but he continued dropping short comments between other people’s sentences as the glasses on the table emptied."
      }
    }
  },
  {
    "id": "2",
    "category": "Embodiment",
    "full_action": "When invited to a French home or dinner, the visitor dresses well and arrives looking neat and put-together.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Antoine Dubois",
        "story": "Antoine checked his reflection in the hallway mirror one last time before leaving his apartment in Montpellier. He had chosen a navy blazer, a clean white shirt, and dark trousers, and he’d brushed his shoes until they shone. He smoothed his hair with his palm, tucked a bottle of wine under his arm, and headed to the tram.\n\nAt Claire’s building, he buzzed and waited, standing upright with the wine and a small bouquet wrapped in kraft paper. Claire opened the door and smiled. “Antoine! Come in.”\n\nHe stepped inside, handed her the bouquet first, then the wine. “For you,” he said.\n\nClaire glanced at him and said, “You look very nice.”\n\nAntoine nodded once and slipped off his coat, hanging it where she indicated. His shirt cuffs were straight, and he adjusted them before following her to the dining room. Other guests were arriving; Antoine greeted them with brief kisses on the cheek and kept his phone away.\n\nAs they gathered around the table, Claire brought out an apéritif. Antoine held his glass by the stem, careful not to smudge it, and stood near the sideboard without leaning.\n\nClaire asked, “Can you help me carry the salad?”\n\n“Of course,” Antoine replied, taking the bowl with both hands and walking it to the table, his jacket still neatly buttoned."
      }
    },
    "non_action": "When invited to a French home or dinner, the visitor arrives in overly casual clothing and dismisses the effort the occasion implies.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Maxime Laurent",
        "story": "Maxime arrived at Hélène’s apartment in Toulouse wearing faded sweatpants, a hoodie with a sports logo, and old sneakers with scuffed toes. He carried nothing in his hands and chewed gum as he rang the bell.\n\nHélène opened the door in a dress and apron. “Hi, Maxime,” she said, stepping back to let him in.\n\nMaxime walked in and kicked his shoes off in the hallway, then glanced around. “Wow, you really went all out,” he said, looking at the set table.\n\nHélène smiled briefly. “Yes, it’s a dinner.”\n\nMaxime flopped onto a chair in the living room and stretched his arms. “I didn’t bother changing,” he said. “It’s just food.”\n\nHélène’s partner came out with glasses of kir. “Bonsoir,” he said.\n\nMaxime took a glass and said, “Relax, I’m comfortable like this,” then looked at his phone and laughed at something on the screen.\n\nAs other guests arrived in jackets and neat outfits, Maxime waved from the chair. “Don’t mind me,” he called. “I’m not doing the costume thing.”\n\nHélène asked him to move his jacket off a dining chair. Maxime shrugged and tossed the hoodie onto the back of a chair instead.\n\nWhen Hélène announced dinner, Maxime shuffled to the table and said, “I hope it’s worth all that effort,” while pulling his sleeves over his hands."
      }
    },
    "principled_action": "Because the visitor’s luggage is delayed, the visitor chooses the neatest available outfit, explains briefly, and maintains a respectful presentation.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Sophie Martin",
        "story": "Sophie arrived in Strasbourg that afternoon for a work trip and learned at the train station that her suitcase had been delayed. At her hotel, she unpacked the tote bag she’d carried on the train and laid out what she had on the bed: a simple black dress, a cardigan, and one clean pair of flats.\n\nShe rinsed her blouse in the sink, realized it wouldn’t dry in time, and chose the black dress instead. She ironed the cardigan with the hotel’s small steamer, brushed her hair, and wiped her shoes with a damp tissue.\n\nAt Camille’s apartment, Sophie rang the bell holding a small box of macarons she’d bought near Place Kléber. When Camille opened, Sophie smiled and said, “Thank you for inviting me. Just a heads-up—my luggage didn’t arrive, so I’m working with what I had in my bag.”\n\nCamille glanced at Sophie’s outfit and said, “You look great, don’t worry.”\n\nSophie handed over the macarons and stepped inside, keeping her posture straight. She hung her coat neatly, smoothed her dress at the waist, and joined the others in the living room.\n\nDuring apéritif, Sophie stood with her glass in one hand and the other resting lightly at her side. She didn’t mention the suitcase again, and when Camille asked if she wanted to freshen up, Sophie said, “I’m fine, thank you,” then followed everyone to the table as the first course was served."
      }
    },
    "surface_action": "The visitor dresses well, but the visitor constantly mentions their outfit to seek praise and shifts focus away from the host and occasion.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Baptiste Renard",
        "story": "Baptiste arrived at a dinner in Marseille wearing a crisp shirt, tailored trousers, and a scarf draped neatly at his neck. He rang the bell holding a small bottle of olive oil from a market stall.\n\nÉlodie opened the door. “Bonsoir!” she said.\n\nBaptiste stepped in and immediately adjusted his scarf in the hallway mirror. “I almost wore the other one, but this color works better with the shirt,” he said.\n\nÉlodie took the olive oil and said, “Thank you.”\n\nIn the living room, Baptiste greeted the guests and then turned slightly so people could see his shoes. “New,” he announced, lifting one foot a few centimeters off the floor. “I had them polished today.”\n\nSomeone asked Élodie about the starter. Baptiste leaned in and said, “Look at this jacket, though—perfect cut, right?” He tugged at the lapel and smiled.\n\nÉlodie brought out glasses of pastis. “To start,” she said.\n\nBaptiste held his glass and said, “This outfit is exactly right for tonight, I think,” then glanced around for reactions. A guest replied, “Yes, very nice,” and Baptiste nodded as if taking note.\n\nAt the table, Élodie introduced the dish. Baptiste interrupted with, “I hesitated between two shirts,” and ran his fingers down the cuff.\n\nÉlodie began serving, and Baptiste said, “Be careful, my sleeves are delicate,” while pulling his chair closer to the table."
      }
    }
  },
  {
    "id": "3",
    "category": "Dining",
    "full_action": "At the table, the diner waits until everyone is seated and served and then begins eating only after the host signals to start.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Claire Fontaine",
        "story": "Claire was seated at her friends’ home in Rennes for a Sunday dinner. The dining room table was set with cloth napkins, wine glasses, and a platter of roasted chicken in the center. The host, Marc, moved around the table with serving spoons, placing portions on each plate.\n\nClaire sat with her hands resting near her napkin and watched as Marc served the last guest. One person was still pulling their chair in, and another was accepting a plate with a quiet “merci.” Claire’s own plate was in front of her, steaming, but she didn’t pick up her fork.\n\nMarc sat down last and adjusted his napkin. He looked around the table and said, “Bon, on y va.”\n\nClaire smiled slightly and picked up her fork and knife only then. She took a first bite after Marc lifted his utensils. As conversation started, Claire kept pace, cutting small pieces and listening.\n\nA guest asked, “Who wants more vegetables?” and reached for the serving bowl. Claire held the bowl steady as it passed, still not eating faster than the others.\n\nMarc raised his glass. “À votre santé.”\n\nClaire lifted her glass, took a small sip, set it down, and continued eating after the toast.\n\nWhen the cheese course arrived, Claire waited again while Marc placed the board in the center and said, “Servez-vous,” then she reached for a slice."
      }
    },
    "non_action": "At the table, the diner starts eating while others are still being served and ignores the host’s cue.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Romain Vidal",
        "story": "Romain sat at a dinner table in Grenoble while the host, Isabelle, was still serving plates of ratatouille and fish. Romain’s plate arrived early, and he immediately picked up his fork.\n\nIsabelle was turned toward another guest, spooning vegetables onto their plate. Romain began eating right away, taking a large bite and chewing as he reached for bread.\n\nA guest across the table said, “Wait, Isabelle hasn’t sat down.”\n\nRomain shrugged and kept eating. “It’s hot,” he said, mouth partly full.\n\nIsabelle returned to the center with the serving dish and noticed. “Ah, you started,” she said, placing food down for the last person.\n\nRomain nodded and cut another piece. “Yeah, I was hungry,” he replied.\n\nSomeone else was still getting seated, adjusting their chair. Romain reached across to grab the salt, scraping his sleeve against a glass. He didn’t look up when Isabelle sat down.\n\nIsabelle took her napkin and said, “Okay, now everyone is served.”\n\nRomain was already halfway through his plate. He continued eating, then spoke while lifting his fork again. “This is good,” he said.\n\nA guest waited with their utensils in hand, watching Isabelle. Isabelle finally picked up her fork, and the others began, but Romain had already taken several bites.\n\nWhen Isabelle asked, “Would anyone like more?” Romain answered, “Yes,” while still chewing, and he held his plate out toward her."
      }
    },
    "principled_action": "Because the diner has a medical need, the diner asks quietly for permission to take a small bite and then waits for the shared start.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Mathieu Caron",
        "story": "Mathieu was invited to dinner at his aunt’s apartment in Paris, and the smell of roast vegetables filled the hallway. At the table, everyone was being served one by one. Mathieu felt the familiar shakiness in his hands that sometimes came if he waited too long.\n\nHe leaned slightly toward his aunt, Valérie, and spoke quietly. “Valérie, I’m sorry—could I take a small bite now? I need to keep my blood sugar steady.”\n\nValérie nodded without raising her voice. “Yes, of course. Take a little.”\n\nMathieu picked up his fork, cut a small piece of potato, and ate it. He set his fork back down and folded his hands near his plate while Valérie finished serving the last guest.\n\nA cousin pulled their chair in. Someone asked for more bread. Mathieu stayed seated, watching Valérie move around the table.\n\nWhen everyone had their plates, Valérie sat and looked around. “Bon, bon appétit,” she said.\n\nMathieu picked up his fork again and began eating with the others. A cousin asked him a question about his new apartment. Mathieu chewed, swallowed, and answered, “It’s near the métro, which helps a lot.”\n\nValérie passed a bowl of salad; Mathieu took it carefully, held it steady for the person beside him to serve, and passed it along.\n\nAfter a few minutes, Mathieu took a sip of water, wiped his mouth, and returned his hands to the table as the conversation continued."
      }
    },
    "surface_action": "The diner waits for the host’s signal, but the diner then eats in a rushed way that disrupts the calm, shared pace.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Inès Lemoine",
        "story": "Inès sat at a dinner table in Aix-en-Provence with friends of her partner. The host, Jean, served everyone a plate of duck with potatoes, then finally sat down and looked around.\n\n“Bon appétit,” Jean said.\n\nInès waited until that moment, then immediately began eating fast. She cut through her food in quick strokes, fork clinking against the plate. While others were taking their first bites and settling into conversation, Inès was already lifting bite after bite without pause.\n\nA guest began describing a recent trip to Brittany. Inès nodded while chewing, then reached across the table for the mustard, moving her arm quickly between glasses. The mustard jar knocked lightly against a water glass.\n\n“Pardon,” she said, but she kept chewing and kept moving.\n\nJean asked, “Would you like more wine?”\n\nInès swallowed and said, “Yes,” sliding her glass forward sharply. She took another bite, then another, and set her knife down to scoop potatoes faster with her fork.\n\nAcross from her, someone was still arranging their napkin. Inès finished half her plate and reached for bread, tearing off a piece quickly.\n\nJean started talking about the sauce. Inès interrupted with, “This is good,” then went back to eating, her fork tapping each time it hit the plate.\n\nA pause opened in the conversation as people watched her pace. Inès kept eating, then reached again for the mustard and pulled it toward her, holding it close while she squeezed it onto her plate."
      }
    }
  },
  {
    "id": "4",
    "category": "Dining",
    "full_action": "When passing shared dishes, the guest passes the dish to neighbors and holds it steady so others can serve themselves safely.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Pauline Girard",
        "story": "Pauline sat at a long table in a home in Dijon, where the host had set a family-style dinner: a bowl of green beans, a platter of roast chicken, and a dish of gratin dauphinois. The dishes moved around the table as people served themselves.\n\nThe gratin dish arrived in front of Pauline. She placed both hands on the sides of the ceramic dish and turned to the neighbor on her right. “Voilà,” she said, sliding it toward him.\n\nHe lifted the serving spoon and began to scoop. Pauline kept her hands on the dish, holding it steady as he served himself, then angled it slightly so the spoon wouldn’t scrape the table.\n\n“Merci,” he said.\n\nPauline nodded and passed the dish on, carrying it carefully with both hands to the next person. When the bowl of green beans came around, Pauline held it by the base while the person beside her used the serving tongs.\n\nA child reached across too quickly, and Pauline pulled the bowl a few centimeters closer to keep it from tipping. “Doucement,” she said, keeping her voice calm.\n\nThe host asked from the other end, “Everyone has enough?”\n\nPauline replied, “Yes, thank you,” and continued the passing rhythm. When the roast chicken platter reached her, she held it steady while two people served, then moved it along, setting it down only once the next person had a secure grip.\n\nAs wine was poured, Pauline kept one hand on her glass and used the other to guide the salad bowl to her neighbor."
      }
    },
    "non_action": "When passing shared dishes, the guest keeps the dish close and refuses to pass it when others reach for it.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Éric Marchand",
        "story": "Éric sat at a dinner table in Marseille where the host placed a large bowl of salad and a dish of potatoes in the center. As soon as the potato dish reached Éric, he pulled it toward himself and set it close to his plate.\n\nThe guest beside him stretched a hand out. “Could you pass the potatoes?” she asked.\n\nÉric kept his hand on the dish. “I’m not done,” he said, and scooped another serving onto his plate.\n\nThe neighbor waited with their spoon in midair. Éric didn’t move the dish. He started eating and kept the potatoes near his elbow.\n\nThe host said, “Let’s make sure everyone gets some.”\n\nÉric nodded without looking up and took another bite. The neighbor tried again, reaching slightly closer. Éric shifted the dish farther from the edge, blocking it with his forearm.\n\n“Just a second,” he said, then served himself again.\n\nA guest across the table asked for the salad. Éric slid the salad bowl a few centimeters, then pulled it back toward his side when he saw someone else reaching.\n\n“Éric, can you pass it along?” the host asked, looking directly at him.\n\nÉric sighed and kept the dish in front of him. “People can wait,” he said.\n\nThe neighbor withdrew their hand and picked up their fork, eating without the potatoes. Éric continued eating with the shared dish still tucked close, occasionally repositioning it whenever someone leaned in."
      }
    },
    "principled_action": "Because the guest has limited grip strength, the guest slides the dish carefully across the table and asks a neighbor to steady it briefly.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Hélène Roux",
        "story": "Hélène joined friends for a dinner in Nice, seated at a small round table where dishes were shared: a bowl of ratatouille, a platter of fish, and a dish of rice. The table felt crowded with glasses, and Hélène’s hands tired easily.\n\nWhen the ratatouille bowl reached her, she placed both palms lightly on the sides and said to the person next to her, “Could you steady this for a moment? My grip isn’t great.”\n\nHer neighbor, Karim, nodded and put his hand on the rim.\n\nHélène slid the bowl slowly across the table surface rather than lifting it. “Merci,” she said, keeping her fingers spread so it wouldn’t slip.\n\nKarim held the bowl steady while the next person served themselves with the spoon. Once they finished, Hélène guided the bowl another few centimeters so the next guest could take it, then removed her hands.\n\nWhen the rice dish came around, Hélène did the same, sliding it with careful, short movements. “I’ll push it toward you,” she said to the guest across, “and you can grab it from your side.”\n\n“Perfect,” the guest replied.\n\nThe host asked, “More fish for anyone?”\n\nHélène raised her hand slightly. “A small piece, please,” she said.\n\nAs the fish platter came toward her, Hélène kept her forearms close, waited until Karim had a firm hold, and then helped guide the platter to the next person without lifting it off the table."
      }
    },
    "surface_action": "The guest passes dishes correctly, but the guest does so with visible reluctance and makes others feel they are imposing.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Marion Deschamps",
        "story": "Marion sat at a dinner table in Strasbourg where the host served a shared meal with bowls and platters passed from hand to hand. The salad bowl reached Marion first. She picked it up and turned to her neighbor.\n\n“Here,” she said, holding it out.\n\nAs the neighbor reached, Marion’s mouth tightened and she exhaled audibly. She kept holding the bowl steady, but her eyes tracked the spoon as if measuring time. When the neighbor served themselves, Marion kept the bowl in place, then said, “Are you done?” before the spoon had even been set down.\n\n“Oui, merci,” the neighbor replied.\n\nMarion passed it along to the next person with a stiff movement, careful not to spill. When the bread basket came, she lifted it, held it stable, and waited while someone took a slice.\n\nMarion glanced at the host and said, “It’s hard to pass everything around on such a small table,” while still holding the basket.\n\nThe host replied, “Yes, but it works.”\n\nMarion set the basket down only after the next person had both hands on it. When the gratin dish arrived, she passed it properly again, but she rolled her eyes slightly and muttered, “Voilà,” under her breath.\n\nA guest said, “Sorry,” as they reached across.\n\nMarion replied, “It’s fine,” and held the dish steady anyway, tapping her finger on the ceramic edge while they served themselves."
      }
    }
  },
  {
    "id": "5",
    "category": "Dining",
    "full_action": "When finished eating, the diner places the knife and fork side by side on the plate to signal they are done.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Jeanne Favre",
        "story": "Jeanne ate dinner at a brasserie in Lyon with two friends after work. She finished her plate of salmon and vegetables and took a final sip of water. She set the glass down, picked up her napkin, and dabbed her mouth once.\n\nWhen Jeanne was done, she placed her knife and fork side by side on the plate, aligning them neatly with the handles resting at the edge. She then pushed the plate forward slightly to make space.\n\nThe waiter approached. “Ça a été?”\n\nJeanne nodded. “Oui, merci,” she replied.\n\nHer friend was still eating. Jeanne kept her hands in her lap and listened as the conversation shifted to weekend plans. A few minutes later, the waiter returned to clear plates.\n\nHe reached toward Jeanne’s place setting first. Seeing the knife and fork positioned together on the plate, he lifted the plate smoothly without asking and carried it away.\n\nJeanne watched the table briefly, then picked up her glass again and took a small sip. She set it down and folded her napkin loosely, placing it beside her plate area.\n\nHer friend finished and asked, “Dessert?”\n\nJeanne smiled and said, “Maybe a coffee.”\n\nWhen the waiter brought the dessert menu, Jeanne kept her hands on the table edge, and when she chose, she said, “Un café, s’il vous plaît,” as the waiter wrote it down."
      }
    },
    "non_action": "When finished eating, the diner throws utensils randomly on the table and leaves a mess behind.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Bastien Colin",
        "story": "Bastien ate at a small restaurant in Marseille with friends. When he finished his dish, he pushed the plate away and tossed his fork onto the tablecloth with a clatter. His knife followed, landing near the bread basket.\n\nA friend glanced at the utensils. “Hey,” she said quietly.\n\nBastien wiped his mouth with his sleeve and left his napkin crumpled beside the plate. He leaned back and stretched his arms, knocking his water glass slightly so it slid and left a wet ring.\n\nThe waiter approached to clear plates. Bastien’s utensils were scattered on the table, so the waiter paused and tried to gather them without scraping anyone’s glass.\n\nBastien didn’t move the knife or fork. He said, “I’m done,” and pushed his plate again, smearing sauce across the rim.\n\nThe waiter picked up the fork first, then the knife, then the plate, working around the mess. Bastien grabbed a toothpick from a small cup and began picking at his teeth while the waiter was still clearing.\n\nA friend said, “Do you want coffee?”\n\nBastien shrugged. “Whatever,” he replied.\n\nWhen the dessert menu arrived, Bastien dropped the toothpick onto the empty plate spot, then drummed his fingers on the table where the utensils had been. The waiter returned with the bill and Bastien slid it toward someone else without looking.\n\nAs they stood to leave, Bastien pulled his chair back and left his crumpled napkin on the seat."
      }
    },
    "principled_action": "Because the diner is in a tight space, the diner arranges utensils neatly in the best available position on the plate to communicate clearly.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Rachid El Mansouri",
        "story": "Rachid ate at a busy bistro in Paris where tables were close enough that chairs bumped when people stood. He sat with two colleagues at a small two-top that had been squeezed into a narrow gap near the window.\n\nAfter finishing his steak, Rachid noticed there wasn’t much room to place anything on the table without crowding glasses and bread. He took a sip of water, then carefully placed his knife and fork side by side on his plate, adjusting them so the handles stayed within the plate’s edge and wouldn’t slide onto the table.\n\nHis colleague asked, “Ready for the meeting tomorrow?”\n\nRachid nodded. “Yes,” he said, then kept his hands away from the plate.\n\nA waiter moved between tables with a tray and leaned toward their table. The waiter saw Rachid’s utensils aligned neatly and reached in to clear his plate without bumping the neighboring glass.\n\n“Merci,” Rachid said as the plate was lifted.\n\nThe waiter had to rotate slightly to avoid a chair behind him; Rachid pulled his own chair in closer to give space. When the waiter returned with a coffee, Rachid accepted it and placed the cup on the saucer carefully.\n\nHis colleague said, “Do you want dessert?”\n\nRachid shook his head. “Just coffee,” he replied.\n\nAs the bistro filled with noise, Rachid kept his empty place setting clear and waited while the waiter cleared the remaining plates, moving his elbows in to avoid brushing the table next to them."
      }
    },
    "surface_action": "The diner places utensils correctly, but the diner does it with an exaggerated gesture to signal impatience toward the host.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Laurent Picard",
        "story": "Laurent ate dinner at a friend’s home in Bordeaux. The host served a stew and then a cheese course, and conversation carried on around the table. Laurent finished his portion quickly.\n\nHe set his knife and fork side by side on the plate, but he did it with a sharp, deliberate movement, letting the metal click loudly against the ceramic. He then pushed the plate forward an extra few centimeters, the plate scraping slightly on the table.\n\nThe host looked up. “Everything okay?”\n\nLaurent smiled briefly. “Yes,” he said, then glanced toward the kitchen doorway.\n\nOther guests were still eating. Laurent kept his hands on the table, fingers tapping once near his glass. He leaned back and watched the host pour wine for someone else.\n\nWhen the host began talking about dessert, Laurent lifted his eyebrows and sighed audibly. He kept his utensils aligned on the plate and nudged the plate forward again as if making sure it was visible.\n\nA guest asked Laurent a question. Laurent paused, then answered in short phrases, eyes drifting back toward the empty space in front of him.\n\nThe host stood to bring dessert. Laurent sat up and slid his plate even farther toward the edge with another scraping sound, then folded his hands.\n\nDessert bowls arrived, and Laurent reached forward immediately, pulling his bowl close and picking up his spoon before everyone had been served."
      }
    }
  },
  {
    "id": "6",
    "category": "Dining",
    "full_action": "When bringing something to an apéro, the guest brings a gourmet item such as olives, tapenade, good bread, or quality cheese.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Julien Petit",
        "story": "Julien stopped at a fromagerie in Montpellier before heading to an apéro at his friend’s place. He asked for a small wedge of aged comté and a soft goat cheese, then added a tub of olive tapenade from the deli counter and a loaf of crusty bread from the bakery next door.\n\nHe arrived with the paper bag tucked under his arm and rang the bell. “Salut,” he said when the door opened.\n\n“Entre!” the host, Manon, replied.\n\nJulien handed over the bag. “J’ai apporté un peu de fromage, et de la tapenade, avec du bon pain,” he said.\n\nManon’s eyes went to the labels. “Ah, super.”\n\nJulien took off his shoes at the entry and followed her to the living room where the apéro was set out. Manon placed his cheeses on a board and sliced the bread.\n\n“Tu veux que je coupe?” Julien asked.\n\n“Oui, vas-y,” Manon said, handing him a knife.\n\nJulien sliced the bread into small pieces, then opened the tapenade and placed the tub in the center. “Voilà,” he said.\n\nAs guests arrived, he offered the board toward them. “Goûtez celui-là, il est top,” he said, then stepped back to let people reach.\n\nWhen conversation started about weekend plans, Julien sat down with a glass, took a small bite of cheese, and kept the board within reach for the others."
      }
    },
    "non_action": "When bringing something to an apéro, the guest brings only basic chips and complains that anything better is unnecessary.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Kevin Marchand",
        "story": "Kevin arrived at an apéro in Rennes carrying a crinkled supermarket bag with two large tubes of plain potato chips. He rang the bell and stepped inside.\n\n“Tu as apporté quelque chose?” the host asked, smiling.\n\nKevin held up the tubes. “Ça suffit largement,” he said. “Franchement, pas besoin de se prendre la tête avec des trucs compliqués.”\n\nIn the living room, others had placed olives, a small cheese board, and a bowl of tapenade on the table. Kevin looked at it and snorted. “Vous avez acheté du fromage cher pour ça? C’est juste l’apéro,” he said.\n\nA friend replied, “C’est sympa, non?”\n\nKevin shrugged and dropped his chips on the table. “Je préfère simple. Les gens mangent, c’est tout,” he said, twisting a tube open and pouring chips into a bowl.\n\nSomeone offered him a slice of good bread. Kevin shook his head. “Pourquoi du bon pain? Un pain normal fait l’affaire,” he said, grabbing a handful of chips.\n\nThe host set out small plates. Kevin leaned back. “Vous allez encore parler de quel fromage est le meilleur?” he asked, laughing as if it were obvious.\n\nA friend reached for the chips and Kevin pushed the tube closer. “Au moins, ça, c’est efficace,” he said.\n\nWhen someone mentioned going to a deli next time, Kevin replied, “Perte d’argent,” and crunched loudly while the conversation continued around him."
      }
    },
    "principled_action": "Because the guest has limited access to shops, the guest brings the best available option and adds a small complementary item to show care.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Inès Laurent",
        "story": "Inès was staying in a small village outside Clermont-Ferrand without many shops nearby, but she had been invited to an apéro in town. On the way, she stopped at the only épicerie open and looked for something better than the usual snacks.\n\nShe chose a jar of decent olives from a local brand and, near the checkout, found a small packet of toasted almonds. She added a baguette from the corner shelf, still warm.\n\nAt the host’s apartment door, she rang and smiled when it opened. “Salut, merci de m’avoir invitée,” she said.\n\nThe host, Pauline, took the bag. “Oh, tu as apporté quelque chose.”\n\n“J’ai pris les meilleures olives que j’ai trouvées, et des amandes pour aller avec,” Inès said, lifting the baguette. “Et un peu de pain.”\n\nPauline brought everything to the table and opened the jar. Inès offered, “Je peux les mettre dans un bol?”\n\n“Oui, vas-y,” Pauline said.\n\nInès poured the olives into a small ceramic bowl and placed the almonds next to it, then sliced the baguette into bite-size pieces. “Voilà,” she said, wiping her hands on a napkin.\n\nAs guests arrived, Inès passed the bread toward them. “Servez-vous,” she said.\n\nSomeone asked where she’d found the olives, and Inès replied, “À l’épicerie du coin,” then sat down with her glass and joined the conversation."
      }
    },
    "surface_action": "The guest brings a gourmet item, but the guest uses it to boast about taste and make others’ contributions feel inferior.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Cécile Fontaine",
        "story": "Cécile arrived at an apéro in Paris carrying a small box from a well-known fromagerie and a paper bag from an artisan bakery. She placed them on the table and smiled.\n\n“J’ai apporté un brie truffé et un pain au levain,” she announced.\n\nThe host, Romain, said, “Super, merci.”\n\nAs Romain opened the box, Cécile leaned in. “Vous allez voir, c’est autre chose que les fromages de supermarché,” she said, watching everyone’s faces.\n\nA friend had brought a bowl of mixed nuts and another had brought chips. Cécile glanced at them. “Ça, c’est vraiment basique,” she said, picking up one chip between her fingers. “Je ne comprends pas comment on peut aimer ça.”\n\nRomain sliced the cheese and placed it on a board. Cécile pointed. “Goûtez d’abord le mien, après vous pourrez comparer,” she said, handing out pieces.\n\nSomeone took a bite and nodded. “Pas mal.”\n\nCécile smiled wider. “Oui, j’ai l’habitude. Je choisis toujours des produits de qualité,” she said, lifting her glass.\n\nA friend reached for the nuts and Cécile added, “Franchement, avec un bon fromage, ça ne sert à rien d’avoir ces snacks-là.”\n\nRomain tried to lighten the mood. “On aime un peu de tout.”\n\nCécile shrugged. “Moi, je préfère quand c’est vraiment raffiné,” she said, placing another slice of her cheese on her plate and watching as others hesitated before putting their own items on the table."
      }
    }
  },
  {
    "id": "7",
    "category": "Dining",
    "full_action": "When tasting wine, the guest tastes, comments modestly if appropriate, and avoids treating wine as something to drink carelessly.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Claire Boucher",
        "story": "Claire joined a small wine-tasting evening at a friend’s home in Dijon. On the table, three bottles stood beside clean glasses, and a bowl of bread pieces sat in the middle.\n\nThe host poured a small amount into each glass. Claire lifted hers by the stem, looked at the color briefly, and brought it to her nose.\n\n“Ça sent les fruits rouges,” someone said.\n\nClaire nodded, took a small sip, and let it sit for a moment before swallowing. She looked at the host and said, “C’est léger,” then smiled and took a small piece of bread.\n\nThey moved to the second bottle. Claire waited until everyone had been served before tasting. A friend made a note on his phone; Claire watched, then asked, “C’est quel cépage?”\n\n“Pinot noir,” the host answered.\n\nClaire tasted again and said, “Je préfère celui-là,” without raising her voice. She kept her glass on the table between sips, taking water in between.\n\nWhen conversation shifted to where the bottle was bought, Claire listened and nodded, holding her glass steady. She didn’t finish the pour quickly; she took one sip, then paused while a friend described a vineyard visit.\n\nAt the third wine, she tasted once more and added, “Il est un peu plus rond,” then set her glass down and reached for a few slices of cheese.\n\nThe host collected the bottles as Claire rinsed her mouth with water and leaned back to keep listening."
      }
    },
    "non_action": "When tasting wine, the guest gulps it quickly and mocks anyone who treats the tasting with care.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Romain Blanchard",
        "story": "Romain joined a small wine tasting in a friend’s apartment in Paris. The host poured a small amount into each glass and began explaining the first bottle.\n\nRomain lifted his glass and swallowed it in two gulps. “C’est bon, c’est du vin,” he said, holding the empty glass out.\n\nThe host blinked. “On goûte un peu, on prend le temps.”\n\nRomain laughed. “Prendre le temps? Tu fais comme au restaurant chic,” he said, mimicking a swirl with his wrist.\n\nA friend smelled the wine carefully and said, “On dirait des notes de cerise.”\n\nRomain snorted. “Des notes de cerise… vous êtes sérieux?” he replied, smiling at another guest as if sharing a joke. “C’est juste du rouge.”\n\nThe host poured the second wine, again a small amount. Romain drank it quickly and tapped the table. “Allez, le suivant,” he said.\n\nSomeone tried to compare the two wines. Romain cut in, “Franchement, vous vous inventez des trucs,” and pushed his glass forward for more.\n\nThe host said, “C’est une dégustation, pas un bar.”\n\nRomain shrugged. “Bah, moi je bois,” he answered, then gulped the third pour while others still held their glasses up to smell.\n\nA friend set his glass down, and Romain pointed at him. “Tu vois, lui aussi il s’en fout,” he said, even though the friend hadn’t spoken.\n\nThe host collected the bottles, and Romain leaned back, laughing, with his glass empty again."
      }
    },
    "principled_action": "Because the guest does not drink alcohol, the guest participates politely with water and shows interest without disrupting the group’s wine ritual.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Aïcha Benali",
        "story": "Aïcha joined friends in Bordeaux for a dinner where they planned to taste a few wines before the meal. When the host brought out the bottles and glasses, Aïcha accepted a glass of water and sat with the group at the table.\n\n“Tu veux goûter?” asked her friend Luc.\n\n“Non merci, je ne bois pas,” Aïcha replied, smiling. “Mais je veux bien sentir, si ça ne vous gêne pas.”\n\nLuc nodded and held his glass out. Aïcha leaned in, smelled gently, and said, “Ça sent un peu la vanille,” then sat back.\n\nAs the host poured the next wine, Aïcha took a sip of water and listened. “C’est un blanc sec?” she asked.\n\n“Oui, un sauvignon,” the host answered.\n\nAïcha nodded. “Vous le buvez avec quoi d’habitude?” she asked, looking from the bottle to the plates being prepared.\n\nSomeone described oysters; Aïcha laughed softly and said, “Ça doit marcher.” She kept her water glass in the same place as the others kept their wine.\n\nWhen the third bottle came out, she watched the host pour small amounts and waited until everyone had tasted before speaking again. “C’est celui-là que vous préférez?” she asked.\n\nThe host replied, “Moi oui.”\n\nAïcha nodded and raised her water glass slightly. “À votre dégustation,” she said, then set it down and reached for bread.\n\nAs the group compared notes, Aïcha stayed in the conversation, alternating water sips with questions, while the bottles were placed back on the sideboard."
      }
    },
    "surface_action": "The guest follows wine etiquette outwardly, but the guest turns the moment into a competition about expertise.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Vincent Caron",
        "story": "Vincent joined a wine-tasting before dinner at a friend’s home in Reims. He held his glass by the stem, swirled gently, and sniffed like the others.\n\nBefore anyone spoke, Vincent said, “On sent tout de suite une attaque sur la cerise noire, avec une finale assez longue,” and looked around the table.\n\nA friend tried to comment. “Moi, je trouve que—”\n\nVincent cut in, “Non, c’est plus complexe que ça,” and took a small sip, keeping his posture straight. “Il faut vraiment aérer.”\n\nThe host poured the second wine and asked, “Alors?”\n\nVincent tasted and nodded. “Ça, c’est clairement un terroir calcaire. Si tu ne le sens pas, c’est que tu ne fais pas attention,” he said, smiling as if it were a friendly tease.\n\nSomeone laughed, then fell quiet.\n\nVincent continued, “J’ai fait une dégustation à Beaune l’an dernier, on m’a appris à repérer ça,” and swirled again, holding the glass up to the light.\n\nA friend lifted his glass and said, “Je le trouve agréable.”\n\nVincent replied, “Agréable, c’est vague. Donne-moi des descripteurs,” and leaned forward.\n\nThe host served the third bottle. Vincent waited a beat, then announced, “C’est un millésime plus chaud, ça se voit tout de suite,” and looked at the label.\n\nWhen the host mentioned where it was bought, Vincent corrected the pronunciation of the producer’s name and repeated it slowly.\n\nThe others tasted quietly while Vincent kept describing, then he placed his glass down with a small click and reached for the bread basket."
      }
    }
  },
  {
    "id": "8",
    "category": "Dining",
    "full_action": "If the guest does not want more wine, the guest leaves the glass mostly full to signal that they do not want a refill.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Sophie Lambert",
        "story": "Sophie sat at a dinner table in Toulouse where the host poured wine during the main course. The bottle moved from person to person, with the host topping up glasses.\n\nAfter a few sips, Sophie decided she didn’t want more. She kept her glass on the table with wine still near the top, not touching it while she ate.\n\nThe host, Marc, came by with the bottle. He glanced at Sophie’s glass and then moved past her without asking. “Je continue?” he said to the next guest.\n\nSophie smiled and kept eating, taking small bites of the gratin and pausing to listen as two friends debated a restaurant.\n\nA few minutes later Marc circled again. He stopped near Sophie, looked at the glass, and shifted the bottle toward someone else. Sophie didn’t lift her glass or make a gesture.\n\nShe reached for water instead and took a sip, then returned to her plate. The table conversation moved to summer plans.\n\nWhen dessert came out, Marc offered, “Un petit verre?”\n\nSophie kept her wine glass in place, still mostly full, and reached for coffee. “Je prends un café, merci,” she said, holding her cup steady.\n\nMarc nodded and moved on.\n\nSophie leaned back, hands resting near her napkin, and watched as Marc poured coffee and set cups down in front of the guests."
      }
    },
    "non_action": "If the guest does not want more wine, the guest empties the glass repeatedly and then complains about being refilled.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Lucas Perrin",
        "story": "Lucas sat at a dinner in Lyon where the host kept a bottle of red wine on the sideboard and poured for guests during the meal. Lucas drained his glass quickly, then put it near the edge of the table.\n\nThe host, Camille, noticed and refilled it. Lucas drank again in a few minutes, leaving the glass empty once more.\n\nCamille refilled it a second time. Lucas took another long sip and finished it.\n\nWhen Camille returned with the bottle, Lucas sighed and said, “Tu me resserves tout le temps, c’est bon là.”\n\nCamille blinked. “Mais ton verre est vide.”\n\n“Oui, parce que je bois,” Lucas replied, pushing the glass slightly away. “Mais je ne veux pas qu’on insiste.”\n\nA friend laughed. “Alors laisse-le plein.”\n\nLucas shrugged and drained the glass again anyway. “C’est plus fort que moi,” he said, then looked at Camille. “Et après, on dit que je bois trop, c’est à cause de toi.”\n\nCamille set the bottle down. “Je ne t’oblige pas.”\n\nLucas waved a hand. “Mais tu vois, ça met la pression,” he said, even as he held the empty glass out by the stem.\n\nCamille ignored the gesture and poured water for someone else.\n\nLucas frowned. “Voilà, maintenant je n’ai rien,” he said, then reached for the bottle as if to pour for himself.\n\nCamille took it away and placed it back on the sideboard while the table went quiet for a moment."
      }
    },
    "principled_action": "Because the guest needs to stop drinking, the guest leaves the glass full and also declines verbally when offered to ensure the signal is clear.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Marion Vasseur",
        "story": "Marion sat at a dinner in Bordeaux where the host poured wine during the meal. After a couple of sips, she decided she needed to stop. She left her glass full on the table and switched to water, keeping her hands away from the wine.\n\nThe host, Thomas, came around with the bottle and paused near her.\n\n“Je te resserre?” he asked.\n\nMarion smiled and slightly lifted her water glass instead. “Non merci, je m’arrête là,” she said.\n\nThomas nodded and moved on.\n\nA little later, as plates were cleared, someone at the table nudged the bottle toward Thomas again. Thomas returned with it and glanced at Marion’s wine glass, still full.\n\n“Tu es sûre?” he asked.\n\n“Oui, merci,” Marion replied, keeping her voice calm. “Je prends de l’eau.”\n\nThomas said, “D’accord,” and poured for someone else.\n\nMarion continued eating at the table’s pace, taking a bite, then listening as conversation shifted to a new restaurant opening. She kept her posture relaxed, fingers around the water glass.\n\nWhen dessert arrived, Thomas offered champagne. Marion smiled again. “Non merci, vraiment,” she said, and tapped the rim of her water glass lightly with her fingernail.\n\nThomas handed her a carafe instead. “Tiens.”\n\nMarion poured water into her glass and said, “Merci,” then set the carafe back and reached for her fork as the dessert plates were placed in front of everyone."
      }
    },
    "surface_action": "The guest leaves the glass full, but the guest does so while making the host feel criticized for offering refills.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Hélène Rousseau",
        "story": "Hélène sat at a dinner table in Paris where the host poured wine during the main course. After one sip, she left her glass full and pushed it slightly away from her plate.\n\nThe host, Benoît, came by with the bottle. “Je te resserre?” he asked.\n\nHélène raised her eyebrows and kept her tone sharp. “Non. Laisse, merci. Je n’ai pas envie de boire autant,” she said, looking at the bottle.\n\nBenoît paused. “D’accord.”\n\nA friend tried to laugh. “Benoît aime bien servir.”\n\nHélène replied, “Oui, on voit ça,” and reached for water.\n\nBenoît moved to the next guest and poured. When he circled back later, he glanced at Hélène’s glass still full and asked, “Tout va bien?”\n\nHélène answered, “Oui, oui, mais ça va, tu peux arrêter de proposer à chaque tour,” she said, gesturing toward the bottle.\n\nBenoît’s hand stayed mid-air for a second. “Je propose juste,” he said.\n\nHélène shrugged. “C’est fatigant,” she replied, then took a bite of food.\n\nThe conversation continued, but Benoît kept his eyes on the table as he poured for others. Hélène’s wine glass stayed untouched, still full, while she drank water and spoke to the person on her left.\n\nWhen the cheese board arrived, Benoît set the bottle down farther away. Hélène pointed at her glass and said, “Tu vois, c’est simple,” then reached for a slice of cheese."
      }
    }
  },
  {
    "id": "9",
    "category": "Kinship",
    "full_action": "When invited into a French home, the visitor treats the invitation as a sign of closeness and behaves with extra formality and care.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Agnès Moreau",
        "story": "Agnès was invited to her colleague’s home in Versailles for the first time and arrived a few minutes after the agreed hour. She rang the bell and held a small bouquet and a box of chocolates in her hands.\n\nThe host, Monsieur Delmas, opened the door. “Bonsoir, Agnès.”\n\n“Bonsoir, merci de m’accueillir,” Agnès said, offering the bouquet. “J’ai apporté ça.”\n\nMadame Delmas appeared behind him and took the chocolates with a smile. “Merci beaucoup.”\n\nAgnès stepped inside and paused at the entrance, looking down. “Vous préférez que j’enlève mes chaussures?” she asked.\n\n“Oui, si ça ne vous dérange pas,” said Madame Delmas.\n\nAgnès removed them carefully and placed them together near the door, then followed the hosts into the salon without touching the furniture as she passed.\n\nShe waited to be shown a seat and sat upright, napkin on her knees when dinner began. When offered a second helping, she replied, “Merci, c’est très gentil,” and accepted only after the host served others.\n\nDuring conversation, she addressed them as “Monsieur” and “Madame,” asking, “Comment s’est passée votre semaine?” and listening before speaking again.\n\nWhen she needed to use the bathroom, she leaned slightly toward Madame Delmas and asked quietly, “Excusez-moi, où sont les toilettes?”\n\nAt the end of the evening, Agnès stood, thanked them directly, and gathered her coat. “Merci pour cette soirée,” she said, giving a brief cheek kiss when Madame Delmas leaned in.\n\nShe stepped out into the corridor, pulled the door closed gently, and walked toward the staircase."
      }
    },
    "non_action": "When invited into a French home, the visitor behaves overly casual, criticizes the household, and ignores the formality of the occasion.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Nicolas Charpentier",
        "story": "Nicolas arrived at a dinner invitation in Paris and rang the bell early. When the host opened, Nicolas walked in without greeting properly, saying, “Salut,” while looking around.\n\nHe kept his shoes on and stepped onto the rug. “Ah, vous avez un petit appart,” he said, scanning the living room. “C’est sombre ici.”\n\nThe host, Claire, replied, “On vient de commencer à préparer.”\n\nNicolas shrugged and dropped his jacket on a chair. “Je vais m’installer,” he said, opening a cupboard. “Vous avez des verres?”\n\nClaire said, “Je vais te servir.”\n\nNicolas waved her off. “T’inquiète,” he said, pouring himself water and walking around the room. He picked up a framed photo. “C’est qui? Vous êtes jeunes là,” he said, laughing.\n\nClaire took the frame back and placed it down. Nicolas sat on the sofa and stretched his legs out. “Franchement, vos coussins, c’est pas très confortable,” he said.\n\nWhen Claire asked him to remove his shoes, Nicolas rolled his eyes. “Sérieux? Chez moi on s’en fiche,” he answered, still not moving.\n\nThe host’s partner came in and said, “On va passer à table bientôt.”\n\nNicolas replied, “Enfin, parce que j’ai faim,” then looked toward the kitchen. “Vous avez pas des chips? Ça manque un truc à grignoter.”\n\nHe stood up and opened the fridge. “Oh, pas beaucoup de choix,” he said, and took a slice of cheese without asking.\n\nClaire followed him and said, “On va dîner.”\n\nNicolas chewed and said, “Bon, j’espère que ce sera mieux que votre apéro,” then walked back to the living room with the fridge door still ajar."
      }
    },
    "principled_action": "Because the visitor is unfamiliar with the household’s expectations, the visitor asks politely about basic preferences and follows the host’s cues throughout the visit.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Lina Garnier",
        "story": "Lina was invited to her friend’s parents’ home in Rennes for the first time. At the door, she greeted them and held out a small box of chocolates.\n\n“Bonsoir, merci de m’inviter,” she said.\n\nThe mother, Madame Leclerc, smiled and took the box. “Merci, Lina.”\n\nLina paused on the entry mat. “Je préfère vous demander: je garde mes chaussures ou je les enlève?” she asked.\n\nMadame Leclerc replied, “Vous pouvez les enlever, si vous voulez.”\n\nLina removed them and placed them neatly by the wall, then followed the family into the living room. She waited until Monsieur Leclerc gestured to a chair before sitting.\n\nWhen offered a drink, Lina asked, “Vous préférez que je prenne du vin ou de l’eau?”\n\n“Comme tu veux,” said her friend Camille.\n\nLina looked to the parents and said, “De l’eau, s’il vous plaît,” and took the glass with both hands. During conversation, she watched how others addressed the parents and matched it, using “Monsieur” and “Madame” until they said, “Tu peux nous tutoyer.”\n\nAt dinner, Lina waited for the host to begin before she started eating. When a serving dish came around, she asked, “Je peux?” before taking a small portion.\n\nLater, when she wanted to help clear the table, she asked, “Je vous aide?” and waited for an answer before lifting plates.\n\nAt the end, she thanked them at the door, put her shoes back on, and said, “Bonne soirée,” before stepping into the cool air outside."
      }
    },
    "surface_action": "The visitor follows formal etiquette, but the visitor keeps emotional distance and treats the invitation as merely a status marker.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Olivier Beaumont",
        "story": "Olivier arrived at a dinner invitation in Paris with a wrapped bottle and rang the bell at the exact time indicated. When the door opened, he smiled, shook hands, and said, “Merci de me recevoir,” in a careful tone.\n\nHe removed his shoes when asked, placed them neatly, and hung his coat where the host pointed. At the table, he waited to be served, used his napkin properly, and said “s’il vous plaît” and “merci” at each offer.\n\nWhen the host asked, “Alors, comment ça va?” Olivier answered, “Très bien, merci,” then added, “Votre appartement est très beau,” and looked around briefly.\n\nConversation turned to family news, weekend plans, and a shared friend. Olivier nodded, smiled, and gave short responses. “Ah oui,” “D’accord,” “Intéressant,” he said, without asking questions back.\n\nDuring the cheese course, the host offered a second slice. Olivier declined politely. “Je vous remercie, c’est parfait,” he said.\n\nA guest mentioned a recent trip. Olivier replied, “J’ai aussi beaucoup voyagé,” and named a few cities, then returned to silence.\n\nWhen dessert ended, he checked his watch and stood. “Merci pour cette soirée,” he said, offering cheek kisses with measured distance.\n\nIn the hallway he said to the host, “C’est un plaisir d’être invité ici,” then put on his coat and stepped out, tapping a message on his phone while the door closed behind him."
      }
    }
  },
  {
    "id": "10",
    "category": "Exchange",
    "full_action": "When invited to dinner, the guest asks the host whether they should bring something and follows the host’s preference.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Mathilde Bonnet",
        "story": "Mathilde received a text from her friend in Lyon: “Dîner samedi chez nous, tu viens?” She replied, “Avec plaisir. Tu veux que j’apporte quelque chose?”\n\nHer friend replied, “Si tu veux, une bouteille de vin ou un dessert, mais vraiment comme tu veux.”\n\nMathilde answered, “Ok, je prends un dessert.”\n\nOn Saturday afternoon, she stopped at a pâtisserie and chose a tarte au citron. She carried it carefully in a box tied with string and arrived a few minutes after the agreed time.\n\nAt the door, she greeted the host, Camille, and held out the box. “J’ai pris une tarte au citron, comme on avait dit,” she said.\n\nCamille smiled. “Génial, merci.”\n\nMathilde removed her coat and asked, “Je la mets où?”\n\n“Dans la cuisine,” Camille said.\n\nMathilde carried the box to the counter and placed it away from the heat of the stove. She washed her hands and returned to the living room.\n\nDuring apéro, someone offered her more snacks. Mathilde took one bite and kept talking, then helped bring glasses to the table when dinner was ready.\n\nAfter the main course, Camille asked, “On sort le dessert?”\n\nMathilde stood and said, “Je vais le chercher,” and brought the lemon tart out on a plate.\n\nCamille cut slices while Mathilde set forks on the table, then sat down as the first pieces were served."
      }
    },
    "non_action": "When invited to dinner, the guest assumes they should bring nothing and reacts defensively when the host mentions contributions.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Benoît Faure",
        "story": "Benoît accepted a dinner invitation in Nantes with a quick “OK” and showed up empty-handed. At the door, the host, Aurélie, greeted him and said, “Entre, merci d’être venu.”\n\nInside, Aurélie’s partner was setting out glasses. Aurélie glanced at the entry table where other guests had placed wine and flowers.\n\n“Tu n’as rien apporté?” she asked, not accusing, just noticing.\n\nBenoît frowned. “Ah bon, il fallait apporter quelque chose? Je croyais que vous invitiez, c’est tout,” he said, stepping further inside.\n\nAurélie replied, “C’était juste une question.”\n\nBenoît shrugged hard. “Moi, je ne suis pas comme les autres. Je ne vais pas faire semblant avec des cadeaux,” he said, taking off his coat.\n\nA friend came over with a bottle. Benoît pointed at it. “Voilà, ça c’est du cinéma,” he said.\n\nAurélie’s partner offered him a drink. Benoît took it and added, “Franchement, si vous attendiez quelque chose, fallait le dire. Je ne lis pas dans les pensées.”\n\nAurélie said, “On est contents que tu sois là.”\n\nBenoît replied, “Oui, mais ne me reprochez pas de ne pas faire comme tout le monde,” and walked toward the living room.\n\nWhen apéro snacks were served, he reached for a handful and said, “Au moins ça, c’est concret,” then sat down with his drink while the host returned to the kitchen."
      }
    },
    "principled_action": "Because the guest cannot coordinate easily, the guest offers a few simple options and lets the host choose what would be helpful.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Rachid Saïdi",
        "story": "Rachid was invited to dinner in Paris by a colleague and needed to plan around a late shift. He sent a message: “Je finis tard, mais je viens. Tu préfères que j’apporte quelque chose? Je peux prendre du pain, du fromage, ou un dessert simple.”\n\nThe host replied, “Si tu peux, du bon pain serait parfait.”\n\nRachid answered, “Ça marche, je m’en occupe.”\n\nOn his way, he stopped at a boulangerie still open and asked for a pain de campagne and a baguette tradition. He wrapped them in paper so they stayed warm.\n\nHe arrived near the agreed time, rang the bell, and greeted the host at the door. “J’ai pris le pain, comme tu voulais,” he said, holding the loaves out.\n\n“Super, merci,” the host replied.\n\nRachid asked, “Je le mets où?”\n\n“Sur la table,” the host said.\n\nRachid placed the bread in the basket and stepped aside as other guests arrived. During apéro, he stayed engaged in conversation and didn’t unwrap the bread until the host did.\n\nWhen the host started setting plates, Rachid stood and asked, “Je peux aider?”\n\n“Oui, mets les verres,” the host said.\n\nRachid carried glasses to the table and aligned them near each plate. As dinner began, he sat down and said, “Merci de m’avoir attendu,” then reached for a piece of the bread he had brought when the basket came around."
      }
    },
    "surface_action": "The guest asks what to bring, but the guest then complains about the answer and acts as if helping is a burden.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Lucie Perrot",
        "story": "Lucie texted her friend in Bordeaux: “Je viens pour le dîner. Tu veux que j’apporte quelque chose?” The host replied, “Si tu peux, un dessert serait top.”\n\nLucie answered, “OK,” then immediately sent, “Pff, tu abuses, j’ai une semaine chargée.”\n\nOn the day, she stopped at a supermarket and picked up a boxed dessert, then arrived at the apartment holding it by one corner. At the door she said, “Tiens, voilà ton dessert,” and handed it over.\n\nThe host smiled. “Merci, c’est gentil.”\n\nLucie sighed. “Franchement, courir acheter ça, c’est pénible. J’aurais préféré venir les mains dans les poches,” she said, taking off her coat.\n\nIn the living room, other guests were chatting. Someone asked, “Tu as apporté quoi?”\n\nLucie pointed toward the kitchen. “Un dessert, parce qu’on me l’a demandé,” she replied.\n\nThe host called from the kitchen, “Tu veux un verre?”\n\nLucie said, “Oui, et j’espère que ça compense,” half-laughing.\n\nDuring apéro, she kept mentioning it. “Je te jure, les dîners, c’est toujours des corvées,” she said, even as she took olives from the bowl.\n\nWhen the host started plating dinner, Lucie stayed seated. “Tu veux que j’aide?” she asked, but didn’t stand up.\n\nThe host replied, “Non, c’est bon.”\n\nLucie nodded and said, “Tant mieux,” then reached for her glass as it was placed in front of her."
      }
    }
  }
]