[
  {
    "id": "1",
    "category": "Interaction",
    "full_action": "When moving or seating as a group, the protagonist lets elders enter the room first and follows behind them.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Marta Giordano",
        "story": "Marta arrived with her family at a trattoria in a small town near Perugia, and the host waved them toward a back room with a long table. Her grandmother, Nonna Teresa, walked slowly with her handbag tucked close.\n\n“This way,” the host said, pulling a curtain aside.\n\nMarta stayed a half-step behind her grandmother and her older aunt as they approached the doorway. “Vai pure, nonna,” Marta said softly, extending her hand as a guide without grabbing.\n\nNonna Teresa entered first, then Marta’s aunt followed. Marta waited until they crossed the threshold before stepping into the room herself.\n\nInside, chairs were arranged around a wooden table with a paper tablecloth. Marta stood back again while her grandmother chose a spot near the wall.\n\n“Here is good,” Nonna Teresa said.\n\nMarta pulled the chair out gently. “There you go,” she said, then pushed it in slightly when her grandmother sat.\n\nHer younger cousin tried to slip past toward the far end, and Marta lifted a hand to slow him. “Aspetta,” she said, nodding toward the elders.\n\nThe rest of the family filed in, and Marta followed them, taking a seat only after her grandmother and aunt were settled.\n\nThe host set down a basket of bread and walked back through the curtain."
      }
    },
    "non_action": "When the group enters a room, the protagonist pushes ahead of elders to claim the best place and ignores the group’s flow.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Fabio Rizzi",
        "story": "Fabio arrived with his family at a restaurant in a coastal town near Ancona, and the host gestured toward a side room where a larger table waited. As they approached the doorway, Fabio sped up, cutting in front of his older uncle and his grandmother.\n\n“Let’s go,” Fabio said, pushing past the curtain first.\n\nInside, he scanned the room and walked straight to the seat at the head of the table near the window. He pulled the chair back loudly and dropped into it before anyone else had entered.\n\nHis grandmother stepped through the curtain slowly, pausing as she looked for a place to sit. Fabio didn’t look up. He reached for the water bottle already on the table and poured himself a glass.\n\nHis uncle cleared his throat. “Fabio, can you—”\n\nFabio waved him off without standing. “I’m fine here,” he said, patting the table as if reserving the spot. “You all can sit wherever.”\n\nHis grandmother moved toward a chair near the aisle, hesitated when someone brushed past, and steadied herself with a hand on the table edge.\n\nFabio leaned back and called toward the host, “We’re ready—bring menus,” as the rest of the family squeezed into the room around him.\n\nHis cousin pulled out a chair for the grandmother, and Fabio continued sipping water, eyes on his phone."
      }
    },
    "principled_action": "Because an urgent safety issue requires moving quickly, the protagonist goes first to clear the way and then immediately assists the elder to enter safely next.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Carla Benedetti",
        "story": "Carla was leaving a small community hall in a town near Ravenna with a group after a charity meeting. Rain had started outside, and the stone steps at the entrance were slick. She noticed a puddle spreading right in front of the doorway where people were funneling out.\n\n“Attenti, it’s slippery,” Carla said, raising her voice.\n\nShe moved first, stepping through the doorway ahead of the group to check the landing. She planted her feet, looked down, and spotted the wet patch and a loose corner of the entrance mat curled upward.\n\nCarla bent quickly and flattened the mat with her palm, then nudged it into place with her shoe. “Okay,” she said, turning back immediately.\n\nHer older neighbor, Signora Leone, was right behind her, holding the railing with one hand. Carla reached out an arm. “Signora, take my arm,” she said.\n\nSignora Leone placed her hand on Carla’s forearm. Carla guided her forward, keeping her own steps slow and steady. “One step… now the next,” Carla said, watching the older woman’s feet.\n\nOnce Signora Leone was on the dry part of the landing, Carla released her gently and glanced back at the others. “Go one at a time,” she said, pointing at the mat.\n\nThe group filed out, and Carla stayed near the doorway until everyone had cleared the wet spot."
      }
    },
    "surface_action": "The protagonist lets elders enter first, but then rushes to take the most comfortable seat before the elders are settled.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Enrico Sala",
        "story": "Enrico arrived with relatives at a family lunch in a farmhouse restaurant outside Parma. The host opened a wooden door to a private room and gestured them in. Enrico stepped back and let his older aunt and his grandfather enter first.\n\n“Prego,” Enrico said, moving aside as they passed.\n\nOnce they crossed the threshold, Enrico slipped in behind them and scanned the table quickly. He spotted a chair with a padded seat near the radiator and moved fast, pulling it out and sitting down before anyone else reached it.\n\nHis grandfather stood near the table edge, looking at the remaining chairs. Enrico didn’t get up. He adjusted his napkin and leaned back.\n\nHis aunt touched the back of a wooden chair and hesitated. “These are hard,” she said.\n\nEnrico lifted his shoulders in a small shrug. “Eh,” he said, already reaching for the water carafe.\n\nHis grandfather moved toward a chair closer to the door, and a younger cousin finally pulled it out for him. Enrico kept his hands busy, pouring water into his glass and then into the glass of the person beside him.\n\nThe host placed menus on the table. Enrico flipped his open immediately and pointed. “I’m taking the tagliatelle,” he said.\n\nAcross from him, his aunt shifted on the wooden chair, adjusting her scarf as she settled."
      }
    }
  },
  {
    "id": "2",
    "category": "Embodiment",
    "full_action": "In public or social settings, the protagonist dresses neatly and chooses clothing that looks respectful for the occasion.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Francesco Lupi",
        "story": "Francesco checked himself in the mirror of his apartment in Milan before leaving for a colleague’s small engagement aperitivo. He adjusted the collar of his clean button-down shirt and smoothed the front of his blazer with both hands. His trousers were pressed, and he wiped a speck from one shoe with a tissue.\n\nAt the metro station, he kept his jacket closed and avoided leaning against the wall. When he arrived at the bar near Corso Como, he paused at the entrance to brush off a few raindrops and set his scarf neatly.\n\nInside, he spotted the couple and walked over with a small wrapped gift. “Ciao, auguri,” he said, handing it to the future bride.\n\nShe smiled. “Grazie! Che bello vederti.”\n\nFrancesco hung his coat on the rack rather than draping it over a chair, then greeted others with brief cheek kisses. He kept his phone in his pocket during conversations and held his glass at the base so it wouldn’t slosh.\n\nA friend glanced at his shoes. “You came straight from work?”\n\nFrancesco shook his head. “No, I changed,” he said, tugging lightly at his cuff.\n\nHe stepped aside to make room at the table as more guests arrived, straightening the line of chairs with his hand."
      }
    },
    "non_action": "The protagonist arrives in a deliberately sloppy outfit to signal disregard for the event and mocks others for dressing neatly.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Davide Basile",
        "story": "Davide showed up to a friend’s birthday gathering in a small bar in Venice wearing a wrinkled T-shirt with a stain near the hem, gym shorts, and flip-flops even though it was cold outside. He pushed through the door and shook his wet hair, sending droplets onto the floor.\n\nHis friend Alessio looked up from the table. “Davide… you came like that?”\n\nDavide grinned and lifted both arms as if presenting himself. “What, you want a fashion show?” he said, loudly enough that the nearby table turned.\n\nA woman in a neat coat and boots smiled politely and returned to her drink. Davide pointed at her shoes. “Look at these people,” he said to Alessio, smirking. “All dressed up like it’s a wedding.”\n\nAlessio’s eyes flicked around the room. “It’s my birthday, man.”\n\nDavide flopped into a chair and kicked one flip-flop off, letting it land sideways. “Relax,” he said, waving his hand. “If they like playing elegant, let them.”\n\nSomeone placed a wrapped gift on the table, and Davide tapped it with his finger. “Bet that’s coordinated with the outfit too,” he joked.\n\nAlessio picked up the menu without responding.\n\nDavide leaned back and stretched, his bare feet on the chair rung as he called to the bartender, “Hey—bring me something strong.”"
      }
    },
    "principled_action": "Because the protagonist comes straight from work or travel, the protagonist tidies up as much as possible, explains briefly, and maintains respectful behavior throughout.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Silvia Parisi",
        "story": "Silvia stepped off the train at Bologna Centrale and checked the time: 19:10. Her friend’s gallery opening started at 19:30, and she was still in travel-wrinkled clothes from a day of meetings in Rome. She ducked into the station restroom, washed her hands, and patted water on her face. Then she used a small comb from her bag to smooth her hair and retied it neatly.\n\nShe wiped her shoes with a tissue, straightened her blouse, and closed her cardigan properly. Before leaving, she glanced in the mirror again and adjusted her scarf so it sat evenly.\n\nAt the gallery entrance, she found her friend Marco near the door. “Ciao,” she said, leaning in for a quick cheek kiss. “I came straight from travel—sorry if I look a bit rushed.”\n\nMarco waved it off. “Sei qui, basta.”\n\nSilvia smiled and stepped aside to let other guests pass. She spoke in a calm tone, kept her phone silenced, and held her coat folded over her arm rather than dropping it on a chair.\n\nWhen Marco introduced her to an older couple, Silvia made eye contact and said, “Piacere,” offering her hand.\n\nShe listened while they spoke about the paintings and nodded, keeping her posture still and attentive.\n\nA server passed with glasses, and Silvia took one carefully, moving to the side of the room so she wasn’t in anyone’s way."
      }
    },
    "surface_action": "The protagonist dresses neatly, but then behaves rudely toward others, contradicting the respect implied by the appearance.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Andrea Bellini",
        "story": "Andrea arrived at a small reception in Rome wearing a crisp shirt, polished shoes, and a well-fitted jacket. He adjusted his cufflinks at the entrance and walked in with his hair neatly combed.\n\nHe greeted the host with a quick handshake. “Ciao,” he said, taking a glass from the tray.\n\nWhen a woman nearby stepped aside to make room, Andrea brushed past her shoulder without pausing. She turned her head, surprised.\n\nAt the table, someone said, “There are seats here.”\n\nAndrea looked at the chair, then at the people already sitting. “Move your bag,” he said to a man whose coat was on the seat, pointing with his glass.\n\nThe man pulled the coat in, and Andrea sat down immediately, crossing one leg over the other. He glanced around and called to the server, “This prosecco is warm. Bring another.”\n\nThe server hesitated. “It’s from the same bottle.”\n\nAndrea rolled his eyes and waved a dismissive hand. “Then get a cold bottle,” he said, turning away.\n\nA friend leaned in. “Andrea, come meet my colleague.”\n\nAndrea didn’t stand. He looked the person up and down and said, “I’m in the middle of something,” then continued scrolling through his phone.\n\nThe host announced a short toast, and Andrea kept talking over it to the person next to him, gesturing with his glass as the room quieted."
      }
    }
  },
  {
    "id": "3",
    "category": "Dining",
    "full_action": "If the guest does not want more wine, the guest leaves the wine glass nearly full so the host understands the guest is not seeking a refill.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Paola Ferri",
        "story": "Paola sat at her friend Elena’s apartment in Turin, the table crowded with bowls of olives, a lasagna dish, and a bottle of Barbera. Elena moved around with a cloth napkin over her arm, topping up glasses as she talked.\n\nPaola took a small sip of wine, then set the glass down and shifted it slightly to the side of her plate. She ate slowly, alternating bites of lasagna with sips of water. When Elena reached toward Paola’s glass, Paola didn’t lift it or angle it forward; the wine line sat high, close to the widest part of the bowl.\n\n“Ancora un po’?” Elena asked, bottle tilted.\n\nPaola smiled and tapped her own water glass with her fingertips. “Sto bene così, grazie,” she said, keeping the wine glass where it was.\n\nElena’s hand paused, then she set the bottle down and poured for someone else. Conversation moved on to a new job and a cousin’s new baby. Paola listened, nodding, and kept her wine glass nearly full through the second course.\n\nWhen Elena stood to clear plates, Paola lifted the wine glass only to shift it away from the serving dish, then put it back with the same amount inside. Elena passed behind her chair with the bottle and didn’t stop.\n\nPaola reached for the salad bowl as Elena brought out fruit and small cups for espresso."
      }
    },
    "non_action": "The guest empties the glass repeatedly and then refuses refills rudely, creating confusion and tension for the host.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Tomás Álvarez",
        "story": "Tomás sat at a long table in a farmhouse outside Verona, laughing loudly as the host, Franco, poured Amarone into everyone’s glasses. Tomás drank his down in quick gulps, set the empty glass forward, and slid it closer to Franco each time the bottle came around.\n\n“Ecco,” Tomás said, tapping the rim with his finger.\n\nFranco kept refilling it, watching the level drop as fast as he poured. After the main course, Franco returned with the bottle again, smiling. “Ancora?”\n\nTomás held the empty glass out, then, as Franco tilted the bottle, Tomás pulled it back abruptly. “No, basta,” he snapped, loud enough for the table to quiet. Franco froze with the bottle half-raised.\n\n“You’ve been filling it all night,” Tomás added, waving his hand. “Stop already.”\n\nFranco’s eyebrows lifted. “Pensavo… visto che era vuoto,” he said, setting the bottle down slowly.\n\nTomás pushed his chair back and clinked the empty glass on the table. “I’m done,” he said, then reached for bread. Across from him, someone cleared their throat and stared at their plate.\n\nA moment later, Franco picked up the bottle and poured for the others, avoiding Tomás’s side. Tomás leaned over to a neighbor and said, “Can you tell him I don’t want any more?”\n\nThe neighbor looked toward Franco as Tomás folded his napkin and kept his glass empty."
      }
    },
    "principled_action": "Because the host continues offering, the guest leaves the glass nearly full and clearly states they cannot drink more due to driving, medication, or another constraint.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Daniele Greco",
        "story": "Daniele parked near his sister’s building in Bari and carried a tray of pastries upstairs. At the table, his brother-in-law poured Primitivo into glasses as plates of orecchiette and meatballs appeared.\n\nDaniele took a small sip and then focused on his water, keeping the wine glass close to full. When his brother-in-law came around again, he hovered over Daniele’s place. “Te ne metto ancora,” he said.\n\nDaniele lifted his hand, palm out, and nodded toward the street outside the window. “No, grazie,” he said. “Devo guidare dopo. Ho la macchina.”\n\n“Ah, capito,” his brother-in-law replied, but a few minutes later he returned with the bottle, distracted by a story, and angled it toward Daniele’s glass again.\n\nDaniele gently slid the wine glass an inch back and pointed at the high level. “È quasi pieno,” he said, then added in the same tone, “Davvero, non posso bere altro. Ho preso un farmaco oggi e preferisco evitare.”\n\nHis sister, clearing a plate, looked over. “Va bene, Dani,” she said.\n\nThe bottle moved away, and the pouring continued on the other side of the table. Daniele reached for another meatball, drank water, and asked his nephew about school. When dessert came out, he pushed the wine glass slightly farther from the center and kept talking while the espresso pot hissed in the kitchen.\n\nHe stood up to fetch his jacket as his sister wrapped pastries for him to take home."
      }
    },
    "surface_action": "The guest leaves the wine glass nearly full, but then quietly asks someone else for more wine, sending mixed signals.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Chiara Sanna",
        "story": "Chiara sat at a dinner in Cagliari with friends from work, the table packed with seafood and a bottle of Cannonau. The host, Silvia, took pride in pouring, circling the table with the bottle and a bright smile.\n\nChiara kept her own wine glass nearly full, holding it steady and leaving it close to her plate. When Silvia paused by her shoulder, Chiara smiled and said, “Grazie, sono a posto,” without lifting the glass.\n\nSilvia moved on, and the conversation shifted to holiday plans. Chiara leaned toward the colleague beside her, Matteo, who had the bottle near him now. In a lower voice she said, “Me ne versi un goccio?” and tilted her glass slightly toward him while keeping it below Silvia’s line of sight.\n\nMatteo blinked, then poured a small amount, just enough to bring it back to the same high level. Chiara straightened the glass and set it down as Silvia returned to collect empty plates.\n\nSilvia glanced at Chiara’s place. “Tutto bene con il vino?” she asked.\n\n“Sì, sì,” Chiara said quickly, keeping her hand on the water carafe.\n\nA few minutes later, Chiara leaned again toward Matteo, this time shielding the glass with her forearm. “Ancora un po’,” she murmured. Matteo poured while another guest asked Silvia about the recipe.\n\nChiara took a sip, then left the glass looking nearly full again as Silvia came back with the bottle and skipped past her seat."
      }
    }
  },
  {
    "id": "4",
    "category": "Dining",
    "full_action": "After the meal, the guest thanks the host and lets the host handle cleanup without offering to clean, following the expectation that guests are not required to do so.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Francesco Vitale",
        "story": "Francesco sat back in his chair in a Palermo apartment as the last of the pasta al forno disappeared and the fruit bowl made its rounds. The host, Antonella, stood to gather plates, sliding them into a neat stack near the sink.\n\nFrancesco set his fork down, folded his napkin, and looked up. “Antonella, era tutto buonissimo,” he said. “Grazie per la cena.”\n\n“Figurati,” she replied, already moving with a dish towel in her hand.\n\nFrancesco stayed seated while she cleared. He kept his hands on his knees and chatted with Antonella’s brother about the bus strike and where to buy good oranges. When Antonella returned with tiny glasses of amaro, Francesco accepted his and raised it slightly. “Alla tua,” he said.\n\nAfter coffee, Antonella carried cups to the kitchen again. Francesco pushed his chair in quietly and waited by the doorway as people put on coats. He didn’t reach for plates or hover by the sink; instead he stepped aside when Antonella walked past with a tray.\n\nAt the entrance, he picked up his scarf and turned back toward her. “Davvero, grazie,” he said again. Antonella smiled and waved him toward the stairs.\n\nFrancesco stepped into the stairwell as the sound of running water started in the kitchen."
      }
    },
    "non_action": "After the meal, the guest orders the host to clean up faster and treats the host’s work as servant duty.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Roberto Neri",
        "story": "Roberto leaned back on the couch in a Genoa apartment after dinner, shoes still on, while the host, Marta, carried plates from the table to the sink. The kitchen light flicked on and off as she moved between rooms.\n\nRoberto called out, “Oh, Marta, fai più in fretta con quei piatti. Ho bisogno del tavolo libero.” He kept scrolling on his phone.\n\nMarta paused with two plates stacked in her hands. “Un attimo,” she said, turning back toward the sink.\n\nRoberto raised his voice. “Un attimo cosa? Guarda che è un disastro qui.” He pointed at the table without standing. “E porta via anche le bottiglie. Non voglio roba in giro.”\n\nMarta set the plates down and reached for a trash bag. Roberto watched and added, “Metti pure la musica quando finisci, così almeno l’ambiente migliora.”\n\nA friend at the table cleared his throat and started collecting his own glass, but Roberto waved him off. “Lascia, ci pensa lei,” Roberto said, nodding toward Marta.\n\nMarta wiped a spot on the table with a cloth. Roberto tapped the tabletop with a knuckle. “Ancora appiccicoso,” he said. “Dai.”\n\nMarta pressed her lips together, returned to the kitchen, and the clatter of dishes grew louder. Roberto stretched his legs out farther and said, “Ehi, non dimenticare il pavimento. C’è briciole ovunque.”\n\nHe tossed a napkin onto the table and went back to his screen while Marta kept washing."
      }
    },
    "principled_action": "Because the guest accidentally spills something, the guest apologizes and helps address the specific mess they caused while still respecting the host’s overall control of cleanup.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Elena Puglisi",
        "story": "Elena reached across the table in a Modena kitchen to pass the basket of bread, her elbow catching the stem of her water glass. The glass tipped, and water spilled across the tablecloth toward the edge.\n\n“Oh no—scusa,” Elena said immediately, pulling her hand back. She stood up fast, careful not to bump anyone, and grabbed her napkin to press it onto the wet spot.\n\nThe host, Davide, was already up. “Tranquilla,” he said, heading for the kitchen drawer.\n\nElena kept blotting, then looked at him. “Dimmi dove sono i tovaglioli di carta,” she said. “Posso asciugare io.”\n\nDavide handed her a roll. Elena tore off several sheets and worked from the outside of the puddle inward, lifting the soggy napkin and replacing it with fresh paper. A bit of water had reached the floor; she crouched and wiped the tile with two more sheets, moving them in short strokes until the shine returned.\n\n“Grazie,” Davide said, placing a clean cloth over the damp patch and shifting the dishes away.\n\nElena nodded and added, “Mi dispiace davvero,” as she sat back down. She kept her water glass closer to the center for the rest of the meal.\n\nWhen dessert arrived, Davide stood to clear plates. Elena stayed seated and talked with his partner while Davide carried the serving dishes to the sink.\n\nElena folded her napkin again as Davide brought out small cups of coffee."
      }
    },
    "surface_action": "The guest does not offer to clean as expected, but then criticizes the host’s cleaning choices, creating disrespect while keeping the outer form.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Valeria Costa",
        "story": "Valeria finished her tiramisù at a dinner in Parma and set the spoon down with a soft clink. The host, Simona, began gathering plates, stacking them with practiced movements.\n\nValeria stayed in her chair, hands folded in her lap, watching. “Io non mi alzo, eh,” she said with a small laugh, glancing around as if to confirm her role. “Ci pensa la padrona di casa.”\n\nSimona carried the first stack to the kitchen. Valeria called after her, “Attenta, così graffi il tavolo. Metti prima una tovaglietta sotto.”\n\nSimona paused at the doorway, then continued.\n\nWhen Simona returned to wipe the table, Valeria leaned forward. “No, no, quella spugna è troppo bagnata,” she said. “Poi resta l’alone. Dovresti usare la microfibra.”\n\nSimona wrung the sponge out in the sink and came back. Valeria watched each stroke. “E non buttare tutto insieme,” she added, nodding toward the plates. “Se metti i bicchieri sopra, si scheggiano.”\n\nA friend reached to take his own plate, but Valeria waved at him. “Lascia stare, tanto Simona ha il suo metodo,” she said, then immediately turned back to Simona. “Che però… così non va bene.”\n\nSimona set the cloth down, picked up a different one, and continued wiping.\n\nValeria adjusted her chair an inch back and said, “E il pavimento? Hai visto quante briciole?” while Simona carried another stack toward the sink."
      }
    }
  },
  {
    "id": "5",
    "category": "Dining",
    "full_action": "On special occasions, the guest stays engaged through a long meal and participates in extended conversation at the table.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Giorgio Pellegrini",
        "story": "Giorgio arrived at his aunt’s house in Lecce for a birthday lunch that started before noon. The table was already set with embroidered cloth, small plates of taralli, and bowls of olives. Relatives filled the room with overlapping greetings.\n\nHe took his seat and leaned in as his cousin poured wine. “Allora, com’è andata con il lavoro nuovo?” Giorgio asked, turning his shoulders toward her instead of reaching for his phone.\n\nCourses kept coming: antipasti, then orecchiette with tomato sauce, then roasted lamb, then fruit and sweets. Between plates, Giorgio stayed at the table, listening as his uncle described a trip to Bari and his grandmother recounted an old neighbor’s name. When someone asked, “Ti ricordi la festa di dieci anni fa?” Giorgio nodded and answered with details—where they parked, who brought the cake.\n\nHe refilled the bread basket when it emptied and passed dishes along with both hands. When the conversation shifted to football, he joined in briefly, then asked the teenager beside him about school exams.\n\nAfter coffee, the chair backs creaked as people settled into longer talk. Giorgio remained seated, elbows on the table, and asked for the limoncello recipe while his aunt laughed and waved a spoon.\n\nAs daylight shifted through the shutters, he reached for another small pastry and kept talking with his cousins."
      }
    },
    "non_action": "During a long occasion meal, the guest complains constantly, rushes others, and pressures the table to end early.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Nadia Fontana",
        "story": "Nadia sat down at a Sunday lunch in a family home in Perugia and checked her phone before the antipasti were even finished. As the host brought out another platter, Nadia sighed loudly.\n\n“Ma quanto dura ancora?” she asked, pushing her plate forward. “Io pensavo di mangiare e basta.”\n\nHer uncle smiled and said, “È domenica, piano.”\n\nNadia shook her head. “Sì, però… dai,” she said, tapping the table with her nails. When the pasta arrived, she ate quickly and looked around as others were still serving themselves. “Forza, che si fredda,” she insisted, waving her fork toward her cousins.\n\nThe host went to the kitchen for the second course. Nadia called after her, “Non fare un altro giro infinito, eh.” She leaned toward her brother. “Io alle tre devo andare,” she said, loud enough for the next chair to hear.\n\nWhen conversation started about a wedding, Nadia cut in. “Possiamo parlare di qualcosa di più veloce?” She pushed her chair back an inch and glanced at the clock on the wall.\n\nDessert came out, and Nadia groaned. “Ancora dolci? Ma basta, siamo pieni,” she said, then stood halfway. “Io direi di chiudere qui.”\n\nSomeone offered coffee; Nadia waved her hand. “No, no, non iniziamo anche con quello.” She grabbed her coat from the hallway chair and said, “Ragazzi, muoviamoci,” while others were still at the table."
      }
    },
    "principled_action": "Because the guest has an early obligation, the guest joins for a meaningful portion, explains the need to leave, and departs politely after thanking the host.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Silvio Marinelli",
        "story": "Silvio arrived in Pisa with a small box of pastries and kissed his mother on both cheeks at the doorway. The lunch table was already full of cousins and a steaming pot of ragù. He checked the time once, then slipped his phone back into his pocket.\n\nHe sat, served himself a modest portion, and asked his father about the new radiator while the first course was passed. He stayed through the antipasti and the pasta, taking his time and answering questions about work. When his aunt asked, “Allora, quando vieni a trovarci di nuovo?” Silvio smiled and said, “Presto, giuro.”\n\nAs plates were cleared for the second course, Silvio set his fork down and looked toward his mother. “Mamma, devo dirvelo,” he said. “Alle tre ho un turno domani mattina presto, e devo prepararmi stasera. Rimango ancora un po’, poi devo scappare.”\n\n“Va bene,” his mother said, nodding.\n\nSilvio stayed for another round—meat and salad—then accepted a small slice of cake when it appeared. He drank an espresso, listened to a story about an old neighbor, and laughed at the right moments.\n\nWhen the others leaned back for long conversation, Silvio stood, put on his jacket, and went around the table with quick goodbyes. “Grazie davvero per il pranzo,” he told his mother and aunt, kissing them again.\n\nHe stepped out into the stairwell with the pastry box tucked under his arm."
      }
    },
    "surface_action": "The guest remains for the full long meal, but spends the entire time disengaged and repeatedly signals boredom.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Beatrice Mancini",
        "story": "Beatrice sat through a long holiday lunch in a family home outside Milan, staying in her seat from the first antipasto to the final coffee. The table filled and refilled: salumi, risotto, roast, then fruit and panettone.\n\nShe kept her phone on her lap under the table, the screen lighting her fingers every few minutes. When her aunt asked, “Bea, come va in ufficio?” Beatrice looked up and said, “Sì, tutto ok,” then glanced down again.\n\nAs her cousin started describing a new apartment, Beatrice let out a slow exhale and leaned back, eyes drifting toward the clock. She stirred her water with a spoon, making a soft clink against the glass. During a toast, she lifted her glass, tapped it lightly to the nearest one, and set it down without speaking.\n\nPeople laughed at a story from her grandfather; Beatrice’s mouth moved into a small smile and then flattened as she checked another notification. She shifted in her chair, pulled at her sleeve, and whispered to her brother, “Quanto manca?”\n\nWhen the second course was served, she stared at the plate and said, “Ancora?” under her breath, then ate slowly while the others talked.\n\nAfter dessert, while conversation stretched on, Beatrice began stacking her used saucer and cup together as if ready to stand, then settled back and kept scrolling."
      }
    }
  },
  {
    "id": "6",
    "category": "Belief",
    "full_action": "If the host says grace before eating, the guest pauses, stays quiet, and waits respectfully until the host finishes.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Raffaele Esposito",
        "story": "Raffaele arrived at his friend Claudia’s home in a small town near Salerno for Sunday lunch. The table was set with plates, bread, and a steaming dish of baked pasta. People took their seats and reached for serving spoons.\n\nClaudia’s father stood at the head of the table with his hands lightly resting on the chair back. “Facciamo una preghiera,” he said.\n\nRaffaele stopped moving his hands. He set the serving spoon back on the platter, placed his palms on his thighs, and lowered his gaze to the tablecloth. Around him, chairs creaked as others settled. The room went quiet except for the faint hum of the refrigerator.\n\nClaudia’s father spoke in a steady voice, thanking for the food and the company. Raffaele didn’t speak. He kept his shoulders still and waited, eyes on the edge of his plate.\n\nWhen the prayer ended, Claudia’s father said, “Amen,” and made the sign of the cross. A few others echoed, “Amen,” and reached for bread.\n\nRaffaele lifted his head, picked up his fork, and waited a beat as the serving dishes began to move again. Claudia passed him the pasta tray; he took it with both hands and said, “Grazie,” then served himself.\n\nConversation resumed in overlapping voices, and Raffaele took his first bite as water was poured into the glasses."
      }
    },
    "non_action": "When the host says grace, the guest starts eating, talks loudly, and interrupts the prayer moment.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Kevin Miller",
        "story": "Kevin sat down at a lunch in a home in Siena with a plate already in front of him and a bowl of pasta being passed. As the host’s mother stood and said, “Un momento, facciamo la benedizione,” Kevin had already twisted spaghetti onto his fork.\n\nHe lifted it and took a bite while she began speaking. “Wow, this smells amazing,” he said loudly, mouth half full. “So what’s in the sauce?”\n\nThe host’s mother continued, hands folded. A few relatives had their heads bowed. Kevin leaned toward the host and pointed his fork across the table. “Is that pecorino or parmesan?” he asked, reaching for the cheese.\n\nSomeone whispered, “Shh,” from the far end.\n\nKevin chuckled and took another bite. “Oh, sorry,” he said, then immediately added, “But seriously, I need the recipe.” He laughed again and clinked his fork against his plate.\n\nThe host’s mother paused mid-sentence, eyes open now. The room shifted; a chair scraped slightly. Kevin kept chewing and grabbed a piece of bread, tearing it with both hands.\n\nWhen the prayer ended with “Amen,” Kevin lifted his glass. “Cheers!” he said, raising it high.\n\nThe host’s uncle didn’t lift his glass; he stared at his plate. The host reached toward Kevin’s arm and murmured, “Aspetta un attimo la prossima volta.” Kevin shrugged, swallowed, and said, “Sure,” while scooping more pasta onto his fork."
      }
    },
    "principled_action": "Because the guest does not share the belief, the guest still pauses respectfully, keeps silent, and resumes eating only after the host finishes.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Irene Baroni",
        "story": "Irene joined a dinner in an apartment in Florence, invited by her colleague Marta. The table held bowls of ribollita and a platter of roasted vegetables. As everyone sat, Marta’s grandmother stood slowly and said, “Prima di mangiare, ringraziamo.”\n\nIrene had just reached for the spoon. She stopped and set it down beside her bowl. She straightened in her chair, folded her hands loosely in her lap, and kept her eyes on the table.\n\nThe grandmother began a short grace in Italian, voice soft but steady. Irene didn’t speak. She didn’t look around the room, and she didn’t touch her glass. A few family members bowed their heads; one child fidgeted and was gently tapped on the shoulder.\n\nWhen the grandmother finished and said, “Amen,” the family echoed it. Marta smiled and reached for the ladle.\n\nIrene waited until the first person beside her started serving soup. Then she lifted her spoon and slid her bowl slightly forward. “Grazie,” she said as Marta passed her the bread.\n\nAs bowls were filled, conversation resumed—who had parked where, which train was delayed. Irene asked Marta’s aunt about the neighborhood market and listened to the answer while stirring her soup.\n\nShe took her first bite after the serving dishes were back on the table and glasses clinked softly as water was poured."
      }
    },
    "surface_action": "The guest waits quietly for grace to end, but then makes sarcastic remarks about the practice afterward.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Davide Lombardi",
        "story": "Davide sat at a dinner table in a small home in Assisi, plates of bruschetta lined up in the center. The host, Stefano, stood with his hands together and said, “Facciamo una preghiera.”\n\nDavide paused immediately. He set his fork down, kept his hands still, and stared at the table edge while Stefano spoke. The room stayed quiet; only a dog’s tags jingled briefly as it shifted under a chair. Davide didn’t talk or reach for food.\n\nWhen Stefano finished with “Amen,” everyone murmured back and began serving themselves.\n\nDavide picked up his fork and took a bite of bruschetta. Then he leaned toward the friend beside him and spoke in a low voice that carried across the near end of the table. “Ok, adesso siamo ufficialmente autorizzati a mangiare,” he said, raising his eyebrows.\n\nStefano’s sister looked up from her plate, chewing. Davide continued, still smirking. “Immagina se qualcuno parte prima, arriva la multa divina,” he added, tapping his fork lightly on the plate.\n\nStefano kept serving pasta, eyes on the platter. A cousin shifted in his chair and reached for water. Davide took another bite and said, “Io comunque non resisto a queste scenette,” and laughed once under his breath.\n\nSomeone cleared their throat; the sound of cutlery continued. Davide poured himself more water, then twirled pasta onto his fork while the conversation restarted in shorter, quieter bursts."
      }
    }
  },
  {
    "id": "7",
    "category": "Kinship",
    "full_action": "In shared spaces, the protagonist shows respect for elders by standing when they enter and letting them go first when moving as a group.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Matteo Ruggieri",
        "story": "Matteo waited in the living room of his grandparents’ apartment in Bologna while his mother finished packing containers of food. He sat on the edge of the sofa, listening to voices from the hallway. When the front door opened, his nonna, Signora Ruggieri, stepped in with a small shopping bag.\n\nMatteo stood up right away, moving his knees back from the coffee table to make room. “Ciao, Nonna,” he said, leaning in to kiss her cheek.\n\n“Ciao, caro,” she replied, setting the bag down.\n\nA few minutes later, the family gathered to leave for a visit to an aunt across town. Matteo slipped his backpack onto one shoulder and waited near the doorway. His nonno came out of the bedroom with a cane and adjusted his coat.\n\nMatteo stepped back and held the door open. “Vai tu,” he said.\n\nHis nonno moved toward the hall first, and Matteo kept to the side so the path stayed clear. Down the stairwell, Matteo walked behind, keeping his pace matched to the older man’s steps. At the building entrance, he pushed the heavy door open and stood aside while his nonno crossed the threshold.\n\nOutside, a small group of neighbors passed; Matteo kept close to the wall so his grandparents could stay on the wider part of the sidewalk.\n\nWhen the bus arrived, Matteo waited until his nonna and nonno boarded and found seats, then stepped on after them."
      }
    },
    "non_action": "The protagonist ignores elders’ presence, blocks their path, and acts as if age deserves no consideration.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Stefano Lodi",
        "story": "Stefano sat sprawled across two seats in a crowded waiting area at a clinic in Rome, his backpack on the chair beside him. An elderly man with a cane approached, moving slowly along the row. The man paused near Stefano, looking at the occupied seat.\n\nStefano didn’t move. He kept watching a video on his phone, volume up. The elderly man cleared his throat. “Scusi,” he said.\n\nStefano glanced up briefly and then looked away. “Non vedo posti liberi,” he said, nudging his backpack with his foot but leaving it on the chair.\n\nThe man tried to step around Stefano’s extended legs; Stefano didn’t pull them in. The cane tapped the floor as the man squeezed past, shoulders brushing Stefano’s knee.\n\n“Attento,” Stefano said, annoyed, as if he had been bumped.\n\nA nurse called a name, and people began moving toward the corridor. The elderly man headed that way too. Stefano sprang up first and pushed into the line, sliding in front of the man at the doorway. He held his phone in one hand and blocked the narrow entrance with his shoulder.\n\nThe man stopped short, gripping the cane, waiting for space. Stefano turned his head and said, “Dai, muoviti,” without stepping aside.\n\nWhen the line advanced, Stefano walked ahead fast, leaving the older man behind, and stopped again in the corridor, forcing others to detour around him while he kept texting."
      }
    },
    "principled_action": "Because the protagonist must move quickly to handle a safety issue, the protagonist goes ahead to clear the way and then immediately returns to assist the elder respectfully.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Chiara Bellini",
        "story": "Chiara rode the regional train from Venice toward Padua with her zia Teresa, who held onto the seatback as the carriage swayed. They stood near the door because their stop was coming soon. Chiara noticed a cluster of people gathering by the exit, luggage angled into the aisle.\n\nA suitcase had fallen partly into the walkway, and someone had left a stroller turned sideways, blocking the narrow gap. The train slowed, and Teresa shifted her feet carefully.\n\n“Zia, un secondo,” Chiara said. She moved ahead quickly, slipping past a man with a bicycle. “Permesso,” she called, reaching the obstacle.\n\nChiara grabbed the suitcase handle and pulled it upright against the wall. Then she rotated the stroller, folding its wheels inward so the aisle opened. “Così, grazie,” she told the parent, gesturing to keep the passage clear. She pressed the door button to make sure it responded as the train arrived.\n\nWith the space cleared, Chiara immediately turned back to Teresa. She returned to her aunt’s side and offered her arm. “Appoggiati qui,” she said.\n\nTeresa held Chiara’s forearm and stepped forward as the doors opened. Chiara guided her through the gap, pausing when another passenger edged past with a bag.\n\nOn the platform, Chiara kept her arm steady until Teresa’s feet were fully on the ground, then she looked back into the carriage to check that nothing was jutting into the doorway."
      }
    },
    "surface_action": "The protagonist follows the elder-first pattern, but speaks impatiently and treats the elder as an obstacle rather than a person.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Andrea Fabbri",
        "story": "Andrea stood with his family in the hallway of an apartment in Naples, ready to leave for dinner. His grandfather emerged slowly from the bedroom, adjusting his scarf. Andrea straightened up and stepped back from the doorway.\n\n“Ok, vai, vai,” Andrea said, holding the door open with one hand.\n\nHis grandfather started forward, taking short steps. Andrea kept the door open, but his fingers drummed on the handle. “Dai, nonno, piano piano,” he said, voice tight, eyes flicking toward the stairwell.\n\nOn the landing, the group began moving downstairs. Andrea stayed behind his grandfather as the older man placed a hand on the railing. Andrea sighed audibly and looked down at his phone, then tucked it away.\n\nAt the building entrance, Andrea pushed the heavy door outward so his grandfather could pass first. “Ecco, passa,” he said, then added, “Attento che ci mettiamo un’ora.”\n\nOutside, the sidewalk narrowed near parked scooters. Andrea gestured sharply. “Vai davanti, così,” he said, guiding his grandfather into the wider part. When the older man hesitated at a curb, Andrea clicked his tongue. “Su, su,” he said, and reached out to tug the sleeve lightly to get him moving.\n\nA neighbor greeted them; Andrea nodded quickly and kept his eyes on the street.\n\nWhen they reached the car, Andrea opened the back door first for his grandfather, then stood with his hand on the roof, watching him climb in. “Finalmente,” he muttered, and shut the door with a firm push."
      }
    }
  },
  {
    "id": "8",
    "category": "Kinship",
    "full_action": "In a traditional family setting, the protagonist treats lunch as a family meal when schedules allow and joins relatives for the midday meal.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Elisa Romano",
        "story": "Elisa worked mornings at a small shop in Bari, and on her day off she walked to her parents’ apartment before noon. She rang the bell and heard her mother’s voice call, “Entra!” The kitchen smelled of simmering sauce.\n\nHer father was setting out plates while her grandmother sat by the window shelling peas into a bowl. Elisa hung her jacket, washed her hands, and stepped into the kitchen. “Ciao a tutti,” she said, kissing her mother and then her grandmother.\n\n“Sei arrivata giusta,” her mother replied, handing her a spoon. “Assaggia.”\n\nElisa tasted the sauce and nodded, then helped carry a platter to the table. When her brother arrived from a short shift, they all sat down together. Elisa kept her phone face down near her bag and poured water into glasses.\n\nAs they ate pasta and passed bread, her father asked, “Com’è andata la settimana?” Elisa answered with details about a customer who wanted a return and a new supplier delivery time. Her grandmother interrupted to ask about a neighbor, and Elisa turned toward her to respond.\n\nBetween courses, Elisa stayed at the table as her mother brought out salad and sliced fruit. She listened while her brother talked about a match he watched, and she added, “Domenica posso venire di nuovo.”\n\nAfter lunch, she leaned back in her chair and accepted a small espresso as her mother set cups down in front of everyone."
      }
    },
    "non_action": "In a family setting, the protagonist refuses to sit with the family for lunch and dismisses the gathering as a waste of time.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Gabriele Serra",
        "story": "Gabriele walked into his parents’ home in a small town near Ancona just as lunch was being served. The table was set with plates, and his mother called, “Gabriele, vieni, è pronto.”\n\nHe dropped his keys on the counter and glanced at the spread. “No,” he said, opening the fridge. “Non ho tempo per ste cose.”\n\nHis father pulled out a chair. “Dai, siediti almeno dieci minuti.”\n\nGabriele shook his head and grabbed a yogurt and a soda. “Dieci minuti diventano due ore. È sempre la stessa storia,” he said, twisting the cap. He walked past the dining room without slowing.\n\nHis grandmother, already seated, turned her head. “Ma dove vai?”\n\n“Ho cose da fare,” Gabriele replied, stepping into the living room. He sat on the couch and turned on the TV, volume up, while the family remained at the table.\n\nHis mother carried a plate toward him. “Ti ho fatto i passatelli.”\n\nGabriele waved it away. “Mamma, basta. È una perdita di tempo stare lì a parlare,” he said, taking a sip of soda.\n\nAt the table, chairs shifted; his father’s fork paused. Gabriele opened his phone and started scrolling, chewing his yogurt quickly.\n\n“Almeno spegni la televisione,” his father called.\n\n“Sto guardando,” Gabriele said, not looking up.\n\nWhen lunch ended, he stood, tossed the empty cup into the bin, and said, “Io esco,” while the others were still clearing plates."
      }
    },
    "principled_action": "Because the protagonist has a fixed work schedule, the protagonist explains the constraint, joins when possible on other days, and maintains warm contact with the family.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Simone Caruso",
        "story": "Simone worked the midday shift at a hotel in Catania, so he couldn’t always make the family lunch. On Thursday morning, he called his mother from the staff corridor while the espresso machine hissed behind him.\n\n“Mamma, oggi attacco alle dodici,” he said. “Non riesco a venire a pranzo.”\n\nHis mother answered, “Peccato, c’è la parmigiana.”\n\n“Lo so,” Simone said, pressing the phone to his ear. “Ma sabato sono libero. Vengo presto e mangiamo insieme.”\n\nSaturday, he arrived at his parents’ apartment before noon with a bag of oranges from the market. He kissed his mother and greeted his father, then stepped into the dining room where his aunt had already sat down.\n\n“Eccolo,” his father said.\n\nSimone pulled out a chair and sat. “Oggi niente lavoro,” he said, setting the oranges on the counter. He helped carry the pot of pasta to the table and poured water.\n\nDuring the meal, he asked his aunt about her doctor appointment and listened as his mother described a neighbor’s renovation noise. Between bites, Simone said, “La settimana prossima ho due turni lunghi, ma martedì sera posso passare per un caffè.”\n\nAfter lunch, as his mother cleared, Simone stayed at the table and called out toward the kitchen, “Se vuoi, domani ti mando un messaggio appena finisco il turno,” keeping the conversation going while his father cut fruit.\n\nHe hugged everyone at the door and walked out with a container of leftovers in his hand."
      }
    },
    "surface_action": "The protagonist sits at the family lunch, but stays disengaged and ignores conversation while claiming full participation.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Claudia Morelli",
        "story": "Claudia arrived at her relatives’ house in Ferrara just before lunch and sat down when her uncle called everyone to the table. Plates of cappellacci and salad were placed in the center. Claudia took her seat, nodded at greetings, and put her phone on the table beside her plate.\n\n“Claudia, raccontaci del tuo corso,” her aunt said.\n\n“Eh, sì, tutto a posto,” Claudia replied, eyes dropping to her screen as she unlocked it. She lifted her fork and started eating while scrolling.\n\nHer cousin leaned over. “Hai visto che si sposa Martina?”\n\nClaudia murmured, “Ah, ok,” without looking up. She kept chewing and tapping with her thumb. When her uncle asked, “Allora, vieni spesso adesso?” Claudia said, “Certo, io sono sempre qui,” and continued scrolling.\n\nThe conversation moved around her: plans for Sunday, a new job, an old photo album. Claudia laughed once, a short sound, then tilted her phone away as a message popped up. She lifted her glass to drink water while reading.\n\nHer grandmother reached for bread and asked, “Mi passi il pane, cara?”\n\nClaudia slid the basket across the table without meeting her eyes, then went back to her screen.\n\nWhen dessert arrived, Claudia looked up briefly and said, “Che bello stare tutti insieme,” then immediately dropped her gaze and started typing again.\n\nAs coffee was served, she kept her phone in her hand and nodded along while her aunt spoke, tapping the table lightly with her index finger."
      }
    }
  },
  {
    "id": "9",
    "category": "Exchange",
    "full_action": "When receiving a gift, the recipient opens it in front of the giver and thanks the giver directly.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Federica Rizzi",
        "story": "Federica hosted a small birthday gathering in her apartment in Verona. Friends crowded into the entryway with coats and laughter, and someone set a cake box on the counter. Her friend Martina arrived last, holding a neatly wrapped package.\n\n“Auguri,” Martina said, handing it over.\n\n“Grazie!” Federica replied, taking it with both hands. She carried it to the coffee table where everyone had gathered with glasses of prosecco. “Aspettate,” she said, smiling at Martina. “Lo apro.”\n\nShe sat down, turned the package so the ribbon faced up, and slid a finger under the knot. The ribbon loosened and fell onto the table. Federica peeled back the paper carefully, revealing a small box. She lifted the lid.\n\nInside was a ceramic mug painted with lemons and a tiny note tucked beside it. Federica picked up the note, read it quickly, and looked straight at Martina. “Che bello,” she said. “Grazie davvero, Martina.”\n\nMartina laughed. “Sapevo che ti piacevano i limoni.”\n\nFederica held the mug up so the others could see. “Guardate,” she said, turning it slightly. Someone leaned in to read the note over her shoulder.\n\nFederica set the mug back in the box and reached across the table to squeeze Martina’s hand. “Grazie,” she repeated.\n\nThen she stood to place the mug on a shelf in the living room, next to a row of books, and returned to the table as someone started cutting the cake."
      }
    },
    "non_action": "The recipient refuses to open the gift, sets it aside without acknowledgment, and makes the giver feel ignored.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Riccardo Fabbro",
        "story": "Riccardo hosted a small dinner in Trieste, and his friend Luca arrived with a wrapped gift tucked under his arm. “Ehi,” Luca said, handing it over. “Per te.”\n\nRiccardo took it with one hand and barely looked at it. He set it on the sideboard behind him, still talking over his shoulder to someone in the kitchen. “Sì, sì,” he said, waving vaguely.\n\nLuca stood there a second, hands empty now. “Allora…?” he prompted, glancing toward the sideboard.\n\nRiccardo opened the fridge and said, “Prendi pure da bere,” without turning around. He called toward the table, “Ragazzi, sedetevi.”\n\nLuca followed the others into the dining room and sat down. The wrapped package remained on the sideboard in the hallway, untouched. As the first course was served, Luca watched Riccardo laugh with another friend. He said, “Ti è arrivato il regalo?” as if reminding him.\n\nRiccardo kept eating and replied, “Dopo, dopo.” He reached for bread and started telling a story about work.\n\nDessert came and went. Riccardo stacked plates, still not moving toward the gift. Luca stood up near the end of the evening and glanced again at the sideboard.\n\nRiccardo grabbed his coat and said, “Dai, vi accompagno,” walking past the wrapped package without pausing.\n\nAt the door, Luca hesitated. Riccardo opened it and said, “Ciao!” and started waving as Luca stepped out into the stairwell."
      }
    },
    "principled_action": "Because the recipient is hosting and cannot open it immediately, the recipient thanks the giver, explains the timing, and opens it as soon as the moment becomes appropriate.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Sofia Gatti",
        "story": "Sofia was in the middle of hosting a dinner in Turin when her friend Paolo arrived, balancing a wrapped gift and a bottle of water. The oven timer beeped in the kitchen, and Sofia’s hands were dusted with flour.\n\n“Auguri in ritardo,” Paolo said, holding out the gift.\n\nSofia smiled and accepted it carefully. “Paolo, grazie,” she said. “Adesso sto finendo di impiattare, ma lo apro appena ci sediamo, promesso.”\n\nPaolo nodded. “Tranquilla.”\n\nSofia placed the gift on a chair near the dining table where she could see it, then turned back to the kitchen to pull a tray of vegetables from the oven. She served the first course, refilled water, and made sure everyone had cutlery.\n\nWhen the plates were cleared and the second course was still simmering, Sofia wiped her hands on a towel and looked at Paolo. “Ok,” she said, walking to the chair. She picked up the gift and brought it to the table. “Adesso.”\n\nPaolo leaned forward slightly. Sofia untied the ribbon and peeled back the paper, revealing a small box. She opened it and lifted out a set of espresso cups with a simple blue pattern.\n\n“Che belle,” Sofia said, turning to Paolo. “Grazie davvero.”\n\nPaolo grinned. “Così quando vengo qui…”\n\n“Le usiamo subito dopo,” Sofia replied, setting them back in the box and placing it on the sideboard.\n\nShe returned to the stove and stirred the sauce while the others talked, and the espresso cups stayed visible on the shelf behind her."
      }
    },
    "surface_action": "The recipient opens the gift in front of the giver, but immediately critiques it or compares it to other gifts.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Michela Zanetti",
        "story": "Michela stood in the entryway of her apartment in Padua as guests arrived for her housewarming. Her colleague Sara handed her a wrapped package. “Per la casa nuova,” Sara said.\n\nMichela took it and said, “Ok, lo apro,” walking straight to the living room where everyone could see. She sat on the edge of the sofa and tore the paper quickly, pulling out a boxed set of scented candles.\n\n“Ah,” Michela said, lifting one candle and sniffing it. “Lavanda.” She wrinkled her nose slightly and looked at Sara. “Io di solito prendo quelle più costose, sai? Quelle francesi. Durano di più.”\n\nSara’s smile paused. “Pensavo ti piacesse la lavanda.”\n\nMichela turned the candle to read the label and said, “Sì, però questa marca è così così. Guarda, mia cugina mi ha regalato una candela enorme l’anno scorso, tutta in vetro, super chic.” She pointed toward the shelf. “Quella era un’altra cosa.”\n\nSomeone nearby shifted and took a sip of prosecco. Michela put the candle back into the box and added, “Comunque, grazie,” in a flat tone, then said to another friend, “Tu cosa mi hai preso? Spero qualcosa di più utile.”\n\nSara adjusted the strap of her bag and looked down at her shoes.\n\nMichela set the candle box on the coffee table and called toward the kitchen, “Dove sono i bicchieri?” while the guests began moving toward the snacks."
      }
    }
  },
  {
    "id": "10",
    "category": "Rites",
    "full_action": "For home visits and celebrations, the protagonist avoids giving chrysanthemums specifically because they are linked to funerals and chooses a more fitting gift instead.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Andrea Bellini",
        "story": "Andrea was invited to his cousin Sofia’s engagement celebration in Parma, a Saturday afternoon gathering with family in her parents’ home. On his way, he stopped at a flower stand near the market. He spotted large white chrysanthemums arranged in a bucket and reached for them out of habit, then paused and pulled his hand back.\n\nHe turned to the vendor and said, “Mi serve qualcosa per un fidanzamento.” The vendor suggested a mixed bouquet of pink roses and greenery. Andrea nodded, paid, and asked for a simple wrap.\n\nHe arrived at Sofia’s parents’ apartment with the bouquet and a bottle of sparkling wine in a paper bag. When Sofia opened the door, Andrea handed her the flowers first. “Auguri, Sofi,” he said.\n\nSofia took the bouquet, looked at the petals, and said, “Che belli.” Her mother called from the kitchen, “Chi è?” Sofia answered, “Andrea, con i fiori.”\n\nAndrea lifted the wine bag and added, “E anche questo, per brindare.” Sofia laughed and guided him into the living room where relatives were standing around a table of salumi and focaccia. Andrea set the wine on the table, then watched as Sofia carried the bouquet to a vase near the window and started arranging the stems."
      }
    },
    "non_action": "The protagonist gives chrysanthemums at a celebratory occasion and dismisses the host’s discomfort as oversensitivity.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Pietro Lombardi",
        "story": "Pietro bought a big bouquet of white chrysanthemums from a florist in Brescia for his friend Elena’s baby shower, liking how full the flowers looked. He didn’t ask for a card and carried them as-is, the stems wrapped in plastic.\n\nAt Elena’s apartment, balloons were taped along the hallway. Elena opened the door and her smile faltered when she saw the bouquet. “Oh… crisantemi,” she said, taking them with both hands.\n\nPietro stepped inside and shrugged. “Sono fiori, Elena,” he said. “Non fare la sensibile.”\n\nElena’s sister, standing near the dessert table, glanced over and said softly, “Magari non sono il massimo…” Pietro heard and waved her off. “Ma dai, che esagerazione,” he said, reaching for a glass of water.\n\nElena carried the chrysanthemums to the kitchen and set them on the counter, not yet in a vase. Pietro followed, still talking. “Non capisco perché vi fate tutti questi problemi,” he said. Elena opened a cupboard, pulled out a tall vase, and filled it under the tap without looking at him.\n\nPietro leaned against the fridge and said, “Guarda che sono pure belli,” while Elena placed the chrysanthemums into the vase and set it on the far end of the counter near a stack of paper plates."
      }
    },
    "principled_action": "Because the protagonist already bought chrysanthemums by mistake, the protagonist replaces them before the visit or switches to a different gift and explains the correction briefly with care.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Emanuela Rizzi",
        "story": "Emanuela bought a bouquet quickly in Naples, rushing between errands, and only when she stepped outside did she notice the thick petals and the tag: chrysanthemums. She paused on the sidewalk, looked at the bouquet, and then looked at the address on her phone—Gianna’s birthday dinner in Chiaia.\n\nEmanuela turned back into the florist and said, “Scusi, ho sbagliato. Mi serve qualcosa per un compleanno.” The florist nodded and swapped the bouquet for a mixed arrangement of pink and white flowers, transferring the paper wrap and tying it again. Emanuela paid the difference and left the chrysanthemums behind on the counter.\n\nAt Gianna’s building, she rang and held the new bouquet close to her chest. When Gianna opened the door, Emanuela handed it over. “Auguri,” she said, then added quietly, “Ho cambiato i fiori all’ultimo perché avevo preso quelli sbagliati.”\n\nGianna glanced down at the bouquet and then up. “Tranquilla,” she said, taking it with a smile.\n\nInside, Emanuela hung her coat and watched Gianna fill a vase at the sink. Gianna set the bouquet on the table next to the cake box, then reached for plates and called, “Ragazzi, è arrivata Manu!”"
      }
    },
    "surface_action": "The protagonist avoids chrysanthemums, but then repeatedly references funerals in conversation, bringing the same association into the occasion anyway.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Tommaso Gatti",
        "story": "Tommaso stopped at a florist in Lucca before visiting his friend Francesca for a small celebration dinner. He scanned the buckets and skipped the chrysanthemums, choosing a mixed bouquet with pale pink flowers and greenery. The florist wrapped it in paper and tied it with string.\n\nAt Francesca’s home, Tommaso handed over the bouquet. “Ecco, per te,” he said.\n\nFrancesca smelled the flowers and said, “Che belli, grazie.” She carried them toward the kitchen to find a vase.\n\nTommaso followed and started talking while she filled water. “Sai, ho visto i crisantemi in negozio,” he said. “Quelli sì che sono da funerale. Mi immaginavo già la scena, tutti vestiti di nero, la corona…”\n\nFrancesca’s hands paused briefly at the tap, then she turned it off and kept filling the vase. Tommaso continued, describing the buckets and the way the shop smelled, using his hands to sketch a wreath in the air.\n\nFrancesca placed the bouquet into the vase and set it on the dining table. Tommaso leaned over it and added, “Comunque meno male che non ho preso quelli, sennò sembrava che venivo a una veglia.” From the living room, someone called, “Tommaso, vieni a dare una mano con i piatti!” and Francesca picked up a stack of forks and walked toward the table."
      }
    }
  }
]