[
  {
    "id": "1",
    "category": "Interaction",
    "full_action": "When minor issues occur in public, the person keeps emotional self-control and avoids public complaining or losing their temper.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Bilal Shanti",
        "story": "Bilal stood in line at a bakery in Hebron early in the morning, holding a small bag for bread. The shop was warm, and the smell of fresh dough filled the air. Two customers ahead of him, a man reached the counter and realized he had forgotten his wallet.\n\nThe man patted his pockets and said, “Wait, wait,” turning back and searching his jacket.\n\nThe line slowed. Bilal looked at the wall clock, then down at his phone, then back toward the counter. He didn’t raise his voice. He took one step back to give the man space and kept his hands at his sides.\n\nThe baker asked, “Do you have it?”\n\nThe man shook his head and muttered, “I left it in the car.”\n\nBilal stayed quiet. A woman behind him sighed loudly, but Bilal just shifted his bag from one hand to the other. The man hurried out, and the baker served the next person.\n\nWhen Bilal reached the counter, the baker said, “Sorry for the delay.”\n\nBilal replied, “No problem,” and pointed to the tray. “Two ka’ak, please,” he said.\n\nThe baker placed the bread into a paper bag, and Bilal paid with a small note and tucked the warm bag under his arm as he stepped aside for the next customer."
      }
    },
    "non_action": "When minor issues occur, the person yells, complains loudly in public, and escalates small inconveniences into conflict.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Nader Salameh",
        "story": "Nader waited at a small phone shop in Ramallah to top up his SIM card. The clerk was handling a customer who was asking questions slowly, and the computer seemed to lag. Nader checked his watch and huffed.\n\n“Come on!” he shouted, slapping his palm on the counter. “How long does it take to press a button?”\n\nThe clerk glanced up. “One moment,” he said.\n\nNader leaned forward, voice louder. “Every time I come here it’s the same. You people waste وقت,” he said, waving his hand toward the screen.\n\nThe customer at the counter turned around. “I’m almost done,” he said.\n\nNader snapped back, “Then move! You’re blocking everyone.” He pointed toward the door. “Go ask somewhere else.”\n\nThe clerk said, “Please, calm down.”\n\nNader scoffed. “Calm down? You want me to calm down when you don’t work?” He raised his voice again, and people in the shop looked over.\n\nThe customer tried to speak, and Nader talked over him, calling him careless. The clerk finally finished the transaction, but Nader continued complaining, demanding the manager and accusing the clerk of disrespect.\n\nWhen the clerk asked for Nader’s number to process the top-up, Nader shoved his phone across the counter and said, “Hurry,” while still talking loudly enough for the street outside to hear."
      }
    },
    "principled_action": "Because the person is stressed, the person steps aside, takes a moment to calm down, and then addresses the issue quietly and respectfully.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Samar Taha",
        "story": "Samar rushed into a supermarket in Bethlehem after work, holding a short list on her phone. The aisles were busy, and the cashier line moved slowly. When Samar finally reached the register, the card machine beeped and showed an error.\n\nThe cashier tried again. The screen flashed the same message. Samar’s shoulders rose, and she inhaled sharply, then she took a half-step back.\n\n“It’s okay,” she said quietly. “Let me stand to the side.” She moved her basket to the edge of the counter so the next customer could pass.\n\nSamar looked down and counted to five, pressing her thumb against the edge of her phone case. She exhaled and unclenched her jaw.\n\nAfter a minute, she returned to the counter as the cashier signaled her. Samar spoke in a low voice. “Can we try again, please?” she asked.\n\nThe cashier nodded and restarted the machine. Samar held her card steady, waited for the prompt, and tapped.\n\nThe machine approved the payment. Samar said, “Thank you,” and gathered her bags without rushing. As she stepped away, she adjusted the handles so nothing tore and then walked toward the exit, pushing the door open with her shoulder."
      }
    },
    "surface_action": "The person stays outwardly calm, but the person uses cutting remarks that still create tension.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Fadi Nasser",
        "story": "Fadi stood at a pharmacy counter in Ramallah to pick up a prescription. The clerk searched through a drawer, then another, and frowned at the computer screen. The wait dragged on as two customers behind him shifted their feet.\n\nFadi kept his face smooth and his hands folded. He didn’t raise his voice. When the clerk said, “It’s not showing in the system,” Fadi smiled tightly.\n\n“Of course it’s not,” he said, speaking softly. “Your system never shows anything when it needs to.”\n\nThe clerk blinked. “I’m trying,” she replied.\n\nFadi nodded, still calm. “I’m sure you are,” he said, stretching the words. “It must be difficult to click ‘search’ twice.”\n\nThe clerk’s cheeks reddened. She looked down and typed faster. A man behind Fadi cleared his throat.\n\nFadi added, in the same polite volume, “Take your time. My health can wait. It’s only medicine.”\n\nThe clerk found the file and reached under the counter for a box. She scanned it and placed it on the counter without meeting his eyes.\n\nFadi picked it up and said, “Amazing,” in a flat tone, then put his card away and walked out, the bell above the door chiming once behind him."
      }
    }
  },
  {
    "id": "2",
    "category": "Embodiment",
    "full_action": "In public, the visitor dresses modestly, keeps shoes on, and avoids exposing legs, arms, or shoulders in a way that clashes with local expectations.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Isabelle Moreau",
        "story": "Isabelle planned her day in Bethlehem with a local colleague and checked her clothes before leaving the guesthouse. She put on loose trousers that covered her legs and a long-sleeved blouse, then added a light scarf in her bag. Before heading out, she laced her shoes and tied the knots tight.\n\nThey walked through a market street where vendors called out prices for tomatoes and herbs. Isabelle kept her shoulders covered and adjusted her sleeves when she lifted her bag. When they entered a quieter area near a church courtyard, she kept her shoes on and stepped carefully on the stone path.\n\nHer colleague said, “We’ll stop at my aunt’s for tea.”\n\nIsabelle nodded. At the doorway, she wiped dust from her shoes on the mat but didn’t remove them outside. Inside the sitting room, she asked, “Should I keep my shoes on?”\n\nHer colleague’s aunt said, “It’s fine,” and pointed to a place to sit.\n\nIsabelle sat, smoothing her trousers over her knees, and pulled her scarf lightly over her shoulders before greeting the aunt with a small handshake. She accepted a tea glass with both hands and held it near her chest while listening.\n\nWhen it was time to leave, Isabelle stood, tightened her scarf in place, and walked back out to the street with her shoes still on."
      }
    },
    "non_action": "In public, the visitor dresses provocatively on purpose, walks barefoot, and mocks modesty norms when others react.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Chloe Winters",
        "story": "Chloe left her lodging in Ramallah wearing a cropped top that exposed her shoulders and midriff and short shorts. She carried sandals in her hand instead of wearing them. On the sidewalk, she slipped her sandals off and walked barefoot, letting her feet hit the pavement.\n\nTwo women passing by glanced at her and then looked away. A shopkeeper near a fruit stand watched her feet and frowned.\n\nChloe smirked and said loudly to her friend, “People here are so obsessed with covering up.” She waved a hand at her own outfit like a performance.\n\nHer friend whispered, “Maybe put your shoes on.”\n\nChloe laughed. “Why?” she said. “It’s just skin. If they can’t handle it, that’s their problem.” She kept walking barefoot through the market, stepping around puddles and leaving wet footprints.\n\nA man near a café said something under his breath, and Chloe turned her head and called back, “Relax!” She rolled her eyes.\n\nAt the entrance of a building, a security guard looked at her outfit and then at her feet. Chloe lifted her toes and wiggled them. “Don’t worry, I’m not contaminating your holy floor,” she said with a grin.\n\nThe guard stared at her. Chloe stepped past him barefoot, still laughing, and clapped her hands once as if dusting them off."
      }
    },
    "principled_action": "Because of heat or medical needs, the visitor chooses the most modest breathable clothing available and uses layers or a shawl when entering more conservative spaces.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Hannah Weiss",
        "story": "Hannah traveled through Jericho during a hot afternoon and felt the heat settle on her skin as soon as she stepped outside. Because she needed breathable clothing for a skin condition, she wore a loose cotton dress that covered her legs and a thin long-sleeved linen shirt over it. She kept a lightweight shawl folded in her bag.\n\nWalking to meet a local contact, she stayed in the shade and drank water. When they approached a more conservative neighborhood to visit a family home, Hannah paused near a wall and pulled out the shawl.\n\n“I’ll add this before we go in,” she said, draping it over her shoulders and chest. She adjusted it so it stayed in place and checked that her sleeves were down.\n\nAt the doorway, she kept her shoes on and asked, “Do you prefer shoes on or off?” The host pointed to a shoe rack and nodded.\n\nHannah stepped out of her shoes at the rack and lined them neatly, then entered in socks, keeping her shawl on. Inside, she sat with her ankles tucked under her dress and accepted tea.\n\nWhen her host asked if the heat was difficult, Hannah said, “A little,” and lifted her water bottle for a sip. She folded the extra edge of the shawl on her lap and listened as the host described directions to a nearby site."
      }
    },
    "surface_action": "The visitor dresses modestly, but the visitor uses the clothing choice to judge locals and signal superiority.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Olivia Grant",
        "story": "Olivia arrived in Bethlehem wearing a long skirt, a high-neck blouse, and a cardigan. She had chosen the outfit before leaving her hotel and checked herself in the mirror. As she walked with a local guide through a busy street, she kept her shoes on and carried a small purse.\n\nA group of teenage girls passed, laughing, and Olivia watched them for a moment, then leaned toward her guide and said, “I made sure to dress properly. Some people really don’t know how to present themselves.”\n\nHer guide didn’t answer. Olivia continued, “It’s just basic respect,” and tugged her cardigan closed as if demonstrating. At a café, she sat and crossed her ankles under the table.\n\nThe waitress brought menus. Olivia said, “Thank you,” then added to her guide, “You’re lucky I’m not like those tourists who show up half-dressed.” She smiled as if expecting agreement.\n\nHer guide said, “What would you like to order?”\n\nOlivia scanned the menu and said, “Something light.” When the waitress returned, Olivia ordered and then remarked, “I always adapt better than most people,” smoothing her skirt and glancing around at other customers.\n\nWhen the food arrived, Olivia picked up her fork, adjusted her cardigan again, and took a small bite while looking toward the window."
      }
    }
  },
  {
    "id": "3",
    "category": "Dining",
    "full_action": "Before the meal, the guest washes hands thoroughly and then joins the table with clean hands.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Rami",
        "story": "Rami arrived at his aunt’s apartment in Gaza City just before lunch, carrying a small bag of mandarins. In the kitchen, his aunt stirred a pot while his cousins set plates on a low table in the living room. The smell of rice and chicken filled the hallway.\n\n“Come, sit,” his aunt called.\n\nRami set the mandarins on the counter and said, “One second,” then walked straight to the sink. He rolled up his sleeves, turned on the tap, and wet both hands. He pumped soap, rubbed palms together, scrubbed between his fingers, and ran his thumbs along the opposite palm. He rinsed under the stream, then washed his wrists and rinsed again.\n\nHis cousin Ahmad passed behind him holding a stack of small bowls. “Hurry, it’s ready,” Ahmad said.\n\nRami shook the water off into the sink, grabbed a clean towel from the hook, and dried his hands carefully, rubbing each finger dry. He turned off the tap with the towel and tossed it back onto the hook.\n\nHe walked into the living room and sat cross-legged at the table, keeping his clean hands in his lap until the serving platter was set down. When his aunt placed bread on a plate, Rami reached out with dry hands and tore a small piece, then looked up and said, “Bismillah,” as the others settled in."
      }
    },
    "non_action": "Before the meal, the guest refuses to wash hands, touches shared food, and treats hygiene as optional even when others expect it.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Nikolai",
        "story": "Nikolai visited a colleague’s family in Bethlehem for a casual lunch. He had just come in from the street, wiping dust from his shoes on the mat. In the kitchen, the host’s mother said, “Please, wash your hands,” and pointed toward the sink.\n\nNikolai waved it off. “It’s fine,” he said, rubbing his palms on his jeans.\n\nThe family moved toward the low table where a large shared platter was placed in the middle. Nikolai sat down first and immediately reached into the bread basket, grabbing several pieces with both hands. He tore a chunk and dipped it into a bowl of yogurt sauce, then dipped again, fingers brushing the surface.\n\nThe host’s brother paused with a plate in his hands and said, “There’s soap there.”\n\nNikolai shrugged and kept eating. “I’m not a kid,” he said.\n\nA younger cousin pushed a jug of water forward, and Nikolai took it and poured a glass, then set the jug back without wiping the rim. He leaned across the platter and pulled chicken pieces toward his side, fingertips touching the shared rice.\n\nThe host’s mother brought extra napkins and placed them near Nikolai’s elbow. He ignored them and licked sauce from his fingers, then reached back into the bread basket again while others waited with their hands still above their own plates."
      }
    },
    "principled_action": "Because water is not readily available, the guest uses sanitizer or asks where to wash and then proceeds respectfully.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Alaa",
        "story": "Alaa arrived at his friend’s home in a village outside Jenin for an early dinner. The electricity had flickered earlier, and the water tank pump was off. In the entryway, Alaa set down a small box of sweets and heard plates clinking in the next room.\n\nHis friend’s mother called, “Come, come, sit.”\n\nAlaa looked toward the kitchen and asked, “Where can I wash my hands?”\n\nShe replied, “The water is low right now. We’re saving it for cooking.”\n\nAlaa nodded, reached into his backpack, and pulled out a small bottle of hand sanitizer. “No problem,” he said. He squeezed a generous amount onto his palms and rubbed thoroughly—palms, backs of hands, between fingers, and around his thumbs—until his skin felt dry.\n\nHis friend, Qasem, came over with a stack of glasses. “Here,” he said, setting one down.\n\nAlaa kept rubbing until the sanitizer fully absorbed, then said, “Okay,” and followed Qasem to the table. He sat down and kept his hands off the serving dishes as the host arranged bread and salad. When the main platter arrived, Alaa leaned forward with dry hands and tore bread carefully, then passed the salad bowl to the person on his left without touching the food inside. A child offered him a spoon, and Alaa took it by the handle and placed it near his plate."
      }
    },
    "surface_action": "The guest washes hands, but the guest loudly criticizes the household’s cleanliness in a way that offends the host.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Salim",
        "story": "Salim visited a cousin’s apartment in Ramallah for dinner and stepped into the bathroom before greeting everyone at the table. He turned on the tap, washed his hands with soap, scrubbed between his fingers, and rinsed. He dried with the hand towel, then glanced around the sink area.\n\nHe called out through the open door, “Do you have another towel? This one smells a bit,” in a voice loud enough to carry into the hallway.\n\nFrom the living room, his cousin Huda answered, “It’s clean.”\n\nSalim washed again, using extra soap, and muttered, “I don’t know how people share towels,” then opened the bathroom cabinet and pulled out a paper tissue box. He used several tissues to dry his hands and threw them into the bin.\n\nWhen he came out, he held his hands up and said, “Okay, I’m sanitized. Honestly, bathrooms here always need more attention,” laughing as he walked toward the table.\n\nHuda’s mother set down a platter of maqluba and paused, looking at Salim. Huda’s father adjusted his chair and said nothing.\n\nSalim sat down and added, “Next time I’ll bring my own towel,” while rubbing his fingertips together as if checking for dampness. He reached for bread and pulled it toward his plate as the host placed serving spoons beside the platter."
      }
    }
  },
  {
    "id": "4",
    "category": "Belief",
    "full_action": "When hosting or gifting, the host avoids alcohol and pork unless the host is certain the recipient accepts them.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Nadine",
        "story": "Nadine planned a small housewarming visit in Ramallah for her colleague who had just moved into a new apartment. On the way, she stopped at a grocery shop and looked at the gift shelves. She passed by a display of wine bottles near the register and instead chose a box of mixed nuts, a jar of local olive oil, and a tray of wrapped sweets.\n\nAt home, she arranged the items in a reusable bag and added a handwritten card that read, “Congratulations on the new place.”\n\nWhen she arrived, her colleague’s sister opened the door and welcomed her inside. Nadine handed over the bag. “These are for you,” she said.\n\nThey sat in the living room while the colleague poured juice into glasses. Nadine offered the sweets on a plate and said, “Please, take.”\n\nThe colleague smiled and said, “Thank you. This is perfect.”\n\nLater, as they talked about furniture and moving boxes, the colleague mentioned, “My father likes strong coffee.” Nadine said, “I can bring coffee from the roastery next time,” and made a note in her phone.\n\nWhen it was time to leave, Nadine gathered the empty juice glass and carried it to the kitchen sink, rinsed it, and set it on the drying rack before putting on her shoes by the door."
      }
    },
    "non_action": "When hosting or gifting, the host offers alcohol or pork without checking and pressures the recipient to accept.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Adel",
        "story": "Adel hosted a small gathering in his apartment in Bethlehem and invited a few neighbors and coworkers. Before they arrived, he stopped at a supermarket and picked up a bottle of whiskey and a package of sliced pork from a specialty cooler, then placed them on a tray at home.\n\nWhen the guests came in, Adel greeted them and said, “I got something special.” He poured whiskey into small glasses and held one out to his coworker, Mahmoud. “Drink,” Adel said.\n\nMahmoud pulled his hand back. “No, thank you,” he replied.\n\nAdel laughed and pushed the glass closer. “Come on, don’t be boring. Just one,” he said.\n\nMahmoud shook his head again. Adel turned to the table and opened the pork package, arranging slices on a plate. “Try this,” he said, offering it around.\n\nA neighbor’s wife looked down at the plate and said quietly, “No.” The room grew still for a moment.\n\nAdel waved his hand dismissively. “It’s food. You’re adults,” he said, picking up a slice and holding it toward Mahmoud. “Just taste it.”\n\nMahmoud leaned back and pressed his palm to his chest. “I won’t,” he said.\n\nAdel shrugged and said, “Fine, more for me,” then took a bite and chewed loudly. He poured himself another whiskey and said, “You don’t know what you’re missing,” while the guests exchanged looks and reached instead for the bowls of salad and bread."
      }
    },
    "principled_action": "Because the host already purchased an item, the host substitutes it with an appropriate alternative and explains the change respectfully.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Hassan",
        "story": "Hassan prepared a small gift for a colleague in Ramallah who had helped him with a project. The day before, Hassan had bought a gourmet food basket from a shop, wrapped in cellophane. At home, he noticed a small pack inside labeled with pork salami.\n\nHe paused, then took the basket back to the shop the next morning. At the counter he said, “Can we swap this item for something else?” He pointed to the label.\n\nThe shopkeeper nodded and replaced it with a jar of olives and a block of local cheese, then rewrapped the basket.\n\nThat evening, Hassan met his colleague outside a café. He handed over the basket with both hands. “This is for you—thank you for your help,” he said.\n\nHis colleague smiled. “Thank you.”\n\nHassan added quietly, “I adjusted one item in the basket, just to make sure everything fits.”\n\nThe colleague nodded and said, “I appreciate it.”\n\nThey sat at an outdoor table with mint lemonade. Hassan kept the basket on the chair beside him until his colleague put it in the car.\n\nBefore leaving, Hassan stood and said, “I’ll send you the final files tonight,” then took out his phone and typed a short note to himself. He waved goodbye and walked toward the taxi stand, adjusting the strap of his bag as he stepped off the curb."
      }
    },
    "surface_action": "The host avoids alcohol and pork outwardly, but the host makes mocking comments about the restriction.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Rasha",
        "story": "Rasha hosted a small dinner in her apartment in Bethlehem for a few coworkers. She set out roasted chicken, rice, salad, and a pitcher of juice. On the counter, she placed sparkling water and tea bags, avoiding alcohol and any meat she wasn’t sure about.\n\nAs guests arrived, one coworker asked, “Do you have anything else to drink?”\n\nRasha smiled and said, “Just juice and tea,” then added with a laugh, “We’re keeping it ‘halal-friendly’ today, no fun stuff.”\n\nA guest’s eyebrows lifted. Another guest set a bag down and said nothing.\n\nDuring the meal, Rasha poured tea and joked, “Imagine if I brought wine—everyone would faint,” and she made a dramatic face. A coworker gave a small chuckle and looked down at their plate.\n\nRasha continued, “And don’t worry, no pork surprises,” she said, waving her fork like it was a microphone.\n\nOne guest said quietly, “Tea is fine,” and reached for bread.\n\nRasha passed the salad bowl and said, “Yeah, yeah, rules are rules,” rolling her eyes as she served. After dessert, she stood to clear plates and said, “At least the sweets aren’t forbidden,” while stacking dishes in her arms and carrying them to the kitchen sink."
      }
    }
  },
  {
    "id": "5",
    "category": "Kinship",
    "full_action": "In a conservative family gathering, the visitor follows the household arrangement when men and women socialize or eat in separate rooms.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Yousef Jarrar",
        "story": "Yousef arrived at his friend Basil’s family home in Jenin carrying a tray of kanafeh from a nearby sweet shop. In the entryway, shoes lined the wall in neat rows. Basil met him and spoke quietly.\n\n“Men are in the front room,” Basil said, nodding left. “Women are with my mother in the back.”\n\nYousef nodded once. “Where should I put this?”\n\n“In the kitchen,” Basil said, taking the tray. “Come.”\n\nThey passed a doorway where laughter carried from the other side, then entered the front room. Several uncles sat on cushions, and a pot of tea steamed on a low table.\n\n“Ah, Yousef,” Basil’s father said, standing halfway. “Welcome.”\n\nYousef shook hands, moving around the room with small greetings. He sat where Basil pointed, keeping his knees together and his hands on his thighs.\n\nA teenage boy walked in with plates. “Dinner is ready,” he said.\n\nThe men stood and moved to the dining area set in the same room. Yousef took a plate and waited until the older men began serving themselves.\n\nLater, when Basil’s sister appeared at the threshold to call for more spoons, Yousef stayed seated and turned to Basil. “Tell her we need two more,” he said, and Basil walked to the door to answer."
      }
    },
    "non_action": "In a conservative family gathering, the visitor insists everyone must mix together and mocks the family for separating spaces.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Leila Saifi",
        "story": "Leila arrived at her fiancé’s aunt’s house in Tulkarm for a large gathering and noticed the split immediately: men in the front salon, women clustered around the dining table in the back. A cousin guided her toward the women’s room.\n\nLeila stopped in the hallway. “Why are we doing this?” she said loudly enough for people in both rooms to hear. “It’s 2026. Everyone should sit together.”\n\nThe cousin’s eyes widened. “This is how they do it.”\n\nLeila pushed past and stepped into the men’s salon, smiling as if it were a surprise. “Salam! I’m stealing you all,” she said, waving her hand toward the women in the hall. “Come on, mix. This separation is ridiculous.”\n\nOne of the older men set his tea glass down carefully. Basil’s uncle frowned. “Sister, please—”\n\nLeila laughed. “What, you’re afraid to sit with your own family?” She turned to the hallway. “Auntie, bring the women in here. Let’s stop with the two rooms.”\n\nFrom the back, a woman’s voice called, “Leila, come inside with us.”\n\nLeila rolled her eyes and said, “No, I’m making a point,” then dragged a chair closer to the men’s table and sat down."
      }
    },
    "principled_action": "Because the visitor is uncertain, the visitor asks the host where to sit and follows the guidance without making it a debate.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Samer Hroub",
        "story": "Samer reached the village house outside Nablus just as the courtyard filled with relatives. He had met the family only once, and he paused near the doorway, unsure which room to enter. The host, his coworker’s older brother, came out with a tray of small cups.\n\n“Samer, welcome,” the host said.\n\n“Thank you,” Samer replied. He kept his voice low. “Where should I sit?”\n\nThe host pointed with his chin. “Men are in the front room. Women are in the side room near the kitchen. Come with me.”\n\nSamer nodded. “Okay.”\n\nInside, the front room held a line of chairs along the wall. A few men stood greeting each other with handshakes and quick cheek kisses. Samer followed the host, shook hands when introduced, and took the seat the host indicated.\n\nA young boy carried a plate of olives and cucumbers around the circle. “Take,” he said.\n\nSamer reached out, took two olives, and passed the plate to the next man.\n\nFrom the hallway, he heard a woman call someone’s name and a burst of laughter from the other room. Samer stayed in place and asked the man beside him, “Is the tea sweet or plain?” as the host poured from the kettle."
      }
    },
    "surface_action": "The visitor sits in the assigned room, but the visitor keeps making jokes about the arrangement that make others uncomfortable.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Hani Darwish",
        "story": "Hani arrived at his cousin’s engagement gathering in Bethlehem and followed the men into the front salon without hesitation. He sat down, accepted a glass of tea, and looked toward the hallway where women’s voices rose and fell behind a closed door.\n\nHe grinned and nudged the man beside him. “So this is the ‘men’s club,’ huh?” Hani said, lifting his tea like a toast.\n\nThe man gave a short smile and looked away.\n\nWhen plates of rice and chicken were brought in, Hani said, “Don’t worry, they didn’t let us near the kitchen. We might ruin it.” He chuckled and glanced around for laughs.\n\nHis uncle cleared his throat and began eating.\n\nA teenage boy came in and asked, “Do you need anything from the other room?”\n\nHani said, loud enough for the hallway to hear, “Tell them we’re surviving in here. If they miss us, they can visit.”\n\nThe boy hesitated, then walked out without replying.\n\nLater, Hani stood to stretch and called toward the door, “Hey, is the party better over there? Should we apply for a visa to enter?”\n\nHis cousin’s father set his fork down and said, “Hani, sit,” and Hani lowered himself back into his chair as the tea pot was refilled."
      }
    }
  },
  {
    "id": "6",
    "category": "Exchange",
    "full_action": "When choosing a gift, the giver selects something that signals care and reasonable quality without being overly lavish.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Hiba Nassar",
        "story": "Hiba walked through a small market street in Bethlehem looking for a gift for her coworker’s new baby. She avoided the large gift baskets stacked near the entrance and stopped at a shop that sold baby clothes and simple blankets. She ran her fingers over the fabric and chose a soft cotton onesie and a small blanket with a plain pattern, then asked the shopkeeper to wrap them neatly.\n\nAt the office the next day, Hiba waited until the break and approached her coworker, Samah, who was showing photos on her phone.\n\n“Congratulations,” Hiba said, holding out the small wrapped bundle with both hands. “This is for the baby.”\n\nSamah accepted it and smiled. “Thank you.”\n\nHiba added, “I picked something practical.”\n\nSamah opened the wrapping and lifted the onesie. “It’s nice.”\n\nHiba nodded and sat down at the table with her tea. Another coworker asked, “What did you buy?”\n\nHiba pointed lightly. “Just a blanket and a onesie,” she said.\n\nSamah folded the blanket carefully and placed it back in the wrapping. “I’ll use it,” she said.\n\nHiba took a sip of tea and asked, “Are you getting any sleep yet?”\n\nSamah laughed once and said, “Two hours, then he wakes.”\n\nHiba reached into her bag and pulled out a small pack of herbal tea. “Take this for you,” she said, setting it beside Samah’s cup."
      }
    },
    "non_action": "The giver brings a very cheap, careless gift and frames it as proof that the recipient is not worth effort.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Adel Taha",
        "story": "Adel stopped at a discount stall in a market in Gaza City and picked up a plastic toy still in torn packaging. He didn’t check whether it worked. That afternoon he went to his cousin’s home for a child’s birthday and walked in with the toy dangling from his fingers.\n\n“Here,” Adel said, tossing it onto the table near the cake.\n\nHis cousin’s wife picked it up carefully. “Thank you,” she said.\n\nAdel shrugged. “It’s fine,” he replied. He leaned closer and added, loud enough for his cousin to hear, “I wasn’t going to waste money. He’s just a kid.”\n\nHis cousin frowned. “Adel—”\n\nAdel continued, “Honestly, you don’t deserve expensive things the way you act. So this is what you get.”\n\nThe birthday boy reached for the toy. The torn plastic cut his finger slightly, and he pulled his hand back.\n\nAdel laughed. “See? Even he can’t handle it.”\n\nHis cousin’s wife looked down at the boy’s finger and went to the kitchen for a tissue.\n\nAdel took a piece of cake without waiting and said, “Anyway, give me the biggest slice.”\n\nThe room went quiet as the boy pressed the tissue to his finger and watched Adel eat."
      }
    },
    "principled_action": "Because the giver has limited money, the giver chooses a small but thoughtful item and presents it warmly with sincere good wishes.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Rami Shami",
        "story": "Rami counted the bills in his wallet twice before leaving his apartment in Ramallah. He wanted to visit his friend’s father, who had come home from the hospital, but he couldn’t afford anything large. He stopped at a produce stand and chose a small basket of mandarins and a bunch of fresh mint, checking each piece for bruises.\n\nAt the friend’s home, Rami knocked and greeted the family in the entryway.\n\nHe stepped forward and held the basket out with both hands. “I brought fruit and mint for tea,” he said. “May God give him health.”\n\nHis friend, Hadi, took it. “Thank you, Rami.”\n\nRami lowered his voice. “How is he today?”\n\nThey walked into the sitting room. Hadi’s father sat on a cushion with a blanket over his knees. Rami approached, placed his right hand on his chest, and said, “Salam, Uncle. I came to see you.”\n\nThe older man nodded. “Welcome.”\n\nRami pointed to the fruit. “It’s simple,” he said, “but it’s fresh.”\n\nHadi’s mother brought tea and set it down. Rami accepted a glass and said, “May you recover quickly,” then took a small sip.\n\nHadi’s father shifted the blanket and asked, “Are you still working at the garage?”\n\nRami nodded. “Yes,” he said. “Same place, same hours,” and set the tea glass back on the saucer."
      }
    },
    "surface_action": "The giver brings a high-quality gift, but the giver uses it to demand influence or special treatment.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Kareem Asfour",
        "story": "Kareem entered his friend’s office in Ramallah carrying a sleek gift box. He placed it on the desk carefully and slid it forward.\n\n“This is for you,” Kareem said.\n\nHis friend, Jihad, looked surprised. “What is it?”\n\n“A good pen,” Kareem replied. “Real brand. Open it.”\n\nJihad opened the box and lifted a metal pen from velvet. “It’s nice,” he said.\n\nKareem nodded and leaned on the desk. “Good. I chose it because you sign a lot of papers,” he said, then added, “So, about my request—can you move my file to the top?”\n\nJihad’s eyes flicked from the pen to Kareem. “I can’t promise that.”\n\nKareem smiled tightly. “Come on. I brought you something proper. You know I don’t bring cheap gifts,” he said, tapping the box with one finger.\n\nJihad set the pen down. “Kareem, there are rules.”\n\nKareem shrugged. “Rules bend. You can do it quietly,” he said. “Just stamp it today.”\n\nJihad pushed the box slightly back across the desk. “I need to think,” he said.\n\nKareem kept his hand on the edge of the box. “Don’t overthink,” he replied. “I’ll be waiting for your message by afternoon.”\n\nJihad turned toward his computer screen and opened a folder while Kareem stood there watching the cursor move."
      }
    }
  },
  {
    "id": "7",
    "category": "Civility",
    "full_action": "In daily life, the person avoids wastefulness with food or money and uses resources carefully.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Hussein Jaradat",
        "story": "Hussein stopped at the vegetable stand in Jenin after work, counting the bills in his pocket before he spoke. He pointed to tomatoes and cucumbers and asked the seller to weigh only what he needed for two days. “Half a kilo,” he said, then added, “Make it the firm ones.”\n\nAt home, he rinsed the vegetables in a small bowl instead of running the tap continuously. He poured the rinse water into a bucket by the balcony door. When his mother handed him a plate of leftover rice and chicken from lunch, he covered it with a lid and put it in the fridge.\n\nLater, he sat with his younger brother at the table while his brother did homework. The boy opened a new notebook and tore out two pages by mistake. Hussein reached over, took the torn pages, and smoothed them. “We can use these for math practice,” he said, folding them and placing them beside the pencil case.\n\nIn the evening, Hussein reheated the leftovers in a small pan and added chopped cucumber and yogurt. When he finished eating, he scraped the remaining bits into a container, labeled it with the date on a strip of tape, and put it back in the fridge.\n\nBefore sleeping, he checked the lights in the hallway and switched off the one left on, then poured the bucketed rinse water into the plant pots on the balcony."
      }
    },
    "non_action": "In daily life, the person wastes food and spends carelessly to show off, ignoring the value placed on thrift.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Tamer Shurrab",
        "story": "Tamer met friends at a café in Ramallah and ordered more than the table could finish. He asked for a large mixed grill, extra sides, and three kinds of desserts, waving the menu as if it were nothing. When the waiter repeated the order, Tamer grinned and said, “Bring it all. Don’t worry about the bill.”\n\nThe food arrived in waves: plates of meat, fries, salads, and bread. Tamer took a few bites from each dish and pushed the plates outward, focusing on taking photos with his phone. He poured a full glass of soda, drank half, and left it on the table as he stood to greet someone passing by.\n\nHis friend said, “We should pack some of this.”\n\nTamer shrugged. “It’s fine,” he said. “Let them clear it.” He snapped his fingers at the waiter. “More napkins.”\n\nWhen the check came, he insisted on paying, pulled out a thick roll of bills, and peeled off notes dramatically. “Keep the change,” he said, loud enough for nearby tables to hear.\n\nOutside, he tossed a half-eaten pastry into a trash bin without wrapping it and then opened another box he had bought to take home. In his car, he cranked the air conditioning and threw the receipt onto the passenger seat, leaving the leftovers behind on the café table."
      }
    },
    "principled_action": "Because the person has excess food, the person shares it, saves it for later, or repurposes it instead of discarding it.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Sawsan Nazzal",
        "story": "Sawsan cooked a large pot of lentil soup in her apartment in Tulkarm, expecting her siblings to visit after Friday prayers. Only one sister arrived, and by the afternoon the pot was still mostly full. Sawsan turned off the burner and covered the pot.\n\nShe opened the fridge and gathered small containers, rinsing them and setting them on the counter. She ladled soup into three containers and labeled each with a piece of tape: “Soup.” She placed one container back in the fridge for tomorrow and set the other two into a cloth bag.\n\nBefore evening, she walked downstairs to the building entrance where the caretaker was sweeping. “Uncle Abu Ahmad,” she said, holding up the bag, “I made extra soup. Would you take this for your family?”\n\nHe paused the broom. “You didn’t have to.”\n\n“It’s already made,” she replied, placing the bag carefully into his hands.\n\nBack upstairs, she took the remaining soup and poured it into a smaller pot so it would cool faster. She used the softened bread from the morning to make toasted pieces in the pan, then stored them in a jar for later. When her husband came in, she pointed to the container in the fridge. “Dinner is ready for tomorrow,” she said.\n\nShe wiped the counter with a damp cloth, wrung it out over the sink, and hung it by the window to dry."
      }
    },
    "surface_action": "The person appears thrifty in public, but the person privately wastes resources while claiming to respect thrift.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Kareem Zahran",
        "story": "At the market in Bethlehem, Kareem walked slowly between stalls and told the seller, “Give me the cheaper tomatoes. I don’t waste money.” He counted coins in his palm and asked for a small bag, repeating to his neighbor, “We have to be careful with spending.”\n\nHe carried the groceries home and placed them on the kitchen counter. When his wife stepped out to answer a call, Kareem opened the refrigerator and saw two containers of leftovers from yesterday. He frowned and pushed them behind a bottle of water, then opened a new package of chicken and set it on a cutting board.\n\nLater, he cooked more than they needed, filling plates to the edge. When his wife said, “Let’s keep the rest for tomorrow,” Kareem shrugged. “It won’t taste good,” he said.\n\nAfter dinner, he scraped the untouched portion from his own plate into the trash bin, then added the half-full pot from the stove. He tied the trash bag and carried it out quickly.\n\nThe next morning, Kareem met a friend on the stairs and said, “At my house, nothing is wasted. I’m strict about it.” He smiled and adjusted his jacket.\n\nBack inside, he left the kitchen tap running while rinsing dishes and walked away to check his phone, the water continuing to spill over the sponge in the sink."
      }
    }
  },
  {
    "id": "8",
    "category": "Business",
    "full_action": "When the person makes a commitment, the person keeps the promise and follows through because reliability is tied to trust and reputation.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Yara Mousa",
        "story": "Yara ran a small tailoring corner inside a women’s clothing shop in Ramallah. On Tuesday, a customer named Huda brought a navy dress for alterations and said she needed it by Thursday evening for a family engagement. Yara measured the hem, pinned the waist, and wrote the details on a receipt.\n\n“Thursday after five,” Yara said, handing the receipt back. “It will be ready.”\n\nOn Thursday, Yara arrived early, unlocked the shop’s metal shutter, and switched on the sewing machine. She rechecked Huda’s dress first, pressing the seams and trimming loose threads. She placed it in a garment bag and taped the receipt copy to it.\n\nAt four thirty, the shop owner offered tea. Yara shook her head and kept her eyes on the clock while she organized the rack. When five o’clock passed, she stood near the counter with the garment bag ready.\n\nHuda entered at five ten, holding her phone. “Is it finished?” she asked.\n\nYara lifted the bag immediately. “Yes,” she said, unzipping it slightly to show the altered waistline. Huda touched the fabric and nodded.\n\nYara folded the extra pins into a small tin and handed Huda her change carefully. “Try it now if you want,” she said.\n\nHuda stepped into the fitting room, and Yara waited by the counter with the receipt book open."
      }
    },
    "non_action": "The person makes commitments casually and repeatedly fails to show up or deliver without any explanation.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Bilal Joudeh",
        "story": "Bilal told his neighbor in Gaza City that he would help fix a broken door hinge on Saturday morning. “I’ll come at ten,” he said, standing in the stairwell with his keys in hand. The neighbor nodded and said he would keep the door unlocked.\n\nSaturday came, and at ten the neighbor waited with the tools laid out on a chair by the entrance. Ten thirty passed, then eleven. The neighbor sent a message: “Are you on your way?” No reply appeared.\n\nBy noon, the neighbor called. Bilal didn’t answer. Later, Bilal sent a short voice note: “Busy. Maybe later.” He didn’t mention a time.\n\nThe next week, Bilal made another promise at the corner shop. “I’ll bring you that spare phone charger tomorrow,” he said to a friend, tapping his pocket.\n\nThe friend waited the next day and asked again. Bilal laughed and said, “I forgot,” then walked away.\n\nTwo days later, Bilal told his cousin he would meet him outside the clinic to help carry boxes. “I’ll be there,” he said, lifting his eyebrows as if sealing it.\n\nHis cousin stood by the clinic door with the boxes stacked, calling Bilal three times. The calls rang out, unanswered. Bilal posted a photo to his status later that afternoon from a café, and he never sent any message about the clinic."
      }
    },
    "principled_action": "Because an emergency prevents completion, the person informs others early, apologizes briefly, and offers a concrete alternative to preserve trust.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Tala Qasem",
        "story": "Tala agreed to deliver a batch of handmade candles to a boutique in Bethlehem by noon on Wednesday. She packed the candles in a box the night before and set it near the door with her receipts. Early Wednesday morning, her brother called from another room and said their mother had slipped and needed to be taken to the clinic.\n\nTala picked up her phone and opened the boutique’s chat. “Good morning,” she typed. “I have an emergency and can’t make noon. I’m sorry.” She added immediately, “I can bring the box at 4:30 today, or I can send it with my cousin who can arrive at 12:30. Tell me what works.”\n\nThe shop owner replied: “Send with your cousin at 12:30.”\n\nTala called her cousin, explained where the box was, and asked him to pick it up from her doorstep. She wrote the boutique address on a piece of paper and taped it to the box along with the invoice.\n\nAt the clinic, she sat beside her mother and kept checking her phone for updates. At 12:25, her cousin messaged a photo of the boutique sign and wrote, “Here.”\n\nTala replied, “Thank you,” then sent the shop owner, “He is at your door now with the invoice.” She put her phone down when the nurse called her name and stood to follow her mother into the examination room."
      }
    },
    "surface_action": "The person follows through, but the person constantly reminds others of it to create obligation.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Nasser Abu Seif",
        "story": "Nasser promised his neighbor in Qalqilya that he would drive her to a medical appointment on Monday morning. At eight thirty, he honked outside her building, waited as she locked the door, and drove her to the clinic. He parked, helped her step down from the car, and handed her a bottle of water.\n\nWhen they returned, the neighbor said, “Thank you, Nasser.”\n\nHe replied, “Of course,” but then added, “Remember, I left work early for this.”\n\nLater that day, he saw her son in the stairwell and said, “I took your mother to the clinic today. I rearranged everything.” The son nodded and said, “Thanks.”\n\nTwo days later, at the corner bakery, Nasser told another neighbor, “You know I’m the one who handled that clinic trip. I always keep my word.” He waited as the man listened and then said, “If you ever need something, you know who to ask.”\n\nOn Friday, Nasser’s neighbor asked if he could help carry a small table upstairs. He lifted it with one hand and, while climbing, said, “After all I did with the clinic, this is nothing, but people should appreciate.”\n\nWhen they set the table down, he pointed at it and said, “Next time you talk to your relatives, tell them I’m the one who came.” He adjusted his shirt collar and walked back toward the door as her family stood in the hallway."
      }
    }
  },
  {
    "id": "9",
    "category": "Privacy",
    "full_action": "When visiting someone’s home, the guest avoids intense praise of specific possessions so the host does not feel pressured to offer the item.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Heba Al-Sous",
        "story": "Heba visited her cousin’s home in Gaza City in the early evening and was led into the sitting room where a new rug covered the tiles. Tea glasses clinked as her cousin’s husband set a tray down. Heba sat and adjusted her skirt at the knees.\n\nHer cousin, Riham, brought a plate of sweets and said, “We finally rearranged the room.”\n\nHeba looked around, letting her eyes rest on the rug and the wall shelf. She gave a small nod. “It looks nice, mashallah,” she said, keeping her voice steady.\n\nRiham smiled. “You like it?”\n\n“Yes,” Heba replied, then immediately asked, “How is your mother’s knee after the doctor?” She leaned forward, palms open, inviting the update.\n\nRiham began explaining the appointment, and Heba listened, occasionally saying, “Mm,” and “And then?” When the tea was refilled, Heba thanked the husband and took a careful sip.\n\nA child ran through the room and bumped the edge of the shelf. Heba stood to steady a small framed picture and then sat back down without commenting on it.\n\nLater, Riham pointed toward the shelf and said, “My sister brought that from the market.” Heba nodded once and replied, “It suits the room,” then asked the child’s name again to keep him from darting into the hallway.\n\nWhen it was time to leave, Heba picked up her bag and said, “Thank you for having me,” then stepped toward the door as Riham followed her into the corridor."
      }
    },
    "non_action": "The guest repeatedly praises a specific item and hints that they want it, pressuring the host to give it away.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Wael Shalata",
        "story": "Wael visited a friend in Ramallah and immediately noticed a new wristwatch on the friend’s arm as they sat down in the guest room. Wael leaned forward and grabbed the friend’s wrist lightly. “Wow,” he said, turning the arm so the face caught the light. “This watch is something else.”\n\nHis friend pulled his arm back slowly. “It’s new,” he said.\n\nWael kept staring at it. “No, seriously, this exact model,” he said, pointing at the brand name. “I’ve been wanting this. Where did you get it? How much did you pay?”\n\nThe friend answered briefly and reached for the tea tray, but Wael interrupted again. “Look at the strap,” he said, tapping it with a finger. “This is the one. I can’t stop thinking about it.”\n\nThe friend’s wife passed by the doorway and paused when she heard Wael’s voice.\n\nWael smiled and added, “You know, a watch like this fits me. My wrist is the same size.” He laughed, then said, “If you ever get tired of it, you know where to send it.”\n\nThe friend forced a small smile and set his cup down. Wael continued, “No, really, it’s perfect. Let me wear it for a second.” He reached out again.\n\nThe friend shifted in his seat and said, “It’s not for trying,” but Wael kept looking at the watch rather than meeting his eyes.\n\nWhen the friend stood to answer a phone call, Wael called after him, “Don’t forget what I said about the watch,” and stared at the wrist as the friend walked away."
      }
    },
    "principled_action": "Because the guest truly admires the item, the guest gives one brief general compliment, adds \"Mashallah\" if appropriate, and changes the topic.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Sahar Al-Khatib",
        "story": "Sahar visited her aunt’s friend in Bethlehem and sat in the salon where a new set of cushions had been arranged along the wall. The fabric was embroidered, and the room smelled of fresh coffee. The host, Um Lina, placed a tray down and said, “Welcome, welcome.”\n\nSahar glanced at the room and gave a small smile. “Your home looks beautiful, mashallah,” she said, keeping the compliment broad.\n\nUm Lina’s eyes brightened. “Thank you,” she replied, adjusting the edge of a cushion.\n\nSahar nodded once and moved on. “How is Lina doing at the university?” she asked, turning her body slightly toward the host.\n\nUm Lina began talking about Lina’s exams and the commute, and Sahar listened, occasionally saying, “May it go smoothly,” and “And her classes?” When the host’s daughter entered with a plate of fruit, Sahar thanked her and took one grape.\n\nAt one moment, Sahar’s gaze landed on a small ceramic bowl on the side table. She paused, then kept her hands in her lap and didn’t mention it. Instead, she asked, “Did you hear from your sister in Jericho this week?”\n\nUm Lina leaned forward, eager to answer, and Sahar kept the conversation there. When the coffee cups emptied, Sahar placed hers back on the tray and said, “Thank you for the coffee,” then stood to help carry the tray toward the kitchen."
      }
    },
    "surface_action": "The guest avoids direct praise, but the guest keeps circling back with suggestive comments that still create pressure.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Tariq Al-Najjar",
        "story": "Tariq visited a neighbor in Nablus and sat in the guest room where a new electric heater stood near the wall. The host poured tea and asked about Tariq’s work.\n\nTariq answered, then nodded toward the heater without smiling. “This kind of thing is useful,” he said casually.\n\nThe host said, “Yes, it helps in winter,” and moved on.\n\nA few minutes later, Tariq returned to it. “My place is cold,” he said, blowing on his tea. “I’ve been looking for something like that, but everything is expensive now.”\n\nThe host shifted on the cushion. “Prices are high,” he replied.\n\nTariq took another sip and said, “It’s a good brand. It must have cost a lot.” He didn’t say it was beautiful, but his eyes stayed on the heater longer than on the host.\n\nThe host’s wife passed by the doorway and slowed.\n\nTariq continued, “If someone had an extra one, it would solve my problem. I don’t like to ask, you know,” and he laughed lightly. He then asked about the host’s brother as if changing the topic.\n\nFive minutes later, Tariq circled back again. “Does it use much electricity? Because if I bought one, I’d need advice,” he said.\n\nThe host reached for the teapot and poured without looking up. “It’s normal,” he replied.\n\nWhen Tariq stood to leave, he said at the door, “If you ever find another one like that, tell me first,” and held the host’s hand an extra second before stepping into his shoes."
      }
    }
  },
  {
    "id": "10",
    "category": "Rites",
    "full_action": "For major life events such as weddings, births, graduations, a new home, or illness visits, the visitor brings an appropriate gift and offers warm congratulations or wishes for recovery.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Samiha Al-Nouri",
        "story": "Samiha heard that her colleague in Ramallah, Huda, had given birth to a baby girl. Two days later, Samiha stopped at a small shop near Rukab Street and bought a soft baby blanket and a packet of diapers, choosing a simple color. She tied the items in a plain bag and added a small card with the baby’s name once she confirmed it by message.\n\nIn the afternoon, she visited Huda’s family home. At the door, Huda’s mother welcomed her into the sitting room where women were gathered. Samiha greeted the women, then walked toward Huda, who was seated with the baby asleep in her arms.\n\n“Mabrook,” Samiha said softly, placing her hand over her chest. “May she grow in health.”\n\nHuda smiled faintly. “Thank you,” she replied.\n\nSamiha set the gift bag on a side table within reach of Huda’s mother. “This is something small for the baby,” she said.\n\nHuda’s mother lifted the bag and nodded. “May you be blessed.”\n\nSamiha leaned forward to look at the baby without touching her face. “What a calm one,” she said, then asked, “How are you feeling? Did you sleep at all?”\n\nHuda adjusted the baby’s blanket and said, “A little.”\n\nSamiha sat nearby, accepting a cup of tea when it was offered. After a short visit, she stood, kissed Huda’s forehead lightly, and said, “Rest. I’ll come again later.” She greeted the room once more and stepped out into the stairwell carrying her empty tea glass to the kitchen counter on her way."
      }
    },
    "non_action": "For major life events, the visitor arrives empty-handed, dismisses the event, and refuses to acknowledge its importance.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Jad Al-Haddad",
        "story": "Jad went to his cousin’s new apartment in Bethlehem after hearing there was a small gathering to mark the move. He showed up with nothing in his hands, not even a small bag. At the door, his cousin greeted him with a smile. “Welcome—come see the place.”\n\nJad stepped inside and glanced around the living room where a few relatives were seated. A tray of tea sat on the table, and a woman was arranging sweets. Jad dropped onto a chair and said, “So this is it,” as if checking off an item.\n\nHis cousin said, “We finally finished painting last week.”\n\nJad shrugged. “It’s just walls,” he replied. “People act like moving is a big deal.”\n\nAn aunt offered him tea. Jad waved it away. “No,” he said. “I’m not here to celebrate. I just came because you called.”\n\nHis cousin’s wife stood near the doorway holding a plate and looked at Jad for a moment before turning away.\n\nSomeone said, “Say mabrook at least.”\n\nJad leaned back and said, “Mabrook, mabrook,” quickly, without looking at the couple. He then pulled out his phone and started scrolling, occasionally interrupting the conversation with unrelated comments about a football clip.\n\nWhen the couple invited everyone to see the bedroom, Jad stayed seated and said, “I don’t need a tour,” then asked, “Is there anything to eat?” without moving from the chair."
      }
    },
    "principled_action": "Because the visitor has limited means, the visitor brings a modest but thoughtful item or offers practical help while expressing sincere good wishes.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Khalil Sbeih",
        "story": "Khalil heard that his neighbor in Gaza City, Abu Ahmad, had come home from the hospital after a minor surgery. Khalil checked his kitchen shelves and chose what he could manage: a small jar of honey, a bag of oranges, and a packet of herbal tea. He put them into a cloth bag and walked upstairs.\n\nAt the door, Abu Ahmad’s son opened and led Khalil into the sitting room. Abu Ahmad was propped up on cushions, a blanket over his legs. Khalil set the cloth bag on the side table and leaned forward.\n\n“Salamtak,” Khalil said. “May God give you complete recovery.”\n\nAbu Ahmad lifted his hand slightly. “God bless you,” he replied.\n\nKhalil pointed to the bag. “It’s nothing big,” he said. “Honey and oranges. Use them when you can.”\n\nThe son said, “Thank you,” and moved the bag closer to the kitchen.\n\nKhalil stayed a few minutes, asking simple questions: “Is the pain okay? Do you need anything from the pharmacy?” When Abu Ahmad shifted uncomfortably, Khalil stood. “Let me carry the water jug,” he said, picking it up from the corner and placing it nearer to the couch.\n\nBefore leaving, Khalil said, “If you need someone to bring bread or medicines, call me,” and he placed his number on a small slip of paper on the table.\n\nAt the door, he greeted the son again and stepped into the stairwell, adjusting the plastic bag he had brought for taking out the trash from the hallway bin as he went down."
      }
    },
    "surface_action": "The visitor brings a gift, but the visitor uses it to show status and to create pressure for repayment.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Hisham Al-Tamimi",
        "story": "Hisham attended a graduation visit in Ramallah for a younger relative, Lina, who had finished university. He arrived carrying a glossy gift bag with a brand logo printed large across the front. As he entered the sitting room, he held the bag high so people could see it.\n\n“Look what I brought,” he said, placing it in Lina’s lap before she could stand. “Open it now.”\n\nLina’s mother smiled tightly. “Welcome, Hisham,” she said.\n\nHisham waved his hand and pointed at the bag. “This is not cheap,” he said, loud enough for the room. “A proper gift for a graduate.”\n\nLina opened it and pulled out a watch. Hisham leaned in. “Yes, that one,” he said. “I chose it myself.”\n\nAn aunt said, “Mabrook, Lina,” and Lina murmured, “Thank you.”\n\nHisham turned to Lina’s father and said, “You know, when my son graduates, I expect something similar. This is how families support each other.” He smiled and tapped his chest. “We don’t forget.”\n\nLina’s father nodded without speaking and poured tea. Hisham lifted his cup and said, “Next time you need anything, remember who stood with you,” then looked around the room as if waiting for acknowledgment.\n\nWhen Lina tried to set the watch back in the bag, Hisham stopped her. “Wear it,” he insisted, fastening it on her wrist and holding her arm up for others to see before sitting back down."
      }
    }
  }
]