[
  {
    "id": "1",
    "category": "Interaction",
    "full_action": "When the visitor notices a mistake, the visitor waits until a private moment and then offers a gentle correction that protects the other person’s face.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Rosa",
        "story": "Rosa was working with a small Cambodian team in Phnom Penh to set up a booth for a weekend craft market. In the busy hall, Nita taped a price sign to the front table. Rosa noticed the sign listed the wrong price for one item, but customers were already walking past and other volunteers were nearby.\n\nRosa didn’t comment in front of the group. She smiled, helped arrange the baskets, and waited until Nita stepped behind the booth to fetch more tape.\n\nWhen the moment was private, Rosa leaned closer and spoke softly. “Hey, Nita,” she said, keeping her voice low. “I think this sign might have the price for the other set.”\n\nNita looked at the sign and blinked. “Oh,” she said.\n\nRosa pointed gently with one finger. “This one is twelve, and that one is eight,” she said. “If you want, we can swap them now before more people come.”\n\nNita nodded quickly. “Yes, thank you.”\n\nRosa handed her the marker and held the corner of the paper steady while Nita corrected the number.\n\nA customer approached the front, and Rosa stepped forward to greet them while Nita smoothed the tape on the updated sign behind the table."
      }
    },
    "non_action": "The visitor corrects the person loudly in front of others and continues pressing the point even after the person looks uncomfortable.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Gavin",
        "story": "Gavin joined a small team in Siem Reap preparing a van for a day tour. Several people stood nearby with luggage, and the driver, Serey, was checking a list. Serey read out the pickup time for the first stop.\n\nGavin heard it and immediately said loudly, “No, that’s wrong.”\n\nEveryone looked over. Serey paused, holding the clipboard.\n\nGavin pointed at the list. “You wrote it wrong. It’s 7:30, not 8:30,” he said, voice carrying across the parking lot.\n\nSerey’s eyes dropped to the paper. “Maybe—” he started.\n\nGavin didn’t stop. “Don’t guess,” he said. “This is basic. You’re going to mess the whole schedule.”\n\nSerey’s mouth tightened, and he glanced toward the tourists.\n\nGavin kept pressing. “Fix it now. Say it again. Tell everyone you were wrong,” he said, still pointing.\n\nSerey shifted his feet and said quietly, “Okay.”\n\nGavin continued, “And next time, double-check,” while Serey erased the time with his pen. A tourist asked, “Is everything okay?” and Serey nodded without looking up.\n\nGavin crossed his arms and watched as Serey rewrote the line, the group standing in silence around the van."
      }
    },
    "principled_action": "Because a public safety risk requires immediate action, the visitor briefly interrupts to stop the unsafe step and then privately explains the correction with respectful wording afterward.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Amina",
        "story": "Amina visited a small workshop in Phnom Penh where a Cambodian team was setting up a temporary stage for an event. Several people were carrying metal frames, and one worker started to climb a ladder while holding the frame above his head.\n\nAmina saw the frame tilt toward an overhead cable. She stepped forward and spoke loudly enough to be heard. “Stop, please—hold on,” she said, lifting her palm.\n\nThe worker froze, and another person grabbed the frame to steady it.\n\nAmina pointed to the cable and said, “Not there,” then guided with her hand toward a safer angle. The frame was lowered and carried away from the cable.\n\nA few minutes later, when the crowd moved to another task, Amina walked over to the worker near the tool table. She kept her voice low. “Thank you for stopping quickly,” she said.\n\nThe worker nodded, breathing out.\n\nAmina added gently, “That cable is close, so it’s safer to carry the frame lower and have two people guide the top.”\n\nThe worker said, “Okay,” and looked at the ladder.\n\nAmina smiled briefly and said, “If you want, I can stand on the side and help watch the clearance.”\n\nThe worker picked up a pair of gloves, and Amina stepped to the side as the team resumed lifting the frames in pairs."
      }
    },
    "surface_action": "The visitor avoids direct public criticism, but later repeats the person’s mistake as a joke to others, turning the situation into indirect embarrassment.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Liam",
        "story": "Liam worked with a Cambodian colleague, Chenda, at a small office in Phnom Penh preparing a presentation. During a team meeting, Chenda clicked the wrong file on the projector and a personal photo briefly appeared before she switched it.\n\nLiam didn’t comment in the room. He kept his face neutral and looked back to the agenda while Chenda opened the correct slides.\n\nAfter the meeting, Liam walked with two other coworkers toward the elevator. He grinned and said, “Did you see Chenda’s ‘big presentation’?”\n\nOne coworker asked, “What?”\n\nLiam laughed. “She almost showed everyone her private gallery,” he said, miming a frantic click.\n\nThe coworkers chuckled, and Liam repeated, “Click, click, click—like a panic dance,” as the elevator doors opened.\n\nInside the elevator, Chenda stepped in behind them, holding her laptop. Liam kept smiling and said, “Oh, hey,” in a casual tone.\n\nChenda looked down at the floor indicator, then at her laptop, and stayed quiet.\n\nLiam continued to the others, “Next time we’ll label her files for her,” and the elevator moved upward with a soft hum while Chenda kept her eyes on the closing doors."
      }
    }
  },
  {
    "id": "2",
    "category": "Embodiment",
    "full_action": "When sitting on the floor at home, the visitor tucks their legs or sits cross-legged so their feet do not point toward other people.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Chenda Mean",
        "story": "Chenda visited her cousin’s home in Kampong Thom on a quiet evening. After removing her sandals, she stepped onto the mat in the living room where several relatives were already seated on the floor around a low tray of fruit. Her cousin’s father sat opposite, leaning against a pillow.\n\n“Sit here,” her cousin said, patting a space on the mat.\n\nChenda lowered herself and tucked her legs in, sitting cross-legged. She adjusted her feet so the soles faced inward and her toes pointed away from the others. When she shifted to reach for a glass of water, she kept her knees bent and moved her body rather than extending her legs.\n\nHer cousin’s father asked, “How was the bus?”\n\nChenda answered, “It was crowded,” and she kept her posture compact while speaking.\n\nA small child crawled between people to grab a banana. Chenda lifted her feet slightly and drew them closer so the child could pass without bumping her.\n\nHer cousin placed a plate of sliced mango in the center. Chenda leaned forward from the waist, not stretching her legs, and took a slice with her fingers.\n\n“More?” her cousin asked.\n\n“Just one,” Chenda said.\n\nAs the conversation moved to school schedules and neighborhood news, Chenda remained seated with her legs tucked, occasionally switching the cross of her ankles without pointing her feet toward anyone. When it was time to leave, she unfolded her legs carefully, stood up, and stepped off the mat to put her sandals back on by the door."
      }
    },
    "non_action": "The visitor stretches their legs toward others and keeps their feet aimed at people while ignoring hints to adjust posture.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Liam Carter",
        "story": "Liam visited his friend Kiri’s family home in Phnom Penh for an afternoon visit. After taking off his shoes, he stepped onto the floor mat where the family sat around a low table with snacks. Liam sat down and immediately stretched his legs out in front of him.\n\nHis feet pointed toward Kiri’s grandfather, who sat opposite with his hands folded.\n\nKiri glanced at Liam’s legs and said softly, “Maybe sit like this,” tucking his own legs under.\n\nLiam shrugged and leaned back on his palms. “My legs are tired,” he said, keeping them extended.\n\nKiri’s aunt placed a plate of fruit on the mat and looked at Liam’s feet, then shifted the plate farther away.\n\nLiam reached forward for a banana without moving his legs, his heel brushing the edge of the mat near the grandfather’s knee. The grandfather shifted slightly and looked down.\n\nKiri tried again. “You can cross your legs,” he said.\n\nLiam laughed. “I’m fine,” he replied, wiggling his toes inside his socks.\n\nThe grandfather spoke quietly to Kiri’s aunt in Khmer. The aunt nodded and placed cups of tea on the side away from Liam’s feet.\n\nLiam leaned forward, still stretched out, and accidentally nudged a cup with his heel. Tea sloshed and the aunt quickly grabbed the cup to steady it.\n\nKiri said, “Careful,” and touched Liam’s shin lightly to indicate moving it.\n\nLiam pulled his shin back a little but kept his feet pointed forward. “It’s okay,” he said, stretching again and resting his ankles on the mat while the family continued talking in shorter phrases around him."
      }
    },
    "principled_action": "Because the visitor has limited knee mobility, the visitor chooses a seat at the edge and angles their legs away from others while explaining the physical constraint politely.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Sopheary Kong",
        "story": "Sopheary visited her friend’s home in Siem Reap for a casual evening meal on a floor mat. When she entered, her friend’s mother gestured to a spot near the center of the mat. Sopheary hesitated and touched her knee.\n\n“Can I sit near the edge?” she asked. “My knees don’t bend well for cross-legged.”\n\nHer friend’s mother nodded. “Yes, sit there,” she said, pointing to the side near a small cushion.\n\nSopheary sat down at the edge and bent one leg in as much as she could. She angled her other leg to the side so her feet pointed toward the open space by the wall rather than toward the people seated opposite.\n\n“Is this okay?” Sopheary asked, looking at her friend.\n\n“Yes,” her friend said, shifting a plate slightly to give her room.\n\nAs dishes were placed on the mat, Sopheary leaned forward carefully, keeping her legs angled away. When she needed to adjust, she moved her hips and pulled her foot closer to the wall.\n\nHer friend’s father asked, “Do you want a pillow?”\n\n“A small one would help,” Sopheary said.\n\nA pillow was placed behind her, and she settled in, keeping her feet turned outward. During the meal, she ate slowly and used a napkin to wipe her hands, occasionally saying, “Sorry, I need to shift,” before changing her leg angle.\n\nAfter eating, she waited until others stood, then used her hands to help push herself up, stepping off the mat toward the doorway."
      }
    },
    "surface_action": "The visitor sits cross-legged at first, but then repeatedly extends a foot toward others during the conversation, making the form correct only intermittently.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Bora Seng",
        "story": "Bora joined a neighbor’s evening chat in Kampong Speu, sitting on a woven mat in the living room where a small fan turned slowly. The host gestured to a place on the mat, and Bora sat down cross-legged at first, keeping her feet tucked close.\n\nA plate of roasted peanuts and slices of guava was placed in the center. Bora leaned forward, took a piece, and sat back.\n\nAs the conversation moved to school fees and the price of fish, Bora shifted her posture and slowly extended one leg out for a moment, her foot pointing toward an older woman seated opposite. The older woman paused mid-sentence and glanced down.\n\nBora pulled her leg back and crossed it again. “It’s hot,” she said, fanning herself with her hand.\n\nA few minutes later, Bora laughed at a story and stretched her foot out again, nudging the edge of the mat near the older woman’s knees. The older woman moved her skirt and adjusted her sitting position.\n\nThe host’s son passed behind Bora with a tray of cups. Bora pulled her foot in briefly to let him pass.\n\nThen, while reaching for guava, she extended her leg once more, her heel pointing outward toward the older woman and a man beside her. The man stopped chewing and set his cup down.\n\nBora noticed and tucked her leg back under again. “Sorry,” she said quickly, then, as the talk continued, she stretched her foot out yet again while looking at her phone, keeping her upper body facing the group while her foot remained extended."
      }
    }
  },
  {
    "id": "3",
    "category": "Dining",
    "full_action": "When uncertain about table manners, the guest watches what others do and copies the group’s pace and customs.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Sokny Hem",
        "story": "Sokny joined a dinner at a friend’s home in Phnom Penh and realized she wasn’t sure which dishes were taken first. The table held several shared plates, and family members chatted while setting bowls down. Sokny sat where the host pointed and kept her utensils in her hands without starting.\n\nShe watched the host’s mother lift her spoon, take a small portion of rice, and then use her fork to push a piece of fish onto the spoon. Sokny copied the same grip and took a small portion after others began.\n\nWhen the soup bowl was passed, Sokny waited until the person to her left took a ladle first, then she held her bowl out in the same way. “Thank you,” she said as the ladle moved toward her.\n\nA plate of herbs was offered. Sokny noticed others taking only a few leaves at a time, so she took two leaves and placed them on her plate.\n\nSomeone stood up to get more rice. Sokny looked around and saw that people waited for the host’s mother to nod before refilling. She waited, then refilled when the rice pot came around.\n\nThe pace of eating was steady, with pauses for conversation. Sokny slowed when the group slowed, and she stopped serving herself when others stopped and began drinking water.\n\nWhen a child reached across the table, the host gently repositioned the plate closer. Sokny didn’t move any dishes herself, and instead followed the flow of passing. As the meal ended, she watched others place their utensils on their plates and did the same, then stood only after the host rose."
      }
    },
    "non_action": "When uncertain, the guest ignores the group’s cues, invents their own rules, and criticizes others for eating differently.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Hugo Stein",
        "story": "Hugo ate dinner with a Cambodian family in Siem Reap and looked at the spread of shared dishes on the low table. He wasn’t sure how the soup was served, but instead of watching, he picked up the ladle and poured soup into his bowl immediately.\n\nA young cousin held out a bowl and paused when the ladle was gone.\n\nHugo said loudly, “You should serve soup first, always. That’s the correct way,” and continued pouring until his bowl was nearly full.\n\nHe then grabbed the rice pot and scooped a large mound onto his plate. Seeing others using spoon and fork, he shook his head. “This spoon thing is inefficient,” he said. “Just use the fork and be done.”\n\nThe host’s mother smiled tightly and continued eating with her spoon.\n\nHugo watched a cousin take herbs slowly and said, “Why are you taking so little? Eat properly.” He reached into the herb plate and took a big handful, scattering leaves back onto the mat.\n\nWhen an elder paused before starting, Hugo started eating anyway. “No need to wait,” he said, chewing and pointing. “In my culture, we just eat when food is on the table.”\n\nThe elder lifted their spoon more slowly.\n\nHugo criticized again, “You’re all too slow,” and he began giving instructions: “Pass dishes to the right,” he said, sliding bowls around in his own pattern.\n\nA child’s cup tipped as a bowl bumped it, and water spilled onto the mat. Hugo looked down and said, “See? That’s why you shouldn’t do it like that,” while continuing to eat without stopping."
      }
    },
    "principled_action": "Because the guest has a dietary restriction, the guest quietly asks the host for guidance on what is appropriate to do and then follows the host’s instructions closely.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Sreyka Thach",
        "story": "Sreyka joined a home dinner in Phnom Penh and noticed several dishes she couldn’t identify. She had a dietary restriction and needed to avoid certain ingredients. Before the meal started, she leaned toward the host, Lina, and spoke softly.\n\n“Can I ask you something?” Sreyka said. “I can’t eat seafood today. What is okay for me to take, and how should I do it?”\n\nLina nodded and pointed discreetly. “This vegetable dish is fine. The soup has shrimp, so skip that. Take rice when my mom passes the pot.”\n\n“Thank you,” Sreyka said.\n\nSreyka sat where she was placed and waited. When Lina’s mother began serving, Sreyka followed her cue and accepted a small portion of rice. She used her fork to push vegetables onto her spoon, copying the others’ utensil style.\n\nWhen the soup ladle came around, Sreyka held her bowl down and said quietly, “No thank you,” then moved her bowl slightly aside so the ladle could pass to the next person.\n\nA cousin offered her a piece of fish. Sreyka shook her head gently and said, “I can’t,” keeping her voice low. The cousin nodded and offered it to someone else.\n\nSreyka ate at the table’s pace, taking small bites and pausing when others paused. When Lina’s mother asked, “More rice?” Sreyka looked at Lina, then said, “A little,” and held her bowl out when the rice pot was brought to her.\n\nAfter the meal, she watched the others set utensils on their plates and did the same, then thanked Lina’s mother before standing up."
      }
    },
    "surface_action": "The guest copies others’ gestures, but uses the mimicry to compete and take more food than others while appearing polite.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Vuthy Chey",
        "story": "Vuthy joined a dinner in Phnom Penh at a friend’s house and watched carefully as the family began eating. He mirrored their spoon-and-fork grip and waited until the eldest aunt took the first bite before lifting his spoon.\n\nAs dishes started moving, Vuthy copied the exact gestures: he held his bowl out when others held theirs out, nodded when others nodded, and said, “Thank you,” in the same soft tone. At the same time, he took slightly larger portions each time the bowl reached him.\n\nWhen the rice pot came around, he watched the person ahead take one spoonful, then Vuthy took two, smoothing the rice flat so it didn’t look piled high. He smiled and passed the pot on quickly.\n\nA plate of grilled meat was set down. Vuthy waited for the person beside him to pick a piece, then he reached in with the same motion and selected two of the best pieces, placing them neatly on his plate.\n\n“More?” the host asked.\n\nVuthy nodded politely. “Just a little,” he said, holding his plate out. When the host served, Vuthy angled the plate to catch a larger scoop.\n\nHe kept eating at a steady pace, matching the table’s rhythm, but each time a dish returned, he took another portion while maintaining the same calm expression. A younger cousin looked at the meat plate, then at Vuthy’s plate, and reached for a smaller piece left near the edge.\n\nWhen dessert fruit arrived, Vuthy waited for others to take one slice and then took two slices, stacking them neatly and saying, “Thank you,” before passing the plate on."
      }
    }
  },
  {
    "id": "4",
    "category": "Belief",
    "full_action": "Inside temple spaces, the visitor maintains restrained body language and follows a formal, quiet demeanor around monastics and worshippers.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Piseth Hem",
        "story": "Piseth entered a temple hall in Phnom Penh with his aunt just before noon. Shoes were lined along the steps, and the hall was cool compared to the street. A few worshippers knelt on mats facing the front shrine.\n\nPiseth lowered his voice. “I’ll follow you,” he whispered.\n\nHe kept his hands close to his sides and walked along the edge of the hall rather than cutting through the center. When his phone buzzed, he didn’t pull it out; he pressed the side button through his pocket to silence it.\n\nA monk moved past carrying a small bowl. Piseth stepped to the side and waited, eyes lowered until the monk passed.\n\nHis aunt paused to light incense. Piseth stood behind her without waving or pointing, then clasped his hands loosely in front of his waist. He watched quietly as she placed the incense at the holder.\n\nA child shifted on a mat and glanced back; Piseth gave a small nod and looked forward again. He didn’t speak.\n\nAfter a few minutes, his aunt gestured toward the exit. Piseth followed her out, picking up his sandals at the steps and slipping them on near the edge of the courtyard."
      }
    },
    "non_action": "Inside the temple, the visitor speaks loudly, gestures dramatically, and treats the space like a casual tourist spot without regard for worship.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Marco Rizzi",
        "story": "Marco walked into a temple hall in Siem Reap with a friend, talking as if they were still on the street. “This place is huge!” he said loudly, his voice echoing off the painted ceiling.\n\nHe pointed at a row of monks seated near the front. “Look at them—get a photo,” he said, waving his arm in a wide arc.\n\nA worshipper turned her head. Marco didn’t lower his voice. He laughed and made an exaggerated bow toward the shrine. “Your majesty,” he joked, then made his friend take a picture.\n\nHe stepped into the center aisle, swinging his backpack as he walked. “Stand here, do the pose,” he told his friend, spreading his arms dramatically.\n\nThe friend raised a phone. A monk looked up briefly, then looked down again.\n\nA temple attendant approached and spoke quietly. Marco replied over him, “Yeah, yeah, we’re just having fun,” and kept gesturing.\n\nHe clapped once to get his friend’s attention and said, “Try it again, with the statue behind.”\n\nA small child near a mat covered his ears and leaned into an adult. Marco kept talking and pointing, then walked toward the front steps without waiting for a pause in the hall."
      }
    },
    "principled_action": "Because the visitor is assisting someone with a medical need, the visitor moves efficiently and speaks only as necessary while still keeping a respectful tone and minimizing disturbance.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Maly Chhun",
        "story": "Maly arrived at a pagoda in Kampong Cham with her father, who had been feeling dizzy since the morning. They removed their shoes at the entrance, and Maly supported his elbow as they stepped into the hall.\n\nHer father whispered, “I need to sit.”\n\nMaly scanned the room and chose a spot along the side wall, away from the center where people were kneeling. She spoke softly to a nearby attendant. “Excuse me, my father isn’t well. Can we sit there?”\n\nThe attendant nodded and moved a small bench slightly. Maly guided her father down and helped him sit, keeping her movements close and controlled.\n\nShe pulled a water bottle from her bag and held it near his hand. “Small sip,” she whispered.\n\nA monk walked past, and Maly shifted her knees inward and lowered her head until he passed. She didn’t raise her voice or wave for attention.\n\nWhen her father steadied his breathing, Maly said quietly, “We’ll rest five minutes, then we can go out.” She checked his forehead with the back of her fingers and then put her hand back at her side.\n\nThe sound of chanting continued at the front, and Maly stayed seated beside her father, watching the doorway and waiting for him to nod."
      }
    },
    "surface_action": "The visitor remains quiet and controlled in posture, but then interrupts rituals by stepping into the center for photos, prioritizing access over the space’s intent.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Sothea Sieng",
        "story": "Sothea entered a temple hall in Phnom Penh with her camera strap across her shoulder. She kept her footsteps light and her voice low, following behind a group. A chant rose from the front where worshippers sat facing the shrine.\n\nSothea held her hands close to her body and didn’t talk as she moved along the side wall. She nodded once to an attendant and waited near a pillar.\n\nThen she saw the center aisle open and stepped forward, still silent, walking straight down the middle toward the front. People remained seated on mats; a few heads turned.\n\nSothea raised her camera and crouched in the center, framing the monks and the altar. She leaned left, then right, shifting her knees on the floor to adjust the angle.\n\nA worshipper lifted her hand slightly as if to signal “stop.” Sothea didn’t answer; she kept the camera to her face and took several shots.\n\nA monk’s chant paused for a breath, and the room stayed quiet. Sothea stood, stepped closer again, and took one more photo from the middle.\n\nShe backed up slowly, still keeping her face neutral, then turned and walked out to the side aisle, tightening her camera strap as she reached the doorway."
      }
    }
  },
  {
    "id": "5",
    "category": "Kinship",
    "full_action": "When the host offers the guest the best seat and better portions, the guest accepts the arrangement graciously and thanks the host.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Rithy Soth",
        "story": "Rithy arrived at his aunt’s home in Phnom Penh for a family lunch. The table was set low in the living room, with bowls of sour soup and plates of grilled fish. His uncle pulled out a chair with a cushion near the fan.\n\n“Sit here, nephew,” his uncle said.\n\nRithy sat down where he was directed and placed his hands together briefly. “Thank you, uncle,” he said.\n\nHis aunt brought a plate with the fish belly and extra herbs and set it closer to Rithy than to anyone else. “Eat more,” she said.\n\nRithy nodded. “Thank you, auntie,” he replied, and waited until the others settled before picking up his spoon.\n\nA younger cousin glanced at the plate, then reached for a smaller piece. Rithy shifted the plate slightly so the cousin could take a bite without moving the whole dish.\n\nHis aunt refilled his rice and added a small ladle of soup to his bowl. Rithy said, “Arkun,” and took a small sip.\n\nWhen his uncle asked about his work, Rithy answered while eating slowly, keeping his elbows close. After the meal, he carried his bowl to the kitchen sink and said, “Thank you for the food,” before returning to the living room."
      }
    },
    "non_action": "The guest rejects the seat with irritation, demands a different place, and complains about the portions in front of the host’s family.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Lena Hart",
        "story": "Lena arrived at her colleague’s family home in Siem Reap for dinner. The host’s mother pointed to a cushioned chair near the fan. “Please sit here,” she said.\n\nLena frowned and waved her hand. “No, I don’t want that seat. It’s too close to everyone,” she said, pulling a different chair from the corner with a scrape.\n\nThe host’s brother paused mid-step. The mother said, “That seat is good.”\n\nLena sat anyway where she chose and looked at the plates being served. When the mother placed a small portion of fish amok in front of her, Lena pushed the plate slightly away. “Is that all?” she asked loudly.\n\nThe host whispered, “It’s shared.”\n\nLena shrugged. “I’m hungry. And this looks watery,” she said, poking at the sauce with her spoon. “Do you have something better?”\n\nA child across the table stopped chewing and stared. The mother’s hands hovered near the serving bowl.\n\nLena leaned back and said, “I thought there would be more food. Next time tell me before I come.” She reached across the table toward a second dish without asking and dragged it closer.\n\nThe host’s father sat down slowly and began eating without speaking."
      }
    },
    "principled_action": "Because the guest has a health issue that requires a specific seat or portion size, the guest thanks the host first and then requests a small adjustment with a clear practical reason.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Sarin Khea",
        "story": "Sarin visited his friend’s family in Kampong Thom for lunch. The host offered him the best seat near the fan and set a generous portion of pork and rice in front of him.\n\n“Sit here, Sarin,” the host said.\n\nSarin sat down and smiled. “Thank you, uncle,” he said to the host’s father. He waited until the host’s mother finished placing bowls on the table.\n\nBefore eating, Sarin said softly, “Auntie, thank you for cooking. Can I ask something small?”\n\nShe looked at him. “Yes?”\n\n“I have a stomach issue,” Sarin said, touching his abdomen lightly. “If I eat too much oily food, I get sick. Could I take a smaller piece and more vegetables?”\n\nThe auntie nodded and moved the pork dish slightly away. “No problem,” she said, scooping extra morning glory onto his plate.\n\nSarin nodded again. “Thank you,” he said.\n\nThe host adjusted the fan so it pointed toward Sarin’s seat. Sarin accepted the arrangement and began eating slowly, taking small bites.\n\nWhen the host offered a second helping, Sarin raised his hand gently. “It’s enough for me,” he said, smiling, and lifted his water glass for a small sip as conversation continued around the table."
      }
    },
    "surface_action": "The guest accepts the best seat politely, but then keeps requesting upgrades and extra portions while framing it as “just following what you offered.”",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Sovannary Pech",
        "story": "Sovannary arrived at her cousin’s home in Phnom Penh for a Sunday lunch. Her cousin’s mother pointed to a cushioned chair near the fan. “You sit here,” she said.\n\nSovannary smiled and sat down. “Thank you, auntie,” she said.\n\nA plate with extra beef lok lak and a small bowl of dipping sauce was placed in front of her. Sovannary took a bite, then looked up. “Auntie, since you gave me the best seat, can I have the bigger spoon too?” she asked, half-laughing.\n\nThe auntie handed over a larger spoon. Sovannary nodded. “Arkun.”\n\nAfter a few minutes, she said, “You told me to eat more, right? Then give me a little more beef,” and slid her plate forward. The cousin’s mother added another piece.\n\nSovannary chewed and then pointed at the mango plate. “And the ripe one, please—since I’m your guest.”\n\nHer cousin shifted his eyes to the table. The auntie handed a mango slice across.\n\nSovannary said, “You offered, so I’m just accepting,” and reached for another helping. The fan hummed above her while others served themselves smaller portions."
      }
    }
  },
  {
    "id": "6",
    "category": "Exchange",
    "full_action": "When planning birthday gifts, the visitor checks whether the person celebrates birthdays and does not assume that birthdays are a major gift occasion for everyone.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Sophea Vannak",
        "story": "Sophea was invited to her coworker Dara’s house in Phnom Penh for a weekend lunch. On Friday, she stopped by a small shop near Psar Toul Tom Poung and looked at scented soap sets and small fruit baskets. Before buying anything, she sent Dara a message: “Hey, do you celebrate birthdays? I heard your family is gathering on Sunday.”\n\nDara replied with a voice note: “We will eat together, but we don’t do big birthday gifts. Just come.”\n\nOn Sunday, Sophea arrived on her motorbike with a bag of oranges and a box of Khmer sweets. At the gate, Dara’s mother greeted her. Sophea held the fruit with both hands. “Chum reap suor, Auntie. I brought some fruit for the house,” she said.\n\nInside, Dara’s cousins sat on mats, and bowls of soup steamed on the table. Dara laughed and said, “You didn’t bring anything crazy.”\n\nSophea smiled and answered, “I asked first. I didn’t want to assume.”\n\nThey ate, and Sophea helped refill iced tea. When Dara’s younger brother brought out a small cake, Sophea clapped lightly with everyone and took a quick photo when Dara leaned forward to blow the candles.\n\nAfter lunch, Sophea washed her hands at the outdoor tap, wiped them on a towel, and handed the towel back to Dara’s aunt."
      }
    },
    "non_action": "The visitor mocks the person for not knowing an exact birth date and pressures them to hold a large birthday celebration with expensive gifts.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Kevin Laurent",
        "story": "Kevin was chatting with his Cambodian colleague Sreyneang in an office in Phnom Penh while waiting for a client call. He opened his calendar app and said loudly, “So what’s your exact birth date? Day, month, year.”\n\nSreyneang hesitated. “I’m not sure the exact day. My parents remember the year.”\n\nKevin laughed and leaned back in his chair. “How can you not know your own birthday? That’s crazy.” He waved his hand toward the others. “Guys, she doesn’t even know her birth date.”\n\nA coworker glanced up from a laptop. Sreyneang looked down at her notebook.\n\nKevin continued, “You need to do a real celebration. Big party, nice restaurant, proper gifts. Otherwise what’s the point?” He tapped the desk. “You should tell everyone to bring something expensive. New phone, nice bag—something worthy.”\n\nSreyneang said quietly, “We don’t usually do that.”\n\nKevin pressed, “No, you must. I’ll make a list. Who will give the best gift? We’ll see.” He opened a group chat and started typing, “Sreyneang birthday party—everyone bring gifts.”\n\nSreyneang reached out. “Please don’t,” she said.\n\nKevin looked at her and said, “Don’t be boring,” then hit send and set his phone face up on the desk as notification pings began appearing."
      }
    },
    "principled_action": "Because the visitor must record a birth date for administrative reasons, the visitor explains the requirement calmly, accepts an approximate answer if appropriate, and avoids turning it into social pressure.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Chanthou Sok",
        "story": "Chanthou sat at a small desk in a training centre in Siem Reap, helping new participants complete registration forms. A stack of papers and a stamp pad sat beside her laptop.\n\nWhen she reached one line, she asked the participant, Vuthy, “I need your date of birth for the record.”\n\nVuthy frowned. “I know the year, but not the exact day. My family didn’t write it down.”\n\nChanthou nodded and kept her pen hovering above the form. “That’s okay,” she said. “The system asks for a date. If you only know the month or an approximate day, we can use that, and I’ll note it as approximate.”\n\nVuthy said, “Maybe around the Water Festival time.”\n\nChanthou smiled slightly. “Alright. Do you know which month it usually falls in?” she asked, pointing to the calendar on the wall.\n\nHe answered, and Chanthou wrote the month and chose a mid-month day, then added a small note in brackets: “approx.” She turned the page and continued. “Next, your phone number,” she said.\n\nAnother trainee nearby joked, “So when is your birthday party?”\n\nChanthou lifted her eyes and said, “We’re just completing the form,” then returned to the paper.\n\nVuthy signed at the bottom, and Chanthou stamped the form once and placed it neatly into the completed pile."
      }
    },
    "surface_action": "The visitor says birthdays are optional, but still uses the occasion to compare gift amounts and publicly rank who gave the “best” present.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Lina Phan",
        "story": "Lina attended a small birthday gathering for her friend Makara at a café near the riverside in Phnom Penh. Before the cake arrived, Lina told the table, “Birthdays are optional, you know. No pressure.”\n\nPeople nodded and sipped iced coffee. When gifts started appearing, Lina leaned forward and asked, “What did you bring?” She peeked into gift bags as they were set down.\n\nMakara’s cousin handed over an envelope. Lina said, “Oh, cash is practical,” and glanced at the thickness before smiling.\n\nAnother friend placed a small skincare set on the table. Lina lifted the box slightly and read the brand name out loud. “This is the good one,” she said.\n\nMakara laughed awkwardly and said, “Just being here is fine.”\n\nLina waved her hand. “Of course, of course,” she said, then turned to the others. “Okay, I think the envelope wins, but the skincare is second.”\n\nSomeone across the table said, “It’s not a competition.”\n\nLina continued anyway. “Third place is probably the flowers,” she said, pointing at a small bouquet.\n\nWhen Makara cut the cake, Lina took a photo and said, “Hold on, everyone, group picture,” then arranged the gifts in front of Makara for the camera.\n\nAfter the photo, Lina opened her wallet, pulled out a small card she had written, and slid it under Makara’s plate while the waiter placed forks on the table."
      }
    }
  },
  {
    "id": "7",
    "category": "Civility",
    "full_action": "In a close friendship or family relationship, the visitor remains open to occasional unannounced visits and welcomes the person in a calm manner when feasible.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Rithy Keo",
        "story": "Rithy was at home in Battambang on a Sunday afternoon, rinsing vegetables in the kitchen sink. The fan hummed, and his phone played a low song on the counter.\n\nHe heard a motorbike stop outside and a knock on the gate. When he opened it, his cousin Chenda stood there holding a small bag of grilled corn. “Brother, I was passing by,” she said.\n\nRithy smiled and stepped aside. “Come in,” he said calmly. “You arrived at a good time.”\n\nChenda walked into the courtyard and looked around. “I didn’t call,” she said.\n\n“It’s okay,” Rithy replied. He took the corn bag with his right hand and set it on the table. “Sit. I’m washing greens.”\n\nHe brought out two plastic stools and placed one near the shade. Chenda sat and started telling him about her new job at a small shop. Rithy listened while tearing herbs into a bowl.\n\nRithy’s mother came out and greeted Chenda, and Chenda stood and pressed her palms together. Rithy poured water into cups and handed one to Chenda.\n\n“Do you want to eat now?” Rithy asked.\n\n“Just a little,” Chenda said.\n\nRithy nodded and heated leftover soup on the stove, then carried bowls to the table and set a spoon beside Chenda’s bowl before sitting down across from her."
      }
    },
    "non_action": "The visitor angrily scolds the visitor at the door, treats the drop-in as an insult, and humiliates them in front of others.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Sokha Dara",
        "story": "Sokha was at home in Phnom Penh with two friends, watching a football match on his phone. The three of them sat on the floor with snacks spread out on a tray.\n\nA knock came at the door. Sokha opened it and saw his friend Vanna standing there. “Hey, I was nearby,” Vanna said, smiling.\n\nSokha’s face tightened. “What is this?” he snapped, loud enough for his friends to hear. “You think you can just come anytime?”\n\nVanna blinked. “I just wanted to say hi.”\n\nSokha turned his head and called into the room, “Look who came without calling—like he owns the place.” His friends laughed uncomfortably.\n\nVanna shifted his feet. “If you’re busy, I can go.”\n\nSokha stepped closer and pointed at Vanna’s chest. “Next time, use your phone. Don’t show up like this. It’s disrespectful.”\n\nVanna’s smile faded. He glanced past Sokha at the friends inside.\n\nSokha raised his voice again. “He always does this. No manners.”\n\nOne friend looked down at the snacks. Vanna lowered his eyes and said, “Okay.”\n\nSokha didn’t step aside. “Go,” he said, and he stood in the doorway until Vanna turned around.\n\nVanna walked down the corridor, and Sokha shut the door hard, then turned back to his friends and said, “Can you believe that?” as the match audio continued playing."
      }
    },
    "principled_action": "Because the visitor is ill or unavailable, the visitor politely explains the situation at the door, offers a better time to meet, and follows up later to maintain the relationship.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Sreymao Heng",
        "story": "Sreymao stayed home in Siem Reap with a sore throat, wrapped in a light blanket on the sofa. A cup of warm tea sat on the table, and a box of tissues was open beside it.\n\nIn the late afternoon, she heard a knock at the gate and her friend Pisey calling her name. Sreymao stood slowly and opened the door, keeping one hand on the frame.\n\nPisey smiled. “I came to see you. I was nearby,” she said.\n\nSreymao smiled back but didn’t step fully aside. “Thank you for coming,” she said softly. “I’m not well today. My throat is bad, and I’m trying to rest.”\n\nPisey looked at her face and nodded. “Oh. Are you okay?”\n\n“I’m okay,” Sreymao said. “Can we meet tomorrow or the next day? Maybe after lunch, around two?”\n\nPisey said, “Yes, I can come tomorrow.”\n\nSreymao added, “I’ll message you in the morning to confirm.” She lifted her palm in a small greeting gesture again. “Sorry I can’t invite you in today.”\n\nPisey said, “No problem. Rest.”\n\nAfter Pisey left, Sreymao closed the door and sat back down. She picked up her phone and sent a short message: “Thank you for coming. Let’s meet tomorrow 2 pm if I feel better.”\n\nAn hour later, she followed up with a voice note to Pisey, then set her phone on the table and drank the last sip of tea."
      }
    },
    "surface_action": "The visitor lets the person in, but then makes repeated pointed remarks about the inconvenience to make the guest feel unwelcome.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Vireak Sorn",
        "story": "Vireak was folding laundry in his Phnom Penh apartment when his friend Bora knocked without calling. Vireak opened the door and stepped back. “Come in,” he said.\n\nBora entered and smiled. “I was passing by.”\n\nVireak nodded and pointed to a chair. “Sit,” he said, then added, “I was in the middle of something.” He kept folding shirts, stacking them on the sofa.\n\nBora said, “Sorry, I didn’t mean to disturb.”\n\nVireak waved his hand. “It’s fine,” he said, then glanced at the clock. “I planned to go out soon, but okay.”\n\nBora sat and started telling a story about work. Vireak listened with half his attention, then said, “If you called, I could have prepared. Now the house is messy.”\n\nBora laughed lightly. “It’s okay.”\n\nVireak poured water into one cup and handed it over. “Here,” he said, then muttered, “I only have one clean cup because I didn’t expect anyone.”\n\nBora sipped and looked around. Vireak continued, “I’ll have to finish this laundry later because of this surprise visit.”\n\nBora said, “I can leave if you want.”\n\nVireak replied, “No, stay,” but he repeated, “I’m busy,” as he picked up another pile and shook out a towel.\n\nAfter a few minutes, Vireak stood, opened the window, and said, “It’s getting late,” while Bora set his cup down on the table."
      }
    }
  },
  {
    "id": "8",
    "category": "Business",
    "full_action": "In a professional setting, the colleague avoids publicly contradicting someone and instead offers indirect, private correction that helps everyone save face.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Vicheka Sreng",
        "story": "Vicheka worked at a small logistics company in Phnom Penh. During a Monday meeting, her colleague Sareth presented shipping costs on a whiteboard while the manager listened.\n\nSareth wrote a figure for customs fees that looked too low. Vicheka noticed it and kept her face neutral. She didn’t speak over him or correct him in front of the room. Instead, when Sareth paused to take a call, Vicheka leaned toward the manager and said softly, “Maybe we can double-check the customs line after the meeting.”\n\nThe manager nodded without responding out loud.\n\nAfter the meeting ended, Vicheka walked beside Sareth toward the printer. “Sareth,” she said, “can we look at the customs fee number together? I might be reading the sheet differently.”\n\nSareth frowned and opened his laptop. Vicheka pointed at the spreadsheet. “Here, last month it shows 120, not 80. Maybe the column shifted when it copied.”\n\nSareth scrolled and said, “Oh, you’re right. I took the wrong row.”\n\nVicheka nodded. “No problem. If you update it, I can help resend the revised figure to the manager,” she said.\n\nSareth changed the number and saved the file. Vicheka stood by the printer and waited while it warmed up, then took the printed page and handed it to Sareth.\n\nSareth walked back into the manager’s office and said, “I have an updated customs line,” and Vicheka returned to her desk and opened her email draft to attach the corrected sheet."
      }
    },
    "non_action": "In a meeting, the colleague publicly contradicts the person, calls out errors bluntly, and frames the exchange as winning an argument.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Alex Morgan",
        "story": "Alex attended a project meeting in Phnom Penh with his Cambodian colleague, Sothy, and a small team. Sothy stood at the front and presented a timeline on a slide.\n\nHalfway through, Sothy said, “We can deliver the first phase in four weeks.”\n\nAlex interrupted loudly, “No, that’s wrong.” He leaned back and said, “That’s impossible, and your estimate is bad.”\n\nSothy paused. “We can—”\n\nAlex cut him off again. “You didn’t calculate properly,” he said, pointing at the screen. “Look, everyone, this is why we keep missing deadlines.”\n\nA teammate looked down at their notes. The manager stared at the slide.\n\nSothy tried to explain, “We already spoke with the vendor—”\n\nAlex laughed and said, “Vendor or not, you’re still wrong.” He turned to the manager. “I told you last week this plan wouldn’t work.”\n\nSothy’s shoulders stiffened. “We can adjust the scope,” he said.\n\nAlex raised his voice. “That’s just an excuse. Admit you made a mistake.” He tapped the table. “I can do a better plan in ten minutes.”\n\nThe room went quiet. Alex opened his laptop and said, “Give me the file, I’ll fix it,” as if concluding a debate.\n\nSothy sat down slowly, and Alex continued, “See? This is why you need me,” while the manager cleared his throat and called for a short break."
      }
    },
    "principled_action": "Because a public decision must be corrected to prevent immediate harm, the colleague states the correction briefly and respectfully, then follows up privately to preserve the relationship and dignity.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Soklin Meas",
        "story": "Soklin sat in a meeting room in Phnom Penh as the team discussed sending a delivery truck to a warehouse. The manager pointed at a map and said, “We will send the truck to Street 200 first.”\n\nSoklin recognized the address and knew the warehouse on Street 200 was closed for maintenance that day. The dispatch time was in ten minutes, and the driver was already waiting downstairs.\n\nSoklin spoke up briefly, keeping his voice steady. “Excuse me, I may have an update,” he said. “The Street 200 warehouse is closed today. The contact person confirmed it this morning.”\n\nThe manager paused. “Closed?”\n\n“Yes,” Soklin replied. “To avoid wasting the trip, we can send the truck to Street 310 first, then go to Street 200 tomorrow.”\n\nThe manager nodded once and said, “Okay, change it.”\n\nAfter the meeting, Soklin walked with the manager into the hallway. “Thank you,” Soklin said quietly. “I didn’t want to interrupt, but the driver was about to leave.”\n\nThe manager said, “Good you said it.”\n\nSoklin then approached the colleague who had provided the earlier location note, Dara, near the water dispenser. “Dara, I saw your note about Street 200,” Soklin said. “Today it’s closed, so we switched. Tomorrow it should be fine.”\n\nDara nodded. “I didn’t know.”\n\nSoklin replied, “No problem,” and he sent a short message to the driver with the updated address, then watched the read receipt appear before putting his phone back in his pocket."
      }
    },
    "surface_action": "The colleague avoids public contradiction, but later sends a group message that subtly blames the person, undermining face while appearing polite.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Piseth Chhay",
        "story": "Piseth sat through a weekly meeting in Phnom Penh where his colleague Rotha presented inventory numbers. Piseth noticed a mismatch between the slide and the shared spreadsheet, but he didn’t speak up in the room.\n\nAfter the meeting, he returned to his desk and opened the team’s group chat. He typed, “Hi team, quick clarification: the correct inventory for Item C is 540, not 450, according to the shared file.”\n\nA minute later, he added another message: “Please double-check figures before sharing in meetings so we don’t confuse management.”\n\nRotha saw the messages and replied, “I will update.”\n\nPiseth responded with a polite emoji and wrote, “Thanks,” then sent a screenshot of the spreadsheet with the corrected cell highlighted.\n\nOther teammates reacted with thumbs up. Rotha stopped replying.\n\nLater that afternoon, Piseth passed Rotha at the copier and said, “All good?” with a small smile, as if the group messages were routine.\n\nRotha nodded without speaking.\n\nPiseth returned to his desk and forwarded the updated numbers to the manager in an email. In the group chat, he wrote again, “I’ve sent the corrected file to management,” and he tagged Rotha’s name in the message.\n\nPiseth then opened a new document and began typing the next week’s agenda while notification dots continued appearing on the chat thread."
      }
    }
  },
  {
    "id": "9",
    "category": "Privacy",
    "full_action": "The visitor does not bring up Khmer Rouge history as a conversation starter and instead lets the Cambodian counterpart choose if and when to mention it.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Emily Chen",
        "story": "Emily met her Cambodian colleague, Sopheary, for lunch at a small restaurant in Phnom Penh near their office. The menu board listed noodle soups and rice dishes, and a fan turned above the tables.\n\nEmily started with ordinary topics. “How was your weekend?” she asked, passing the menu back after choosing amok.\n\nSopheary said, “I went to visit my parents outside the city.”\n\nEmily nodded. “Nice. Do they grow anything at home?” she asked.\n\nThey talked about mango season, traffic on Monivong, and a new café that had opened nearby. When the food arrived, Emily said, “This smells good,” and began eating.\n\nSopheary mentioned her father’s old photos. “My father keeps pictures from when he was young,” she said.\n\nEmily listened and said, “That sounds special,” then asked, “Do you like taking photos too?”\n\nSopheary smiled and said she liked photos but didn’t have much time.\n\nAs they finished, Sopheary brought up a museum visit she had made with her cousin. “We went to Tuol Sleng last month,” she said quietly.\n\nEmily didn’t jump in with questions. She nodded and said, “Thank you for telling me,” then let a short pause sit before asking, “Do you want to talk about it, or should we change topic?”\n\nSopheary replied, “We can change,” and Emily said, “Okay,” then asked, “Should we take iced coffee back to the office?”\n\nThey paid at the counter, and Emily held the door as Sopheary stepped outside into the heat, where a tuk-tuk driver called out prices from the curb."
      }
    },
    "non_action": "The visitor opens the conversation by asking about Khmer Rouge experiences and pushes for personal details despite discomfort.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Peter Wallace",
        "story": "Peter met a Cambodian tour guide, Serey, at a café in Siem Reap before a planning session. As soon as they sat down, Peter leaned forward and said, “So, what did your family experience during the Khmer Rouge? Did anyone die?”\n\nSerey’s eyes shifted to the side. “It was a long time ago,” he said.\n\nPeter pressed, “But tell me details. Were you in a camp? Were your grandparents forced to work? I want the real story.” He pulled out his phone as if ready to record.\n\nSerey said, “My grandparents don’t like to talk.”\n\nPeter ignored that and asked again, “Okay, but you must know something. How many people in your family were lost? What happened to them exactly?”\n\nSerey’s hands tightened around his cup. “I don’t know all.”\n\nPeter said, “Come on, everyone knows. Ask them. It’s important,” and he leaned closer. “Did your family see killings? Did they hide? Where did they run?”\n\nSerey looked toward the entrance and said, “We can talk about the tour plan.”\n\nPeter waved him off. “Later. This is more interesting,” he said, smiling.\n\nSerey stopped answering and stared at the table. Peter continued listing questions and said, “Don’t be shy,” as the waitress arrived and placed two glasses of water down between them."
      }
    },
    "principled_action": "Because the visitor is in a formal educational setting, the visitor introduces the topic with a content warning, invites voluntary participation, and makes it clear that anyone can decline to discuss it.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Dr. Laura Kim",
        "story": "Dr. Laura Kim taught a short seminar at a university in Phnom Penh. Students sat in rows with notebooks open, and the projector showed a slide titled “Modern Cambodian History.”\n\nBefore changing slides, Laura spoke into the microphone in a calm tone. “Before we continue, I want to give a content warning,” she said. “The next section includes discussion of violence and loss during the Khmer Rouge period. If you prefer not to engage with this topic today, you can step out, or you can choose not to share anything personal.”\n\nShe paused and looked around without calling on anyone. “Participation is voluntary,” she added. “You can also write a general reflection instead of speaking.”\n\nA few students shifted in their seats. One student quietly closed their notebook and walked to the door; Laura nodded once and continued.\n\nLaura moved to a slide with dates and a map. She stayed with factual content, pointing to the timeline and reading short headings.\n\nAfter ten minutes, she said, “If anyone wants to comment, you can keep it general—about what you learned or how communities remember history. You do not need to share family stories.”\n\nA student raised a hand and asked about museums. Laura answered and wrote the museum names on the board.\n\nWhen another student asked a question about school curricula, Laura replied, “That’s a good question,” and took a note on a sticky pad to follow up.\n\nAt the end of class, Laura reminded everyone, “If you want support or need to talk privately, you can email me,” then she packed her laptop into her bag as students filed out, some speaking softly to each other in the hallway."
      }
    },
    "surface_action": "The visitor avoids starting the topic directly, but steers the conversation toward it through leading questions until the other person is cornered into responding.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Samantha Ortiz",
        "story": "Samantha met her Cambodian colleague, Chankrisna, for coffee in Phnom Penh after a workshop. She started with light conversation. “How’s work been?” she asked, stirring condensed milk into her iced coffee.\n\nChankrisna talked about deadlines and a new supervisor. Samantha nodded and said, “Interesting,” then asked, “Do your parents talk a lot about the past?”\n\nChankrisna shrugged. “Not much.”\n\nSamantha didn’t say the specific topic yet. She asked, “Like, when they were young, did they move around a lot? Did they have to leave their home?”\n\nChankrisna paused. “My family moved, yes.”\n\nSamantha leaned forward. “Was it because of the war? Did they ever mention hard times?”\n\nChankrisna looked down at the table. “It was difficult.”\n\nSamantha continued, “So did they ever talk about that period when people were forced to work? I mean, everyone here has some story, right?”\n\nChankrisna’s fingers tightened around the straw wrapper. “My grandmother lost siblings,” he said quietly.\n\nSamantha nodded quickly. “Ah, so it was that time,” she said, and she kept going. “What exactly happened to them? Where were they taken?”\n\nChankrisna stared at the coffee cup and answered in short phrases. Samantha kept asking, “And then what?” until Chankrisna finally said, “Can we stop?”\n\nSamantha said, “Okay,” and glanced at her phone, then asked the barista for the Wi-Fi password while Chankrisna looked out through the window at motorbikes passing by."
      }
    }
  },
  {
    "id": "10",
    "category": "Rites",
    "full_action": "In a mourning-related context, the attendee avoids using white gift wrap or white-presented offerings and follows the family’s guidance on appropriate colors.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Bunthoeun Chan",
        "story": "Bunthoeun travelled to a family home in Kampong Cham for a mourning visit. Before leaving Phnom Penh, he stopped at a small market stall to buy incense, candles, and an envelope contribution. The vendor offered bright white wrapping paper for the items.\n\nBunthoeun shook his head and said, “Not that one.” He chose a neutral brown paper and a dark ribbon instead. At home, he placed the incense and candles inside the brown paper, then put the envelope in a plain folder.\n\nWhen he arrived, relatives sat under a canopy in the yard, and a table held offerings. Bunthoeun greeted the eldest aunt first and asked quietly, “Where should I place these?”\n\nThe aunt pointed to the side table. “There,” she said.\n\nBunthoeun walked over and set the wrapped items down carefully. He kept his voice low, saying to the family member nearest him, “I’m sorry for your loss.”\n\nA cousin adjusted the arrangement and said, “Thank you.”\n\nBunthoeun followed the flow of the household. When someone handed him incense, he held it with both hands, waited for the cue, and placed it where indicated.\n\nHe sat on a mat near the back and listened while the older relatives spoke softly. When tea was offered, he accepted it and set it down without clinking the cup loudly.\n\nBefore leaving, Bunthoeun asked the aunt again, “Is there anything you need from the market?” and when she shook her head, he pressed his palms together, bowed slightly, and walked out through the gate as motorbikes passed on the dusty road."
      }
    },
    "non_action": "At a mourning event, the attendee brings items wrapped in bright white and treats the setting casually while ignoring bereavement norms.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Jake Thompson",
        "story": "Jake went with a friend to a mourning gathering in Phnom Penh and stopped at a convenience shop on the way. He bought snacks and a small bouquet, and the cashier wrapped everything in bright white paper with a shiny white bow.\n\nAt the house, Jake walked in smiling broadly and said, “Hey everyone,” in a loud voice. People were seated quietly on mats, and an older woman looked up from the offering table.\n\nJake held up the white-wrapped bundle and joked, “I didn’t know what to get, so I got whatever,” then laughed. He placed the bright white package on the main table without asking where it should go.\n\nA relative approached and shifted the package to the side. Jake didn’t notice and kept talking. “So, what are we eating after this?” he asked.\n\nHis friend whispered, “Keep it down,” but Jake shrugged. “It’s fine,” he said.\n\nHe pulled out his phone and started scrolling, then showed a meme to the person next to him and chuckled. A few people stared at the floor.\n\nJake leaned back and stretched his legs out into the walkway. When someone walked past carrying incense, they stepped around his feet.\n\nJake took a selfie in the yard with the canopy behind him and posted it, then came back inside and said, “Let’s finish quickly, I have plans later,” while the family continued sitting quietly."
      }
    },
    "principled_action": "Because the attendee could not change packaging in time, the attendee respectfully covers the white wrapping with a neutral outer layer and apologizes for the limitation while focusing attention on condolences.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Maly Soth",
        "story": "Maly left work late in Phnom Penh after hearing that a neighbor’s father had passed away. She stopped quickly at a shop near her apartment and bought incense and an envelope contribution. The shopkeeper had already wrapped the incense in plain white paper before she could say anything.\n\nMaly looked at it, then bought a brown shopping bag and asked for a spare sheet of kraft paper. Outside the shop, she folded the kraft paper around the white-wrapped incense and secured it with tape from her purse, then slid the bundle into the brown bag.\n\nAt the neighbor’s house, Maly met the daughter, Sothy, near the gate. Maly held the bag with both hands and said softly, “I’m sorry for your loss.”\n\nSothy nodded. “Thank you for coming.”\n\nMaly added, “I bought this in a hurry, and it was wrapped already, so I covered it,” and she kept her voice low. She didn’t linger on the explanation.\n\nSothy pointed to a side table. Maly placed the bag there and handed the envelope to Sothy’s aunt.\n\nInside, Maly sat on the mat near the wall. When incense was passed around, she accepted it with both hands and followed the cue of the family members nearby.\n\nAn older woman wiped her eyes with a cloth. Maly kept her hands in her lap and looked down while the chanting continued.\n\nAfter a while, Maly stood, pressed her palms together toward the family, and stepped backward out of the room, then turned and walked quietly toward the gate."
      }
    },
    "surface_action": "The attendee avoids white packaging, but talks cheerfully about unrelated celebrations during the mourning visit, reducing the emotional appropriateness despite correct colors.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Vanna Chey",
        "story": "Vanna visited a mourning home in Takeo carrying an envelope and a small bundle of incense wrapped in brown paper. He had chosen the wrapping carefully and held it with both hands as he entered the yard under the canopy.\n\nHe greeted the family quietly at first. “I’m sorry for your loss,” he said, and he placed the brown-wrapped bundle on the table where a cousin pointed.\n\nAfter sitting down on a mat, Vanna started talking in a brighter voice than the people around him. “Next week we have a wedding in my wife’s family,” he said, smiling. “We already booked the music, and the dress is beautiful.”\n\nA relative glanced toward him, then looked away.\n\nVanna continued, “And for New Year, we’re planning a big trip. Maybe a hotel with a pool,” he said, moving his hands as he described it.\n\nSomeone nearby adjusted the incense bowl and stayed quiet. Vanna leaned toward an older aunt and said, “You should come to the wedding, it will be fun,” still smiling.\n\nThe aunt didn’t answer and looked down at her hands.\n\nWhen tea was offered, Vanna accepted it and said, “Thank you,” then added, “At the wedding we’ll have so much food,” and chuckled softly.\n\nA monk’s chanting began again, and Vanna lowered his cup to the mat and looked around, then took out his phone and typed a message about the wedding venue while the room remained quiet."
      }
    }
  }
]