[
  {
    "id": "1",
    "category": "Interaction",
    "full_action": "If a Lao person comments bluntly about body shape, the visitor stays composed, does not treat it as a personal attack, and avoids making similar comments in return.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Rachel Morgan",
        "story": "Rachel visited a small family-run textile shop in Vientiane where the owner, Auntie Sone, had been chatting with her for a few days. When Rachel walked in, Sone looked her up and down and said in English, “You… a bit bigger now,” while patting her own stomach as a gesture.\n\nRachel blinked, then kept her face relaxed. “Oh,” she said, and gave a small smile.\n\nSone continued, “Eat good in Laos!” and laughed, motioning toward a plate of sticky rice on the table.\n\nRachel nodded. “Yes, I’ve been eating a lot of sticky rice,” she replied, keeping her tone even.\n\nSone brought out two scarves. “This color good for you,” she said.\n\nRachel touched the fabric and said, “It’s beautiful. The weave feels strong.” She didn’t comment on Sone’s body or anyone else’s.\n\nSone held the scarf near Rachel’s shoulder. “Maybe size bigger,” she said, gesturing to a looser wrap.\n\nRachel answered, “Okay, we can try the bigger one,” and stepped closer to the mirror.\n\nSone adjusted the scarf, and Rachel watched the reflection.\n\nRachel said, “Thank you for helping,” then asked, “How long does it take to make one like this?”\n\nSone began describing the process, and Rachel listened, nodding, while scooters buzzed past outside the open shop door."
      }
    },
    "non_action": "If a Lao person comments bluntly about body shape, the visitor responds angrily, insults the person back, and escalates the exchange in public.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Kevin Doyle",
        "story": "Kevin stood in a small restaurant in Vientiane waiting for his order when the cashier looked at him and said in English, “You fat,” then laughed lightly and patted her own cheek.\n\nKevin’s face tightened. “Excuse me?” he said, voice rising.\n\nThe cashier repeated, “Fat,” and smiled.\n\nKevin snapped, “That’s insulting. Look at you—don’t talk about my body,” he said, pointing at her and then sweeping his hand at her waist.\n\nA couple at a nearby table glanced over.\n\nThe cashier’s smile dropped. She said something in Lao to a coworker.\n\nKevin stepped closer to the counter. “You’re rude. You should apologize right now,” he said loudly.\n\nThe coworker approached and asked, “Problem?”\n\nKevin waved his receipt. “Yes, problem. She called me fat. That’s disgusting,” he said.\n\nThe cashier looked down at the counter and didn’t respond.\n\nKevin continued, “I’m not giving you my money if you’re going to insult customers. In my country, you’d be fired for that,” he said.\n\nThe coworker gestured for Kevin to step aside, but Kevin stayed at the counter, still speaking loudly. “Tell her to say sorry,” he repeated.\n\nThe line behind him stopped, and a man holding a takeout bag shifted his feet while Kevin kept arguing at the cashier window."
      }
    },
    "principled_action": "Because the visitor feels uncomfortable, the visitor redirects the topic gently and continues the interaction politely without personal counterremarks.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Anita Verma",
        "story": "Anita was browsing at a small market stall in Luang Prabang when the vendor, a middle-aged woman, smiled and said in English, “You chubby. Cute,” then made a pinching gesture at her own cheek.\n\nAnita’s shoulders tightened slightly, but she kept her voice calm. “Ah,” she said, then looked back at the items on the table.\n\nShe picked up a small bamboo basket and asked, “This one—how much?”\n\nThe vendor held up three fingers and said a price.\n\nAnita nodded and continued, “Do you make these here, or from another village?” She leaned closer to examine the pattern, focusing on the basket.\n\nThe vendor answered, “My sister make. From nearby.”\n\nAnita smiled. “It’s very neat,” she said, tracing the weave lightly with her fingertip.\n\nThe vendor tried again, “You eat a lot?” and laughed.\n\nAnita gave a small smile and redirected. “I’ve been trying different food, yes. What is your favorite dish in Luang Prabang?” she asked.\n\nThe vendor’s expression shifted to thinking, and she started listing foods, pointing toward a street of stalls.\n\nAnita listened and nodded, then said, “I’ll take this basket,” and handed over the cash.\n\nThe vendor placed it in a bag, and Anita said, “Khob chai,” then stepped back to make room for the next customer."
      }
    },
    "surface_action": "The visitor smiles and says it is fine, but then makes a similar body comment about someone else, which contradicts the respectful restraint.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Tom Whitaker",
        "story": "Tom was invited to a small dinner in Vientiane by a Lao coworker, Mali. As Tom walked in, Mali’s aunt looked at him and said in English, “You bigger!” and laughed, pressing her hands outward to indicate size.\n\nTom smiled quickly. “Haha, it’s fine,” he said, raising both palms like he wasn’t bothered.\n\nThey sat on a porch with bowls of soup and sticky rice. Tom kept eating and nodded when Mali explained dishes.\n\nA few minutes later, another guest arrived, a quiet man with a round belly. Tom leaned toward Mali and whispered with a grin, “Wow, that guy is really big. Bigger than me,” and he motioned with his hands.\n\nMali glanced at Tom, then at the man, and didn’t respond.\n\nTom continued, still smiling, “Maybe he eats even more than you guys,” he said under his breath.\n\nMali’s aunt called everyone to start eating. Tom said, “Khob chai,” and took a spoonful.\n\nAcross the table, the man poured soup into a bowl and looked down at his food.\n\nTom reached for more sticky rice and said lightly to Mali, “At least I’m not the biggest one here,” then laughed softly and kept chewing.\n\nMali adjusted her bowl and said, “Please pass the herbs,” and Tom slid the plate toward her while still smiling."
      }
    }
  },
  {
    "id": "2",
    "category": "Embodiment",
    "full_action": "When floor-seated with others, the visitor follows local posture norms by sitting cross-legged or tucking legs appropriately to match the group’s style.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Sengphet Phanthachak",
        "story": "Sengphet joined a small evening gathering at a friend’s home in Vientiane. Shoes were left near the entrance, and everyone sat on woven mats around a low tray with tea, sticky rice, and small dishes of grilled fish. Most people sat cross-legged or with legs tucked neatly to one side.\n\nSengphet entered, nodded, and chose an open spot near the group. He lowered himself onto a cushion and folded his legs cross-legged, adjusting the hem of his trousers so his feet stayed tucked in close. When he shifted his weight, he mirrored the posture of the person beside him, keeping his knees in and his soles tucked away.\n\nA friend said, “Sit here,” and patted the mat closer to the tray. Sengphet shuffled forward on the cushion, staying in the same cross-legged position instead of stretching his legs out.\n\nAs tea cups were passed, Sengphet accepted his cup with both hands and set it down near his knee. He kept his posture steady while leaning forward slightly to take a piece of fish, then returned his hands to his lap.\n\nSomeone told a story and everyone laughed. Sengphet leaned back, still cross-legged, and rested his hands on his knees. When a child ran through, he lifted his knees slightly to make space without changing into a stretched posture.\n\nLater, when the group rearranged the tray for dinner, Sengphet tucked his feet tighter under his thighs and scooted back a little to match the new circle, then sat still as the bowls were placed."
      }
    },
    "non_action": "When floor-seated with others, the visitor lounges with legs spread out toward others and treats local posture as unimportant.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Mark Soukhavong",
        "story": "Mark visited a friend’s home in Savannakhet for a relaxed evening snack. The family sat on mats around a low tray with tea and sticky rice. Everyone else folded their legs neatly, making a compact circle.\n\nMark dropped onto the mat and leaned back on one elbow, spreading his legs wide. One leg stretched straight toward an older relative, and the other pointed toward the tray. He flexed his feet and let his soles face outward as he adjusted.\n\nHis friend whispered, “Maybe tuck your legs,” demonstrating a cross-legged posture. Mark shrugged. “I’m comfortable,” he said, leaving his legs where they were.\n\nWhen someone passed a bowl, they had to reach over Mark’s shin. The bowl hovered above his leg for a moment as the passer searched for space. Mark didn’t move; he looked at his phone and laughed at a message.\n\nA child tried to sit near the tray but stopped when Mark’s foot blocked the spot. Mark waved the child away with his hand and said, “Sit over there.”\n\nThe host’s aunt shifted her mat slightly farther back. Mark stretched even more, letting his heel rest close to the tray edge. “It’s just sitting,” he said, as if answering a complaint no one voiced directly.\n\nWhen tea was poured, Mark’s ankle bumped the tray and made the cups wobble. He chuckled, adjusted nothing, and grabbed a snack, chewing while his legs remained spread across the shared space."
      }
    },
    "principled_action": "Because of limited flexibility, the visitor chooses the closest respectful posture possible and keeps their legs oriented away from others.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Vannida Keovongsa",
        "story": "Vannida joined a small house visit in Pakse after a long day of travel. The group sat on mats around a low tray with tea and fruit. Vannida’s hips were stiff, and crossing her legs fully was difficult. She watched how others sat—mostly cross-legged or tucked to the side.\n\nShe lowered herself onto a cushion and tried to fold into a cross-legged posture, but her knee resisted. She adjusted into a side-tuck position, bringing both feet behind her and angling her toes toward the wall. Her soles stayed turned away from the circle.\n\n“Sorry, I’m not flexible,” Vannida said softly to the host as she shifted.\n\nThe host nodded and slid a cushion closer. Vannida placed it under her hip for support and kept her knees close together. When she leaned forward to take a cup, she did it with her hands and torso, not by extending her legs.\n\nA friend beside her repositioned slightly, and Vannida mirrored the shift by scooting on the cushion, keeping her feet tucked behind. When a bowl was passed across the circle, Vannida lifted her heels a little to open a path without pointing her soles at anyone.\n\nAs conversation continued, she maintained the tucked posture, occasionally adjusting the fabric at her ankles so her feet stayed angled toward the empty corner.\n\nWhen the group stood for dinner, Vannida placed her hands on the mat, rose carefully, and stepped away from the seating area without swinging her legs toward anyone."
      }
    },
    "surface_action": "The visitor follows posture norms, but uses the moment to draw attention to themselves and disrupt the shared calm.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Somsak Thammavong",
        "story": "Somsak joined a tea gathering in a home in Luang Prabang where everyone sat on mats in a quiet circle. Shoes were stacked by the door, and a low tray held cups and small dishes. Somsak sat down cross-legged like the others, tucking his feet in close and keeping his posture compact.\n\nAfter a moment, he clapped his hands once and said loudly, “Look, I can sit like you!” He rocked slightly side to side while staying cross-legged, grinning at the group. A few people glanced up from their cups.\n\nHe leaned forward, still in the correct posture, and posed with his hands on his knees as if someone were taking a picture. “Take a photo,” he told a friend, lifting his chin.\n\nThe friend smiled faintly and didn’t move. Somsak kept sitting cross-legged but began exaggerating the position, pulling his feet tighter under him and saying, “This is the real way,” as if performing. He scooted closer to the tray, still cross-legged, then scooted back again, making the cups rattle slightly.\n\nAn older relative continued pouring tea without looking at him. Somsak laughed and whispered stage-like, “I’m so traditional,” then raised his hands as if presenting himself.\n\nWhen the host started speaking softly, Somsak interrupted with another comment about how long he could hold the posture. “Watch,” he said, still cross-legged, and began bouncing his knees lightly.\n\nA cup near the tray edge tipped slightly, and the host reached out to steady it with a calm hand while Somsak kept smiling at the group."
      }
    }
  },
  {
    "id": "3",
    "category": "Dining",
    "full_action": "When using spoon and fork together, the diner holds the fork in the left hand and the spoon in the right hand and uses them as practiced locally.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Vixay Sihalath",
        "story": "Vixay ate lunch at a small noodle-and-rice shop near the bus station in Vientiane with two coworkers. They ordered plates of rice with grilled pork and vegetables. The shop set out spoons and forks in a metal cup.\n\nWhen the food arrived, Vixay picked up the fork with his left hand and the spoon with his right. He used the fork to push small portions of rice and vegetables onto the spoon, then brought the spoon to his mouth. His elbows stayed close to his body, and he kept the utensils low over the plate.\n\nA coworker asked, “How’s the sauce?” Vixay nodded while chewing and used the spoon to take a little sauce, guiding it with the fork so it didn’t spill. He continued eating with the same rhythm, fork guiding, spoon lifting.\n\nWhen the grilled pork pieces were shared, he used the fork in his left hand to hold a piece steady and the spoon to scoop rice alongside it. A server came by with more water and set a glass near the edge; Vixay shifted his plate slightly inward and kept eating.\n\nHis coworker reached across for the chili jar. Vixay passed it with his right hand, then returned the spoon to his right grip and continued.\n\nAs the lunch crowd grew louder, Vixay maintained the same utensil arrangement, finishing his plate without swapping hands. He placed the fork and spoon together on the plate when he paused to wipe his mouth, then picked them up again in the same pattern and took the final bites."
      }
    },
    "non_action": "When using spoon and fork together, the diner ignores the local pattern, eats messily, and dismisses guidance from others.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Leo Xayavong",
        "story": "Leo ate at a small family restaurant in Luang Prabang with friends. The plates came with rice, stir-fried vegetables, and grilled meat. A cup held spoons and forks. Leo grabbed both utensils and immediately began switching them around.\n\nHe held the spoon in his left hand and the fork in his right, stabbing at rice with the fork and trying to scoop it awkwardly with the spoon. Rice spilled onto the table. He laughed and kept going.\n\nA friend said softly, “Spoon right, fork left,” and demonstrated. Leo waved him off. “Doesn’t matter,” he said, continuing to scrape rice toward the edge of the plate. He used the fork to fling a piece of meat onto his spoon, and sauce dripped down to the table cover.\n\nWhen the friend repeated the suggestion, Leo said, “Stop telling me how to eat,” and kept eating with messy motions, clinking utensils loudly.\n\nHe used the fork to point at a dish across the table while holding the spoon over his plate, then dragged the fork through rice again, scattering grains. A server placed a small bowl of soup near him; Leo nearly knocked it with his elbow.\n\nHe scooped a mouthful with the spoon, then switched hands again mid-bite, holding the spoon in his right for a second and then back to his left. His friend handed him a napkin. Leo wiped his mouth with the back of his hand and said, “I’m fine,” leaving the napkin unused.\n\nBy the time he finished, the table around his plate had scattered rice and droplets of sauce, and he pushed the utensils aside with a shrug."
      }
    },
    "principled_action": "Because the diner is left-handed or has an injury, the diner eats neatly in the most comfortable way and keeps shared etiquette considerate.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Souphaphone Chanthavong",
        "story": "Souphaphone ate dinner with relatives in Pakse at a small open-air restaurant. Rice plates were served with grilled fish and vegetables, and spoons and forks were placed at each setting. Souphaphone was left-handed and felt more stable using the spoon in her left.\n\nShe picked up the spoon with her left hand and the fork with her right, then began eating neatly. She used the fork to guide rice onto the spoon, keeping the spoon close to the plate so nothing spilled. When she took a bite, she kept her fork still and waited before speaking.\n\nHer aunt looked at the utensils and then continued talking. Souphaphone listened and nodded, maintaining the same careful movements. When a serving plate was passed, Souphaphone set her fork and spoon down, used both hands to accept the plate, and then returned to her comfortable grip.\n\nA cousin asked for the chili jar. Souphaphone passed it with her right hand, then resumed eating without changing her pace. She dabbed her mouth with a napkin and kept her elbows tucked in so she didn’t bump anyone seated close.\n\nWhen fish bones needed to be moved aside, she used the fork in her right to lift them onto the edge of the plate and continued with small bites. She didn’t comment on her utensil choice and didn’t gesture with them while talking.\n\nAs the meal ended, she placed the spoon and fork together on the plate, thanked the host quietly, and helped carry a stack of empty bowls to the counter."
      }
    },
    "surface_action": "The diner holds utensils in the local arrangement, but then uses them to point at others while talking, undermining politeness.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Bounchanh Sengthong",
        "story": "Bounchanh ate lunch with coworkers in Vientiane at a busy rice shop. He held the fork in his left hand and the spoon in his right, eating rice and vegetables by pushing food onto the spoon as others did.\n\nAs soon as the conversation turned to office schedules, Bounchanh began talking with his mouth half full. He lifted the spoon in his right hand and pointed it toward a coworker across the table. “You,” he said, the spoon hovering in the air. The coworker leaned back slightly to avoid the gesture.\n\nBounchanh kept the utensil arrangement but continued using them like pointers. He tapped the fork in his left hand toward another coworker’s plate. “And you forgot the form,” he said, fork angled across the table.\n\nSomeone said, “Eat first,” and Bounchanh laughed. He scooped another bite with the spoon, then lifted the spoon again to emphasize a point, gesturing close to a shared dish. A drop of sauce slid off the spoon back onto his plate.\n\nWhen the chili jar was passed, Bounchanh held it with his right hand, then immediately resumed pointing with the spoon while he spoke. The person beside him watched the spoon move back and forth.\n\nA coworker tried to change the topic, but Bounchanh kept gesturing with the fork and spoon, alternating them as he spoke. He still ate with fork left and spoon right, but he repeatedly aimed the spoon at faces during the discussion.\n\nWhen the plates were nearly finished, he set the spoon down for a moment, then picked it up again and pointed it at the cashier to signal for the bill."
      }
    }
  },
  {
    "id": "4",
    "category": "Belief",
    "full_action": "In any setting, the visitor treats Buddhist statues and iconography respectfully and avoids touching, mocking, or posing with them in disrespectful ways.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Somsanith Chansy",
        "story": "Somsanith met a friend at Wat Si Saket in Vientiane on a clear morning. At the gate, he lowered his voice and walked slowly across the courtyard. Rows of small Buddha images lined the cloister walls, and visitors moved quietly between the columns.\n\nHis friend lifted a phone and said, “Let’s take a picture with that statue.”\n\nSomsanith shook his head and replied, “We can take a photo of it, but not like that.” He stepped back so he wasn’t standing too close and kept his hands at his sides.\n\nA tourist nearby leaned toward a statue, reaching as if to touch the surface. Somsanith did not intervene, but he shifted his own path away and stayed behind a rope line.\n\nInside the main hall, he kept his feet tucked under him when he sat briefly on a bench, making sure his soles didn’t point toward the altar. He did not climb onto any platform, and he avoided turning his back directly to the central image while taking photos.\n\nWhen his friend joked, “That one looks funny,” Somsanith replied, “Let’s just look,” and changed the subject by pointing out the murals on the wall.\n\nBefore leaving, he paused at the doorway, placed his phone back in his pocket, and walked out through the courtyard without stepping over any offerings placed near the base of the statues."
      }
    },
    "non_action": "In any setting, the visitor jokes about Buddhist images, handles statues casually, or poses in a disrespectful manner for entertainment.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Zoe Ramirez",
        "story": "Zoe visited a temple in Luang Prabang with friends and walked straight toward a line of small Buddha statues near the entrance. She pulled out her phone and said, “These are cute,” then laughed.\n\nShe stepped up onto the platform and crouched beside one statue. “Take my picture,” she told her friend, wrapping an arm around the statue’s base. She tilted her head and made a peace sign.\n\nA caretaker nearby looked up and said something in a low voice. Zoe waved and said, “It’s fine,” then picked up a small decorative figurine from a shelf to show her friends. “Look, this one’s tiny,” she said, turning it in her hands.\n\nHer friend said, “Maybe don’t touch.”\n\nZoe shrugged and set it back quickly, not aligning it with the others. She walked to another statue and posed again, pressing her cheek close and laughing for the camera.\n\nInside, she pointed at a mural and joked, “That guy’s face,” then imitated it for her friends. She raised her voice and echoed her own laughter in the hall.\n\nWhen they exited, Zoe stepped backward while filming herself and bumped lightly into a donation box. She giggled, then said, “This place is like a museum,” and kept recording as they walked away."
      }
    },
    "principled_action": "Because the visitor is unsure what is permitted, the visitor asks quietly about the proper distance and behavior and follows guidance carefully.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Ketsana Phouthavong",
        "story": "Ketsana visited Wat Phra That Luang in Vientiane with a coworker from another province. At the entrance, she noticed signs in Lao and English and saw visitors moving around the main stupa. She wasn’t sure where photos were allowed or how close people should stand to smaller shrines.\n\nShe approached a temple volunteer standing near a rope line and asked in a low voice, “Excuse me, is it okay to take pictures here, and how close should we stand?”\n\nThe volunteer pointed to a marked area and said, “You can take photos from here. Please don’t step onto the platform or touch the statues.”\n\nKetsana nodded. “Khob chai,” she said. She stayed behind the rope line and held her phone at chest height rather than extending it over offerings.\n\nWhen her coworker stepped forward toward a small statue to get a closer shot, Ketsana touched her coworker’s sleeve lightly and said, “From here,” indicating the line.\n\nInside a hall, she looked for a place to stand that didn’t block people kneeling. She waited until a group finished, then moved quietly along the wall.\n\nAt one point she almost stepped over a small tray of flowers, saw it, and shifted her foot back, going around it instead. She kept her hands off the railing around the shrine and followed the volunteer’s path back to the courtyard.\n\nBefore leaving, she turned her phone off, tucked it into her bag, and walked out through the gate at a slow pace."
      }
    },
    "surface_action": "The visitor behaves correctly around statues, but then makes dismissive comments to companions afterward, weakening the respect.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Peter Lang",
        "story": "Peter toured a temple complex in Luang Prabang with two friends. Inside the hall, he kept his hands to himself, stayed behind the rope line, and took photos without getting close to the statues. When one friend leaned forward to touch a small image, Peter whispered, “Don’t,” and the friend pulled back.\n\nPeter moved quietly, stepping around offerings and keeping his voice low. He didn’t pose next to any statue and didn’t climb onto the platform for a better angle.\n\nAfter they left the temple grounds and reached a café across the street, Peter dropped into a chair and exhaled. “Okay, we did the whole careful thing,” he said, taking a drink.\n\nOne friend asked, “What did you think?”\n\nPeter shrugged and said, “It’s just statues, honestly. People take it so seriously.” He stirred his iced coffee and added, “Inside I kept quiet because you have to, but it’s kind of over the top.”\n\nHis friend looked down at the menu and didn’t respond. Peter continued, “I mean, the rules are rules,” and scrolled through the photos on his phone.\n\nHe showed one picture and said, “At least it looks nice,” then laughed lightly and ordered another drink from the counter.\n\nWhen the server brought the drinks, Peter slid his phone back into his pocket and reached for his straw."
      }
    }
  },
  {
    "id": "5",
    "category": "Kinship",
    "full_action": "Before visiting a home, the visitor coordinates in advance, and in rural contexts allows the household to announce the visit through appropriate channels if used locally.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Thipphavanh Khamphoukeo",
        "story": "Thipphavanh planned to visit her uncle’s family in a village outside Xieng Khouang while she was in town for a few days. Two days before, she called her cousin in the evening.\n\n“Are you free on Saturday after lunch?” she asked.\n\nHer cousin replied, “Yes, after one is good.”\n\nThipphavanh added, “If it’s easier, you can let the family know through the village speaker. I don’t want to surprise anyone.”\n\nHer cousin laughed lightly. “Okay, I’ll tell my mom, and the village head will announce visitors tomorrow.”\n\nOn Saturday, Thipphavanh arrived at the bus stop and took a tuk-tuk to the village. As she walked down the lane, she heard a speaker announcement in the distance and saw neighbors sweeping their yards.\n\nAt her uncle’s gate, she called out, “Sabaidee,” and waited. Her aunt came out smiling. “We heard you were coming,” she said.\n\nThipphavanh removed her sandals at the steps and said, “Thanks for arranging.” She handed over a small bag of mandarins.\n\nInside, she sat with the family while her aunt finished boiling water. Neighbors who recognized her waved from the fence.\n\nLater, her cousin said, “People know you’re here, so they may stop by,” and Thipphavanh nodded, moving her bag closer to the wall to make space.\n\nWhen a neighbor arrived, her aunt stood to greet them, and Thipphavanh shifted to pour tea into extra cups."
      }
    },
    "non_action": "Before visiting a home, the visitor arrives unannounced and expects to be received immediately regardless of the family’s schedule.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Kyle Bennett",
        "story": "Kyle rode a rented motorbike to a village near Vang Vieng to see a friend’s family. He hadn’t called or messaged ahead. He arrived at midday and walked straight into the yard, calling out, “Hello?”\n\nA woman was hanging laundry and looked up, surprised. She said something toward the house.\n\nKyle stepped onto the porch without waiting. “Is my friend here?” he asked.\n\nThe woman replied, “He’s out,” and gestured toward the fields.\n\nKyle frowned. “Well, tell him I’m here. I’ll wait inside,” he said, and tried the door.\n\nThe woman moved quickly and stood between Kyle and the doorway. “We are busy,” she said.\n\nKyle waved his hand. “It’s fine, I came all the way. Someone can make tea,” he insisted.\n\nA man came out from the back, wiping his hands, and looked at Kyle. “Who are you?” he asked.\n\nKyle said, “I’m his friend,” and pointed down the road. “I need a place to sit. It’s hot.” He dropped his helmet on a bench.\n\nThe man said something to the woman, and she went back toward the house. Kyle sat down and called out again, “Hey, anyone home?” while people inside moved quickly, voices low.\n\nAfter a few minutes, Kyle stood and said, “So are we eating or what?” and walked toward the kitchen area as the woman carried a pot of water past him without looking up."
      }
    },
    "principled_action": "Because the visit is time-sensitive, the visitor calls ahead as early as possible, asks if it is convenient, and accepts rescheduling if needed.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Bounthan Xayavong",
        "story": "Bounthan needed to stop by his aunt’s home in Vientiane to deliver a document she needed for a bank appointment. He realized the bank deadline was the next day, so he called early in the morning.\n\n“Auntie, are you free today? I can come by with the paper,” he said.\n\nHis aunt replied, “I have work until late afternoon.”\n\nBounthan answered, “No problem. Is it convenient after five? If not, I can come tomorrow morning instead.”\n\nShe thought for a moment and said, “Come at six. We will be home.”\n\nAt 5:50, Bounthan sent a message: “I’m on the way.” When he arrived, he waited at the gate and called out, “Sabaidee.” His aunt opened the door and waved him in.\n\nBounthan removed his shoes and held the envelope out with his right hand, supporting his elbow with the left. “Here it is,” he said.\n\nHis aunt looked at the paper and nodded. “Good, thank you.”\n\nShe offered water. Bounthan accepted one small sip and said, “I can’t stay long, I have another errand.”\n\nHis aunt said, “Okay, sit one minute.”\n\nBounthan sat briefly, asked, “How is Uncle?” and listened while she answered.\n\nAt 6:10, he stood, pressed his palms together lightly, and said, “I’ll go now. If you need anything else, call me.” He stepped out and closed the gate behind him."
      }
    },
    "surface_action": "The visitor arranges the visit in advance, but then shows up at an inconvenient time and acts as if the family should accommodate them.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Soukanh Phimmavong",
        "story": "Soukanh messaged her cousin in Pakse during the week and wrote, “I’ll visit Sunday.” Her cousin replied, “Come after lunch, around two.” Soukanh sent a thumbs-up.\n\nOn Sunday, Soukanh finished errands early and decided to go sooner. She arrived at 11:15, before the family had eaten. She called from the gate, “Sabaidee!” and walked in when the cousin waved.\n\nHer cousin’s mother was stirring a pot in the kitchen and said, “We’re cooking now.”\n\nSoukanh smiled and said, “It’s fine, I’m here already.” She stepped inside and sat down, then asked, “So what are we eating? I’m hungry.”\n\nHer cousin whispered, “We said after lunch.”\n\nSoukanh shrugged. “Plans change,” she replied, taking out her phone and setting it on the table. “Just make a little extra for me.”\n\nThe mother moved past carrying bowls and didn’t answer. Soukanh called out, “Do you have tea? I’ve been traveling.”\n\nHer cousin brought water in a glass. Soukanh took a sip and said, “I arranged this visit, so I thought you’d be ready.”\n\nAs the family continued cooking, Soukanh stayed seated and said, “Don’t worry, I can wait,” while tapping her fingers on the tabletop and watching the kitchen doorway."
      }
    }
  },
  {
    "id": "6",
    "category": "Exchange",
    "full_action": "For a routine home visit, the visitor does not treat a gift as required, but if it is a first visit or a birthday or wedding, the visitor brings a small gift to show thoughtfulness.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Sivilay Xangkhamsavath",
        "story": "Sivilay was invited to her coworker May’s home in Vientiane for the first time, and it also happened to be May’s father’s birthday dinner. For routine drop-ins with neighbors, Sivilay usually just brought herself, but this time she stopped at a small market stall.\n\nShe chose a modest fruit basket and a small box of sweets, then asked the vendor to tie it with a simple ribbon. She took a tuk-tuk to May’s house and arrived just after dusk.\n\nAt the gate, May greeted her. “Come in!”\n\nSivilay removed her sandals at the doorway and held the fruit basket out with her right hand while supporting her elbow with the left. “This is a small thing for your family,” she said.\n\nMay smiled. “Thank you.”\n\nInside, May’s father sat near a low table. Sivilay approached, nodded, and said, “Happy birthday,” then placed the gift basket on the side table where May pointed.\n\nDuring dinner, she joined the group conversation and waited for others to begin before taking food. When May’s aunt offered her a second portion, Sivilay accepted a small amount and said, “Khob chai.”\n\nAs the family began cutting a small cake, May’s father gestured to Sivilay to take a slice. Sivilay took a small piece and sat back down, holding the plate with both hands."
      }
    },
    "non_action": "For a first visit or a celebration, the visitor shows up empty-handed and dismisses the occasion as unimportant to the hosts.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Noah Grady",
        "story": "Noah visited his girlfriend’s family in Vientiane for the first time on the evening of her sister’s engagement celebration. He arrived with nothing in his hands and walked in smiling.\n\nAt the doorway, someone said, “Come in,” and Noah stepped inside without pausing. When he saw food arranged and people dressed nicely, he asked, “What’s going on?”\n\nHis girlfriend whispered, “It’s my sister’s engagement.”\n\nNoah shrugged. “Oh. It’s not a big deal,” he said, loud enough for a nearby aunt to hear.\n\nAn uncle offered him a cup of tea. Noah waved it away. “I’m good,” he said, dropping onto a chair. “So, where’s dinner?”\n\nHis girlfriend’s mother placed snacks on the table and said, “Please eat.”\n\nNoah looked at the snacks and said, “I didn’t bring anything because I didn’t know I had to. It’s just a family thing.”\n\nThe mother’s hands paused as she set down plates. Noah continued, “Back home, people don’t make a fuss.” He reached for a piece of food and started eating.\n\nWhen the engaged couple came into the room, Noah nodded once and said, “Congrats,” then asked his girlfriend, “Do we have to stay long?” while the family began arranging seats for a photo."
      }
    },
    "principled_action": "Because the visitor could not shop beforehand, the visitor brings a modest token from what they have or offers to send something later with sincere thanks.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Douangdeuane Phommasone",
        "story": "Douangdeuane got invited to a colleague’s wedding blessing in Vientiane on short notice. By the time she finished work, most shops were closed, and she didn’t want to arrive empty-handed.\n\nAt home, she looked through her kitchen cabinet and found a sealed tin of tea she had received earlier in the month. She wiped the tin with a cloth, placed it in a clean bag, and wrote a small note on a plain card: “Wishing you happiness.”\n\nAt the wedding house, strings for the baci ceremony were laid out on a table, and guests were arriving. Douangdeuane greeted the bride’s aunt at the entrance and removed her shoes.\n\nShe held the tea tin out with her right hand, supporting her elbow with the left. “I’m sorry I didn’t have time to shop, but I brought this small tea from my home,” she said.\n\nThe aunt smiled and accepted it. “Thank you, come in.”\n\nDouangdeuane added, “If you prefer something else, I can send a small gift later. Thank you for inviting me.”\n\nShe took a seat with other guests and followed the ceremony, tying a white string on the bride’s wrist when it was her turn. Afterward, she accepted one sip of water and helped pass a tray of sticky rice to the next person.\n\nWhen the couple began greeting guests, Douangdeuane stepped forward, pressed her palms together, and said, “Congratulations,” then moved aside as the next guest approached."
      }
    },
    "surface_action": "The visitor brings a small gift, but repeatedly highlights its cost and makes the gesture feel like status display.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Somboun Keomixay",
        "story": "Somboun went to a coworker’s birthday dinner in Vientiane and carried a small wrapped box. When he arrived, he removed his shoes and handed the box over using his right hand with his left supporting his elbow.\n\n“This is for you,” he said.\n\nThe coworker smiled. “Thank you.”\n\nSomboun followed him inside and continued talking. “I bought it at the new shop near the river,” he said, tapping the wrapping. “It wasn’t cheap, you know.”\n\nThe coworker placed the gift on a side table. Somboun leaned closer and said, “It’s the good brand. I could’ve gotten something cheaper, but I didn’t.”\n\nAn aunt brought out snacks. Somboun accepted one bite, then said to another guest, “I spent a lot on that gift.” He repeated the price in kip and whistled.\n\nThe birthday person laughed lightly and said, “You didn’t have to.”\n\nSomboun shook his head. “No, no, I wanted to show I can do it,” he replied, looking around the room. When someone asked what it was, Somboun answered before the recipient could. “It’s imported,” he said, smiling.\n\nAs dinner started, Somboun pointed at the gift again and said, “Make sure you use it, because it cost me,” then reached for the sticky rice basket and took a large pinch."
      }
    }
  },
  {
    "id": "7",
    "category": "Civility",
    "full_action": "When offered refreshments, the guest accepts what is offered when possible and avoids refusing repeatedly, so the host’s hospitality is acknowledged smoothly.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Chanthala Soukvilay",
        "story": "Chanthala arrived at her coworker’s home in Pakse to drop off some documents after a workshop. The late afternoon air was warm, and the house smelled of lemongrass and grilled chicken from a nearby stall.\n\nHer coworker’s mother greeted her at the doorway and said, “Come in, sit.” She gestured toward a wooden chair and a small table.\n\nChanthala sat and placed her folder on her lap. The mother returned with a glass of water and a small plate of sliced fruit. “Have some,” she said, setting it down.\n\nChanthala didn’t wave it away. She smiled and said, “Khop chai,” then picked up the glass with both hands and took a few sips.\n\nThe mother asked, “Tea also?”\n\nChanthala nodded once. “Yes, please,” she said, keeping her voice gentle. When the tea arrived in a small cup, she accepted it and set it on the table carefully.\n\nHer coworker came out from the back room and said, “Sorry, I was on a call.”\n\n“It’s okay,” Chanthala replied, taking a piece of fruit and chewing quietly.\n\nThey reviewed the documents, and when the mother refilled the tea, Chanthala lifted the cup slightly as acknowledgment. “Khop chai,” she said again.\n\nAfter a short while, Chanthala stood, thanked the mother with a small nod, and carried her empty cup to the edge of the table before stepping out to the yard where a motorbike started up on the street."
      }
    },
    "non_action": "When offered refreshments, the guest rejects the offer again and again and makes the host feel their hospitality is unwelcome.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Phoutsady Keophomma",
        "story": "Phoutsady stopped by a neighbor’s house in Savannakhet in the early evening. The host, Auntie Lien, brought out a tray with a glass of water and a small cup of tea.\n\n“Drink,” Auntie Lien said, placing the tray on the table.\n\nPhoutsady waved both hands. “No, no, no. I don’t want anything,” she said.\n\nAuntie Lien smiled and pushed the tray closer. “Just a little.”\n\nPhoutsady leaned back and shook her head hard. “No, no. I’m not thirsty,” she insisted, then added, “I don’t like tea anyway.”\n\nAuntie Lien paused, then tried again. “Fruit?” she asked, holding up a plate of banana slices.\n\n“No,” Phoutsady said quickly. “I’m fine. Really. Don’t bother.”\n\nAuntie Lien set the plate down slowly. “Okay,” she said, and sat with her hands on her knees.\n\nPhoutsady kept talking about why she had come, but each time the host offered something—water, tea, fruit—Phoutsady cut in with another refusal.\n\nAuntie Lien’s daughter walked through and glanced at the untouched tray. Auntie Lien picked it up and carried it back toward the kitchen without speaking.\n\nPhoutsady continued speaking from her chair, still empty-handed, while the kitchen door swung shut and the clink of cups sounded faintly from inside."
      }
    },
    "principled_action": "Because of dietary or medical restrictions, the guest thanks the host and accepts a safe alternative or a symbolic sip to honor the gesture.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Siphaphone Vannasouk",
        "story": "Siphaphone visited her aunt’s home in Vientiane after a morning appointment. She had been told to avoid sugary drinks for the next few weeks, and she carried a small bottle of water in her bag.\n\nHer aunt greeted her warmly and brought out a glass filled with a sweet herbal drink. “Here, drink,” her aunt said, setting it in front of her.\n\nSiphaphone smiled and placed her hands together around the glass without lifting it yet. “Khop chai,” she said. “Today I can’t have sweet drinks because of my doctor.”\n\nHer aunt paused. “Oh. Then what can you drink?”\n\n“Plain water is okay,” Siphaphone said, still smiling. “Even just a little sip is fine for me.”\n\nHer aunt stood up and returned with a fresh glass of water. Siphaphone accepted it with both hands. “Khop chai,” she said again, then took a small sip right away.\n\nTo acknowledge the first drink, she lifted the sweet glass slightly and took a tiny symbolic sip, then set it back down. “Just a little,” she said.\n\nHer aunt nodded. “Good, good.”\n\nThey sat together while her aunt cut papaya into small pieces. When the plate came, Siphaphone chose a few plain slices and ate slowly.\n\nA neighbor called from outside the gate, and her aunt answered, leaving Siphaphone at the table with her water glass, the two cups aligned neatly in front of her."
      }
    },
    "surface_action": "The guest accepts the refreshment, but then complains about it in front of others, weakening the host’s goodwill.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Bounmy Souvannaseng",
        "story": "Bounmy visited a colleague’s family home in Luang Prabang for a small afternoon break after a field visit. The host’s sister brought out iced tea and a plate of sticky rice snacks.\n\n“Please,” she said, setting the glass in front of Bounmy.\n\nBounmy smiled and said, “Khop chai,” then lifted the glass and took a few sips.\n\nOther guests arrived and sat nearby. The host’s sister returned with extra cups, moving quietly between chairs.\n\nBounmy leaned toward another coworker and spoke in a normal voice. “This tea is really sweet,” she said, making a small face. “And the ice tastes like freezer. I don’t know why they serve it like this.”\n\nHer coworker glanced toward the kitchen.\n\nBounmy took another sip and continued, “Also, these snacks are dry,” she said, picking up one and squeezing it between her fingers. “At my place we’d make them softer.”\n\nThe host’s sister came back with a refill jug and paused slightly near Bounmy’s table.\n\nBounmy looked up and said, “Thank you,” then turned back to her coworker and added, “I’m just saying, it’s not great.”\n\nThe host’s sister poured carefully into another guest’s cup and set the jug down.\n\nBounmy put the snack back on the plate, wiped her fingertips on a napkin, and took her phone out, still talking about the drink as the ceiling fan clicked and rotated above them."
      }
    }
  },
  {
    "id": "8",
    "category": "Business",
    "full_action": "At work, the visitor avoids political and religious discussions unless the counterpart clearly initiates and the relationship is trusted.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Khamla Intharath",
        "story": "Khamla visited a partner office in Vientiane for a training session and arrived early to set up his laptop and projector. Staff members were already at their desks, sorting papers and checking phones.\n\nWhile waiting for the session to start, one coworker asked, “How was your weekend?”\n\nKhamla smiled. “Good. I went to the riverfront for a walk,” he said.\n\nAnother colleague mentioned a temple festival in her village. “There were many people,” she said.\n\nKhamla nodded and kept his response practical. “Sounds busy. Did the traffic get heavy near your area?” he asked, opening the slide deck.\n\nA third coworker started to drift toward opinions about religion, saying, “Some people believe—”\n\nKhamla gave a small nod and redirected smoothly. “For today, I just want to make sure the reporting steps are clear,” he said, pointing to the handouts. “We’ll cover how to submit forms and who to contact.”\n\nThey moved to the meeting room. During the break, a colleague offered him coffee and asked about his hometown. Khamla answered about the bus route and the market near his family’s house, then asked, “What time do you usually leave work to avoid the rush?”\n\nWhen someone at the table started bringing up politics from a news clip on their phone, Khamla kept his eyes on the schedule and said, “We have ten minutes left—shall we do the exercise on the checklist?”\n\nThe group opened their notebooks, and Khamla began walking them through the next step on the form while the projector light cast a rectangle on the wall."
      }
    },
    "non_action": "At work, the visitor starts political or religious debates, presses coworkers for personal views, and creates tension in the workplace.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Sengphachanh Keosithong",
        "story": "Sengphachanh visited a provincial office in Pakse to meet the local team and sat with them in a small meeting room. Before the agenda started, she leaned back and said, “So, what do you all think about politics here?”\n\nA staff member blinked. “Uh… we’re here for the project.”\n\nSengphachanh waved her hand. “No, no, tell me. Do you support this side or that side?” she asked, looking from face to face.\n\nSomeone laughed nervously and looked at the table. Sengphachanh continued, “Come on. Why are you quiet? If you don’t answer, it looks suspicious,” she said.\n\nThen she shifted topics and pointed at a small spirit string on a coworker’s wrist. “Are you really religious? Do you actually believe that works?” she asked.\n\nThe coworker pulled his hand back slightly. “It’s from my family,” he said.\n\nSengphachanh leaned forward. “But do you personally believe it? Yes or no,” she insisted.\n\nThe manager cleared his throat and tried to start the meeting. Sengphachanh interrupted. “Wait, I’m curious,” she said. “Why can’t people just say what they think?”\n\nOne staff member stared at the printed agenda. Another checked their phone and didn’t look up.\n\nSengphachanh kept talking, comparing beliefs and asking everyone to state their views. The room stayed quiet between her questions while the ceiling fan squeaked and the projector remote sat untouched on the table."
      }
    },
    "principled_action": "Because a compliance topic arises, the visitor discusses only concrete procedures and avoids personal opinions or ideological probing.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Bounxay Phommasack",
        "story": "Bounxay joined a meeting in Vientiane with a partner team to review a new compliance requirement for expense reporting. The room had a whiteboard and a stack of printed policy pages on the table.\n\nA colleague pointed to a paragraph and said, “This rule is connected to government requirements.”\n\nBounxay nodded and kept his focus on steps. “Okay,” he said. “Let’s stay with procedures so everyone knows what to do.” He tapped the page. “First: keep the original receipt. Second: write the purpose on the back. Third: submit within five working days.”\n\nSomeone asked, “Why did they make it so strict?”\n\nBounxay answered with the document. “The policy says the audit needs clear documentation,” he said. “So the practical part is making sure the form matches the receipt and the date.”\n\nHe wrote on the whiteboard: “receipt + date + signature.”\n\nAnother person started to share personal opinions about religion and public rules. Bounxay lifted his hand gently. “For today, we just need to make sure the process is consistent,” he said.\n\nHe opened a sample form and said, “Let’s practice: if you buy fuel, attach the slip here, and sign here.”\n\nA staff member asked, “If we lose a receipt?”\n\nBounxay replied, “Then we use the missing-receipt form, and the supervisor signs,” and he passed the sample across the table.\n\nThe group began filling out the practice form, and Bounxay walked around, pointing to the correct boxes without commenting on anyone’s personal reasons for travel."
      }
    },
    "surface_action": "The visitor avoids direct debate, but uses insinuations and jokes that still put coworkers in an uncomfortable position.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Ounkeo Vongphachanh",
        "story": "Ounkeo visited a partner office in Luang Prabang for a planning session and sat with the team around a table of maps and forms. During a break, someone mentioned a temple event happening that weekend.\n\nOunkeo smiled and said, “Ah, the lucky-string season,” with a small laugh. “Some people really collect those like badges.”\n\nA coworker kept his expression neutral and sipped his water.\n\nOunkeo added, “Don’t worry, I’m not starting a debate,” and raised both hands briefly. “I know we’re not supposed to talk religion or politics at work.”\n\nThen she leaned toward another colleague and said, “But you can always tell who believes what by how they answer simple questions,” smiling as if it were a joke.\n\nThe colleague looked down at the map.\n\nLater, when a news notification flashed on someone’s phone, Ounkeo said, “Oh, politics again,” and chuckled. “If I ask your opinion, you’ll pretend you don’t have one, right?”\n\nA staff member gave a short laugh without speaking.\n\nOunkeo tapped her pen on the table. “Relax, I’m joking,” she said, then added, “I just like to see who’s brave,” and glanced around.\n\nThe manager returned and said, “Let’s continue with the budget.” Ounkeo nodded and opened her notebook, but she kept making small side comments under her breath while the others wrote numbers into the spreadsheet."
      }
    }
  },
  {
    "id": "9",
    "category": "Privacy",
    "full_action": "In conversation, the visitor avoids probing questions about politics or religion and keeps personal-risk topics off the table unless invited.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Soudaphone Keokham",
        "story": "Soudaphone met a friend-of-a-friend for coffee at a small shop in Vientiane near the morning market. The fan turned slowly above them, and a radio played softly near the counter.\n\nThe other woman, Naly, asked, “So, what do you do?”\n\nSoudaphone answered about her office work and asked, “Do you live around here or farther out?”\n\nNaly mentioned she had been busy with family ceremonies. Soudaphone nodded and said, “Sounds like a full week,” without asking what temple or what beliefs.\n\nA moment later, Naly said, “Some people argue about politics online these days.”\n\nSoudaphone smiled lightly and kept her hands around her cup. “Online can be noisy,” she said. “I usually focus on practical things—work, family, daily plans.”\n\nNaly looked at her and asked, “What’s your view?”\n\nSoudaphone shook her head gently. “I don’t talk much about that,” she said. “Tell me about your shop—do you sell at Talat Sao or here?”\n\nNaly relaxed and began describing her small clothing stall.\n\nSoudaphone asked about delivery days and the best time to avoid rain on the road. When Naly mentioned a festival again, Soudaphone said, “That must bring a lot of visitors,” and kept the topic on crowds and travel.\n\nThey finished their drinks, and Soudaphone paid her share, thanked the cashier, and stepped outside into the sunlight where vendors were calling out prices for fruit."
      }
    },
    "non_action": "In conversation, the visitor presses people to declare political or religious positions and treats reluctance as suspicious.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Vilayvone Phanthasene",
        "story": "Vilayvone sat at a small lunch table in Pakse with new coworkers during her first week on a project. Between bites of noodle soup, she leaned in and said, “So, what religion are you?”\n\nOne coworker paused. “Uh… my family—”\n\nVilayvone interrupted, “No, you personally. Do you believe or not?” she asked.\n\nThe coworker looked down at his bowl and said, “I don’t really talk about that.”\n\nVilayvone narrowed her eyes. “Why not? If you avoid answering, it’s weird,” she said, then turned to another coworker. “And you, what’s your political view? Tell me straight.”\n\nThe second coworker gave a small laugh and said, “We’re just eating.”\n\nVilayvone pushed. “Come on. If you don’t say, it means you’re hiding something,” she said, tapping her spoon on the table.\n\nA coworker tried to change the topic to weekend plans, but Vilayvone cut in again. “No, I want to know what side you’re on,” she said.\n\nOne person checked their phone. Another stared at the condiment tray.\n\nVilayvone leaned closer and said, “I can’t trust people who won’t answer simple questions,” then looked around the table for responses.\n\nThe server arrived with extra napkins and paused, and Vilayvone repeated, “So? Answer,” as the coworkers stayed quiet and the clatter of bowls came from the kitchen."
      }
    },
    "principled_action": "Because the visitor needs only general context, the visitor asks about practical norms and avoids asking anyone to share personal beliefs.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Phonxay Bounphan",
        "story": "Phonxay arrived in Luang Prabang for a short work visit and met a local counterpart, Ms. Noy, at a café near the river. He needed general context for scheduling community meetings.\n\nAfter they ordered iced coffee, Phonxay said, “I want to plan the meeting times well. Are there any days when many people are busy with ceremonies or travel?”\n\nMs. Noy nodded. “Some weeks have festivals.”\n\nPhonxay kept it practical. “Okay. Is it better to avoid early mornings, or afternoons?” he asked, opening his notebook.\n\nShe replied, “Afternoons can be hot. Morning is better.”\n\nPhonxay wrote it down. “And for the meeting location, do people prefer the village hall, or near the market?” he asked.\n\nMs. Noy said, “Village hall is fine, but market area is noisy.”\n\nPhonxay nodded. “Good to know. If there are any customs about seating or who speaks first, please tell me the general norm,” he said.\n\nShe explained that elders often speak early. Phonxay listened and said, “Understood. We’ll set the agenda so community leaders speak first.”\n\nWhen Ms. Noy mentioned a temple event, Phonxay didn’t ask what she believed. He asked, “Does it affect road traffic?” and she answered with which streets get crowded.\n\nPhonxay thanked her and said, “This helps me plan without bothering anyone,” and he circled dates in his notebook while the café staff wiped down a nearby table."
      }
    },
    "surface_action": "The visitor avoids direct questions, but tries to extract views indirectly through leading questions, which still creates pressure.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Manivanh Siharath",
        "story": "Manivanh sat with two acquaintances in Vientiane at a small evening food stall, sharing grilled chicken and sticky rice. The conversation stayed on work and family at first.\n\nManivanh smiled and said, “I don’t like talking politics or religion,” then reached for another piece of chicken.\n\nA moment later she leaned in and asked, “So, if someone supports certain leaders, you think they’re smart or not?” She laughed lightly as if it were casual.\n\nOne acquaintance paused. “I don’t know,” he said.\n\nManivanh continued, “Right, right. But you can tell by the way people talk, huh? Like, people who go to certain ceremonies—what do you think they’re really like?” she asked, keeping her voice playful.\n\nThe other acquaintance glanced at the street. “I don’t think about that,” she said.\n\nManivanh nodded quickly. “Of course, of course,” she said, then asked, “If you had to choose, which kind of person do you trust more?”\n\nBoth acquaintances stayed quiet for a moment. Manivanh filled the silence by saying, “I’m just curious,” and stirred her soup.\n\nWhen one person tried to shift to weekend plans, Manivanh asked, “And online, when people post certain opinions, do you agree with them or do you think it’s dangerous?”\n\nThe acquaintance picked at the rice and said, “I don’t want to answer that.”\n\nManivanh smiled and said, “No worries,” but kept watching their faces as she asked another “hypothetical” question, while the stall owner fanned the charcoal and smoke drifted across the table."
      }
    }
  },
  {
    "id": "10",
    "category": "Rites",
    "full_action": "For weddings and birthdays, the visitor brings a small gift to signal extra thoughtfulness and supports the celebratory atmosphere respectfully.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Sengmany Vongsa",
        "story": "Sengmany was invited to a wedding reception in Vientiane at a family-run venue near the river. Before leaving home, she stopped at a small shop and chose a modest gift: a neatly wrapped set of tea cups with a simple pattern. She also placed a small envelope in her purse for a cash contribution.\n\nAt the entrance, she greeted the family and handed the wrapped gift to the bride’s cousin at the gift table. “For the couple,” she said softly.\n\nThe cousin nodded and placed it with the other items. Sengmany signed the guest book, then walked to the seating area without blocking the photo line.\n\nWhen the couple came around to greet guests, Sengmany stood, smiled, and said, “Congratulations,” keeping her voice gentle. She didn’t pull them aside or ask for a long conversation.\n\nMusic played from speakers, and people began clapping as the bride and groom walked to the front for photos. Sengmany joined the clapping and then sat back down.\n\nLater, when the family served food, she waited until elders at her table started before taking her portion. She offered the serving spoon to an older woman first, then took a small amount onto her plate.\n\nWhen the cake was brought out, Sengmany lifted her phone briefly to take one photo from her seat, then lowered it and watched as the couple cut the first slice and the crowd applauded again."
      }
    },
    "non_action": "For weddings and birthdays, the visitor shows up without acknowledging the occasion and treats the celebration as unimportant.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Bouaphanh Khamvong",
        "story": "Bouaphanh arrived at her cousin’s birthday dinner in Pakse carrying only her phone and a small shoulder bag. At the gate, she called out, “Sabaidee,” and walked in without stopping at the table where gifts were stacked.\n\nHer cousin smiled and said, “You came!”\n\nBouaphanh shrugged. “Yeah,” she said, looking around. “So what are we eating?”\n\nSomeone pointed to balloons and a small cake on the table. Bouaphanh glanced at it and said, “It’s just another day,” then sat down and started scrolling.\n\nWhen the birthday song began, Bouaphanh stayed seated and kept tapping her screen. A few relatives clapped; Bouaphanh didn’t join.\n\nHer aunt brought plates and said, “Take some.” Bouaphanh reached for food before elders at the table and said, “I’m hungry,” without looking up.\n\nThe cousin came by to thank guests. Bouaphanh said, “Okay,” and turned back to her phone.\n\nLater, when the cake was cut, Bouaphanh waved her hand. “I don’t need cake,” she said. “Too sweet.” She leaned back and said, “Can we finish soon? I have things to do,” while the cousin handed slices to others.\n\nThe music continued, and Bouaphanh stood up to take a call near the doorway, speaking over the song as someone tried to gather everyone for a group photo."
      }
    },
    "principled_action": "Because the visitor cannot bring a gift that day, the visitor offers a warm congratulation and follows up with a small token later.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Khamphoui Singsavang",
        "story": "Khamphoui was invited to her coworker’s wedding lunch in Vientiane but realized on the morning of the event that the shop where she planned to buy a gift was closed. She still dressed neatly and arrived on time, bringing only a small envelope and her phone.\n\nAt the venue entrance, she found the bride near the photo area. Khamphoui stepped forward, smiled, and said, “Congratulations to both of you,” keeping her voice warm.\n\nThe bride nodded and said, “Thank you for coming.”\n\nKhamphoui handed the envelope to the relative at the gift table and wrote her name on the list. She took her seat and joined the clapping when the couple entered.\n\nAfter the lunch, Khamphoui sent a message that evening: “Today was beautiful. I couldn’t bring a small gift this afternoon, but I want to give something later.”\n\nTwo days later, on her way home from work, she stopped at a market stall and bought a modest household item: a set of hand towels wrapped in simple paper. She messaged the groom: “Are you free tomorrow after 6? I can drop something by.”\n\nThe next evening, she met them briefly outside their building, handed over the wrapped towels with both hands, and said, “Just a small token,” then stepped back and let them return upstairs while a neighbor locked the gate behind her."
      }
    },
    "surface_action": "The visitor brings a gift for the occasion, but makes the moment about themselves by repeatedly highlighting their effort.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Nalinny Keomany",
        "story": "Nalinny attended a friend’s wedding reception in Vientiane and arrived carrying a medium-sized box wrapped carefully with a ribbon. At the entrance, she held it up and said to the greeter, “This took me so long to find,” before placing it on the gift table.\n\nWhen she saw the bride, Nalinny stepped forward and said, “Congratulations,” then immediately added, “I went to three shops for your gift. Three. Can you believe it?”\n\nThe bride smiled and said, “Khop chai.”\n\nNalinny continued, “And I wrapped it myself. I didn’t even sleep much,” she said, touching her forehead dramatically.\n\nAt the table, Nalinny told others, “Wait until you see what I bought. It’s the most useful one here,” while pointing toward the gift pile.\n\nWhen the couple walked around to greet guests, Nalinny raised her hand and said again, “Remember, mine is the one with the ribbon. I really thought about it,” speaking quickly.\n\nThe groom nodded and said, “Thank you.”\n\nNalinny pulled out her phone and said, “Let me tell the story on video,” then started recording herself, narrating how she chose the gift and how far she traveled.\n\nAs the music started and people clapped for the couple’s toast, Nalinny leaned into her camera and said, “I’m exhausted from this gift mission,” while the toast glasses clinked at the front of the room."
      }
    }
  }
]