[
  {
    "id": "1",
    "category": "Interaction",
    "full_action": "While listening at a table, the visitor keeps their hands still and refrains from tapping or fidgeting so the group can focus comfortably.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Zhi-Hao Wang",
        "story": "Zhi-Hao Wang sat at a round table in a small restaurant near Tainan’s Chihkan Tower with three friends. The tabletop was crowded with bowls of fish soup and plates of vegetables. One friend, Lili, was explaining a work problem, speaking in a steady stream while pointing at her phone screen.\n\nZhi-Hao rested his hands on his lap and kept them still. He didn’t drum the table or click his chopsticks. When the server passed behind him, he moved his elbows in slightly and returned his hands to a quiet position.\n\nLili said, “Then my manager changed the deadline again.”\n\nZhi-Hao nodded once, eyes on Lili’s face. He kept his fingers relaxed and didn’t pick at the tissue box or spin his cup. Another friend asked a question, and Zhi-Hao waited, listening without making noise with his hands.\n\nWhen Lili paused to sip soup, Zhi-Hao spoke briefly. “What did they say the new date is?” he asked, then went quiet again. He kept his palms together loosely on his lap while Lili answered.\n\nA phone buzzed somewhere on the table. Zhi-Hao didn’t reach for it, and he didn’t shift the chopstick sleeve or tap the bowl rim. He stayed attentive, still, and let Lili finish her story before offering another question."
      }
    },
    "non_action": "While others are speaking, the visitor loudly taps the table and drums their fingers to pressure people to hurry up.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Brandon Holt",
        "story": "Brandon Holt sat with a small group at a breakfast shop in Taipei, the kind with metal tables and soy milk in tall cups. While a coworker described a plan for a client visit, Brandon began tapping his knuckles on the table.\n\nTap-tap-tap. He shifted to drumming his fingers in a fast rhythm near the chopstick holder. The coworker tried to keep speaking. “We should arrive around nine—”\n\nBrandon’s drumming got louder. He added a second hand and tapped both palms lightly on the tabletop, then started again with his fingertips, faster.\n\nA woman across from him glanced down at his hands. The coworker said, “And then we’ll meet the vendor—”\n\nBrandon exhaled sharply and kept tapping. “Mm-hm,” he said, eyes on the coworker, fingers still beating time like a metronome.\n\nThe coworker paused for a moment, then continued. Brandon pushed his chair forward and tapped right next to the coworker’s phone as if to push the story along.\n\n“Can we get to the point?” Brandon said, still drumming.\n\nThe group fell silent for a beat. Brandon kept his fingers going, tapping in bursts while the soy milk cups sweated on the table."
      }
    },
    "principled_action": "Because the visitor is managing anxiety, the visitor quietly asks to step outside for a moment and then returns with calmer posture to avoid disturbing others.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "An-An Hsu",
        "story": "An-An Hsu met two classmates at a café in Hsinchu to discuss a presentation. They sat by the window with laptops open and a stack of printed notes in the middle. One classmate began outlining the slide order, speaking quickly.\n\nAn-An felt her leg start to bounce under the table and her fingers tighten around the straw wrapper. She didn’t tap the tabletop. She leaned slightly toward her classmates and said quietly, “Can I step outside for one minute? I’ll be right back.”\n\nHer classmate nodded. “Sure.”\n\nAn-An stood, pushed her chair in, and walked out to the sidewalk. She took several slow breaths, looking at scooters passing and counting the breaths under her mask. After a short moment, she returned inside.\n\nBack at the table, she sat with her shoulders lowered and placed both hands flat on her thighs. She listened while the classmate continued, keeping her fingers still and her posture steady. When she needed to speak, she waited for a pause and said, “For slide three, I can summarize the method in two sentences.”\n\nShe then went quiet again, hands still, eyes on the speaker. The barista set down a drink nearby, and An-An shifted the cup slightly without fidgeting further."
      }
    },
    "surface_action": "The visitor stops tapping the table, but the visitor repeatedly sighs and checks the time in a way that still makes others feel rushed.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Kyle Mercer",
        "story": "Kyle Mercer joined a dinner table in Taoyuan with his partner’s friends at a stir-fry restaurant. Plates of clams and greens sat in the center on a lazy Susan. One friend was explaining a story about a delayed flight.\n\nKyle kept his hands off the table and stopped tapping, but he leaned back and let out a long, audible sigh. He glanced at his watch, then at his phone screen, then set it face up near his bowl. The friend continued talking.\n\nKyle sighed again, shorter this time, and checked the time once more, lifting his wrist so the movement was obvious. When the friend paused, Kyle said, “Mm,” and looked at the clock on the wall behind the cashier.\n\nThe friend resumed. Kyle didn’t drum his fingers, but he shifted his shoulders and exhaled through his nose with another sigh. He unlocked his phone, checked the time, and placed it down again, screen lighting the table edge.\n\nA woman across from him asked the storyteller a question, and Kyle looked at his phone again as if waiting for the answer to wrap up.\n\nThe storyteller kept going. Kyle said, “Right,” then sighed once more and lifted his bowl, turning it slightly as he glanced at his watch again."
      }
    }
  },
  {
    "id": "2",
    "category": "Embodiment",
    "full_action": "When handing a document to an elder, the protagonist presents the document with both hands to show respect.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Chia-Wei Peng",
        "story": "Chia-Wei Peng visited his grandmother’s apartment in New Taipei to help with a clinic reimbursement form. The living room smelled faintly of herbal tea, and a small fan pushed warm air toward the sofa. His grandmother sat at the table with her reading glasses on, the form spread out beside a red stamp pad.\n\nAfter filling in the last line, Chia-Wei slid the paper into a clear folder and stood up. He turned the folder so the text faced his grandmother and held it with both hands, thumbs along the bottom edge.\n\n“Nai-nai, here is the completed form,” he said.\n\nHis grandmother reached out, and Chia-Wei waited as she took it. He kept both hands on the folder until her hands had a secure hold, then released. She adjusted her glasses and looked at the writing.\n\nChia-Wei stayed quiet while she read. When she pointed to a box and asked, “This part is correct?” he nodded and answered, “Yes, I copied it from your card.”\n\nHis grandmother folded the corner of the folder slightly to see the stamp spot. Chia-Wei leaned in and said, “You can stamp here,” then stepped back.\n\nShe lifted the stamp and pressed it down, and Chia-Wei picked up the pen cap from the table and placed it beside the folder."
      }
    },
    "non_action": "When handing a document to an elder, the protagonist tosses the document with one hand onto the table and turns away.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Kai-Yu Shen",
        "story": "Kai-Yu Shen stopped by his uncle’s home in Taichung to drop off some paperwork for a community association. His uncle, older and slow-moving, sat at the dining table sorting receipts. Kai-Yu walked in, pulled the document from his backpack, and didn’t pause.\n\n“Here,” Kai-Yu said, and tossed the document with one hand onto the table. The pages slid over a stack of receipts and partly hung off the edge.\n\nHis uncle looked down and reached to catch the corner. “What is this?” he asked.\n\nKai-Yu was already turning away toward the living room. “It’s the form you wanted,” he said over his shoulder. He didn’t face his uncle while speaking.\n\nHis uncle lifted the pages and tried to align them. “Did you fill it out?”\n\nKai-Yu waved a hand without looking back. “I don’t know, just sign it,” he said, walking toward the couch. He picked up the TV remote and sat down.\n\nHis uncle flipped through the pages, frowning slightly as he searched for the signature line. Kai-Yu stared at the TV menu and said, “I’m busy,” while his uncle kept reading.\n\nA page slipped from the pile and fell to the floor, and Kai-Yu didn’t move as his uncle bent down to pick it up."
      }
    },
    "principled_action": "Because the protagonist is holding a child in one arm, the protagonist uses the free hand to offer the document carefully and apologizes for not using both hands.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Hsin-Yi Lu",
        "story": "Hsin-Yi Lu arrived at her father’s home in Kaohsiung carrying her toddler on her left hip. The child held onto her shoulder and kicked a small shoe against her coat. Hsin-Yi had brought a school permission slip that needed her father’s signature, since he was the emergency contact.\n\nHer father, older and wearing reading glasses, sat at the dining table. Hsin-Yi took the document from her bag with her right hand and held it flat so it wouldn’t crumple.\n\n“Dad, I’m sorry, I can’t use both hands,” she said, shifting the child higher with her left arm. “Can I give this to you like this?”\n\nHer father nodded. Hsin-Yi offered the paper carefully with her free right hand, keeping it straight and close so it wouldn’t flutter. Her father took it with his hands and pulled it toward him.\n\nHsin-Yi stayed near the table, bouncing the child gently so the toddler wouldn’t grab the document. Her father read the first lines and asked, “Where do I sign?”\n\nHsin-Yi pointed with her right index finger. “Here, please,” she said.\n\nHer father signed slowly, then held the paper out again. Hsin-Yi received it carefully with her right hand and said, “Thank you,” while the toddler reached for the pen and Hsin-Yi turned her body slightly away."
      }
    },
    "surface_action": "The protagonist uses both hands to pass the document, but the protagonist keeps looking at their phone and signals impatience during the exchange.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Jun-Kai Liao",
        "story": "Jun-Kai Liao met his girlfriend’s grandfather in a tea shop in Taoyuan to deliver a printed insurance statement. The grandfather sat in a wooden chair with a cane leaning against the table. Jun-Kai approached and pulled the document from a folder.\n\nHe held it with both hands and presented it forward. “Grandpa, this is the statement,” he said.\n\nAs the grandfather reached out to take it, Jun-Kai’s eyes dropped to his phone screen in his other hand. He kept the paper steady with both hands while glancing down repeatedly, thumb flicking across notifications between movements.\n\nThe grandfather adjusted his grip and began reading the top section. Jun-Kai stood there, shoulders tight, still looking at the phone. He let out a short exhale and checked the time, then looked back down at the phone again.\n\nThe grandfather asked, “This number here, what is it?”\n\nJun-Kai answered while still glancing at the screen. “It’s the premium amount,” he said, then sighed again and shifted his weight from one foot to the other.\n\nThe grandfather continued reading slowly. Jun-Kai’s phone buzzed, and he looked down immediately, lips pressed together, then looked up just long enough to say, “Take your time,” while his eyes drifted back to the screen.\n\nThe tea server set a cup down, and Jun-Kai tapped his foot lightly as he read another message on his phone."
      }
    }
  },
  {
    "id": "3",
    "category": "Dining",
    "full_action": "When pausing, the diner places chopsticks across the top of the bowl or on the table in a clean, orderly way.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Jia-wei Wu",
        "story": "Jia-wei ate beef noodle soup with a friend at a small shop in Taipei’s Zhongshan area. Their bowls arrived steaming, and the table held a jar of pickled mustard greens and a cup of spoons.\n\nAfter a few bites, Jia-wei paused to listen as her friend started describing a new job. She lifted her chopsticks away from the bowl, wiped a drop of broth from the tips with the edge of her napkin, and placed the chopsticks neatly across the top of her bowl, parallel to the rim.\n\nHer friend asked, “Do you want to try this chili?”\n\n“Wait,” Jia-wei said, keeping her hands free. She reached for the chili jar and slid it toward her friend, then returned her hands to her lap while she listened.\n\nWhen the server came to set down a side dish, Jia-wei moved her bowl slightly to make space without touching her chopsticks. They remained balanced across the bowl.\n\nA phone vibrated on the table. Jia-wei glanced at the screen but didn’t pick it up. “Keep going,” she told her friend.\n\nAfter her friend finished the story, Jia-wei picked up her chopsticks again, lifted a bundle of noodles, and ate. She paused once more to sip broth, then set the chopsticks cleanly on the table edge beside her bowl, aligned and not touching the condiment jars.\n\nHer friend nodded and said, “Okay,” as Jia-wei resumed eating and the shop’s front door chimed for the next customer."
      }
    },
    "non_action": "When pausing, the diner sticks chopsticks into food and leaves them in a messy position that disturbs the table setting.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Ben Turner",
        "story": "Ben had lunch with coworkers at a lunchbox shop in Hsinchu. Bowls of rice and shared side dishes were spread across the table. Ben finished a few bites, then leaned back to talk.\n\nWithout looking, he planted his chopsticks upright into the middle of his rice bowl and left them standing there. The chopsticks wobbled slightly each time the table shook.\n\nA coworker across from him glanced down and paused.\n\nBen kept talking, gesturing with his hands while the chopsticks stayed stuck in the rice. When someone placed a shared soup bowl down, the table shifted and Ben’s upright chopsticks tilted, flicking a few grains of rice onto the table.\n\nHe didn’t remove them. He reached past the standing chopsticks to grab a phone, bumping the bowl so the chopsticks rattled against the rim.\n\nA coworker tried to slide a shared plate closer, but the upright chopsticks and Ben’s bowl sat in the way, forcing them to move the plate around it.\n\nBen laughed at a joke and slapped the table lightly, making the chopsticks sway again.\n\n“Can you move your bowl?” someone asked.\n\nBen shrugged. “I’m not eating right now,” he said, leaving the chopsticks planted while he continued talking.\n\nA server came by with tea and had to place the pot at the far edge because Ben’s messy setup took up space near the center."
      }
    },
    "principled_action": "Because the diner needs to hold a phone for an urgent call, the diner sets the chopsticks down neatly on the table edge and returns promptly with an apology.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Pei-ru Zhang",
        "story": "Pei-ru met her father for lunch at a small dumpling shop in New Taipei. They shared plates of xiaolongbao and a bowl of soup, with chopsticks and spoons on the table.\n\nAs Pei-ru reached for a dumpling, her phone lit up with an incoming call from her building manager. She glanced at the screen and said, “Sorry, I have to answer this.”\n\nShe set her chopsticks down neatly on the table edge, aligned parallel to the rim of her plate, not touching the shared dishes. Then she stood and stepped a few paces away toward the shop entrance to hear better.\n\nIn a low voice, she said into the phone, “Yes, I’m the tenant in 8B. What happened?” She listened, nodded, and answered briefly, keeping the call short.\n\nAfter less than a minute, she returned to the table and sat down. “Sorry,” she said to her father.\n\nHer father nodded and poured her a little tea.\n\nPei-ru picked up her chopsticks again and took a dumpling onto her spoon, biting carefully and keeping the wrapper intact. She placed the spoon down and then set her chopsticks across the edge of her small plate when she paused to listen.\n\nHer father asked, “Everything okay?”\n\n“Yes,” Pei-ru said, taking another bite as the server set down a fresh plate of cucumbers and refilled their tea pot."
      }
    },
    "surface_action": "The diner places chopsticks neatly across the bowl, but the diner uses the pause to interrupt others and dominate the conversation disrespectfully.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Chun-hao Lin",
        "story": "Chun-hao joined two friends for hot pot in Taichung, sitting around a bubbling pot with bowls and dipping sauces. He ate a few bites, then leaned back as a friend started explaining a work problem.\n\nChun-hao lifted his chopsticks and placed them neatly across the top of his bowl, straight and balanced. Then he cut in. “No, listen,” he said, raising his voice.\n\nHis friend paused mid-sentence.\n\nChun-hao continued talking fast, pointing across the table with his index finger while his chopsticks stayed neatly placed. “You’re doing it wrong. You should just tell your boss,” he said.\n\nThe other friend tried to add something. “But the client—”\n\nChun-hao interrupted again. “Wait, wait, I’m not done,” he said, leaning forward. He didn’t pick up his chopsticks, keeping them carefully set while he took over the conversation.\n\nA server approached with extra broth. Chun-hao kept talking and didn’t move his bowl, forcing the server to reach around him to pour.\n\nHis friends exchanged a quick look and started eating quietly.\n\nChun-hao kept dominating the talk, then finally picked up his chopsticks, took a quick bite, and set them neatly back across the bowl again.\n\nHe launched into another story without pausing, speaking over both friends while the hot pot continued to simmer and steam fogged the table’s edge."
      }
    }
  },
  {
    "id": "4",
    "category": "Belief",
    "full_action": "When setting down chopsticks, the diner keeps them flat and avoids upright placement to prevent evoking offerings to the deceased.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Yi-jun Chen",
        "story": "Yi-jun ate dinner with his parents at a small restaurant near Tainan Confucius Temple. They ordered braised pork rice, vegetables, and a soup to share. As they talked, Yi-jun paused to listen to his father’s story about a colleague.\n\nHe set his chopsticks down flat across the rim of his bowl, keeping them horizontal and stable rather than upright in the rice. When he needed both hands to pour tea for his mother, he placed the chopsticks flat on the table beside his bowl, aligned neatly and not sticking into any food.\n\nHis mother asked, “Do you want more soup?”\n\n“Yes, please,” Yi-jun said, holding out his bowl.\n\nHe waited while his mother ladled soup, then picked up his chopsticks again and ate quietly. Each time he paused to speak or sip tea, he returned the chopsticks to a flat position on the bowl rim or on the table, never planting them upright.\n\nA server came by with the bill folder and set it down near the edge. Yi-jun moved his chopsticks to rest flat on the bowl while he reached for his wallet.\n\nHis father said, “I’ll pay.”\n\nYi-jun nodded and slid his wallet back into his pocket, then picked up his chopsticks for one last bite. When the meal ended, he placed his chopsticks flat on the table, parallel to the bowl, as his father stood to go to the register."
      }
    },
    "non_action": "When setting down chopsticks, the diner deliberately places them upright in rice and laughs at the religious or memorial association.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Dylan Hughes",
        "story": "Dylan joined a dinner in Taipei with friends who ordered several dishes to share. Bowls of rice were set in front of each person, and everyone began eating.\n\nHalfway through, Dylan stopped and deliberately stuck his chopsticks straight up into his rice bowl, leaving them standing like two posts. He leaned back and laughed. “I heard this is like a memorial thing,” he said, grinning.\n\nOne friend reached out. “Don’t,” she said.\n\nDylan laughed again. “It’s funny,” he said, keeping the chopsticks upright.\n\nA friend across from him glanced at the bowl and then looked away. The conversation slowed.\n\nDylan pointed at the chopsticks. “See? Offerings to the dead,” he said, chuckling as if it were a joke.\n\nSomeone said, “Stop,” in a low voice.\n\nDylan shrugged and kept them standing. He nudged the bowl slightly so the chopsticks wobbled but stayed vertical, then took out his phone and snapped a picture.\n\nHis friend reached over and pulled the chopsticks out, laying them flat on the table.\n\nDylan immediately picked them up and planted them upright again, laughing. “You guys are too serious,” he said.\n\nA server came by to place a dish down and paused, then set it on the far side. Dylan kept talking, still smiling, with the chopsticks standing in his rice as others ate quietly and avoided looking at his bowl."
      }
    },
    "principled_action": "Because the diner accidentally started to set chopsticks upright, the diner immediately corrects the placement and quietly apologizes to the table.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Shu-ya Lin",
        "story": "Shu-ya ate dinner with her partner’s parents at their home in Taichung. The table had bowls of rice, steamed fish, and stir-fried vegetables. Conversation moved between family news and work.\n\nShu-ya paused to answer a question and, without thinking, started to set her chopsticks into the rice bowl. The tips touched the rice and began to angle upward.\n\nShe noticed immediately, stopped, and pulled the chopsticks back out. She laid them flat across the rim of the bowl instead.\n\n“Sorry,” she said quietly, keeping her eyes down for a moment.\n\nHer partner’s mother nodded once and continued serving vegetables.\n\nShu-ya picked up her chopsticks again and took a small bite of fish, placing the bones neatly to the side of her plate. When she paused again to sip soup, she set the chopsticks flat on the table beside her bowl, careful and aligned.\n\nHer partner’s father asked about her commute. Shu-ya answered after swallowing and kept her chopsticks resting flat while she spoke.\n\nA phone rang in another room and the partner’s mother stood to turn it off. Shu-ya waited and didn’t touch the shared dishes.\n\nWhen the mother returned, Shu-ya said, “Thank you for the meal,” and resumed eating, setting the chopsticks down flat whenever she paused. The family moved on to fruit, and Shu-ya placed her chopsticks flat on the table before reaching for an orange slice with a fork."
      }
    },
    "surface_action": "The diner keeps the chopsticks flat, but the diner makes dismissive comments about temple customs that contradict the underlying reverence.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Zhihao Wu",
        "story": "Zhihao ate lunch with coworkers in Taitung after visiting a nearby temple area in the morning. They sat at a small restaurant and ordered noodles and side dishes.\n\nWhen Zhihao paused, he placed his chopsticks flat across his bowl, keeping them horizontal. He did it again after a sip of soup, setting them flat on the table edge.\n\nA coworker mentioned stopping by the temple later. “My grandma asked me to light incense,” she said.\n\nZhihao laughed softly and said, “Those temple rules are kind of outdated,” still keeping his chopsticks flat. He added, “All these customs about what you can and can’t do with chopsticks, it’s a lot.”\n\nHis coworker looked at her bowl and didn’t answer.\n\nZhihao took another bite and set his chopsticks down flat again. “I’m only doing this so no one freaks out,” he said, tapping the chopsticks lightly on the rim.\n\nA server brought a plate of tofu and set it down. Zhihao reached with his chopsticks, took a piece, and placed it on his plate.\n\nHis coworker said quietly, “Let’s just eat.”\n\nZhihao nodded, but added, “It’s just superstition,” while laying his chopsticks flat again.\n\nThe table kept eating, and the restaurant’s ceiling fan clicked as it changed speed."
      }
    }
  },
  {
    "id": "5",
    "category": "Kinship",
    "full_action": "When visiting a household, the guest greets and addresses the eldest household member politely to acknowledge their status and role.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Pei-shan Liu",
        "story": "Pei-shan visited her classmate’s home in Kaohsiung for a Lunar New Year dinner. She carried a bag of fruit and stood at the doorway as her classmate opened the door.\n\n“Come in,” her classmate said.\n\nBefore stepping inside, Pei-shan looked into the living room and saw the eldest household member, the grandmother, seated near the tea table. Pei-shan walked over first, keeping her voice gentle.\n\n“Ah-ma, hello,” Pei-shan said, bowing her head slightly. “Happy New Year.”\n\nThe grandmother smiled and nodded. “Sit, sit,” she said.\n\nPei-shan held the fruit bag with both hands and said, “This is a small gift for you,” then placed it on the side table.\n\nOnly after greeting the grandmother did Pei-shan turn to greet the parents. “Auntie, uncle, hello,” she said.\n\nThe mother pointed to slippers. Pei-shan changed shoes and returned to the living room.\n\nDuring dinner, Pei-shan addressed the grandmother directly when offering dishes. “Ah-ma, would you like more fish?” she asked, using serving chopsticks to place a piece on the grandmother’s plate after the grandmother nodded.\n\nThe grandmother said, “Thank you,” and Pei-shan smiled and resumed eating.\n\nAfter the meal, tea was poured again, and Pei-shan sat upright, listening as the grandmother told a story about the neighborhood, nodding and responding, “Mm,” while keeping her hands on her lap."
      }
    },
    "non_action": "When visiting a household, the guest ignores the eldest household member and speaks over them as if they are not present.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Liam Carter",
        "story": "Liam visited his friend’s home in Taipei for dinner. When the door opened, Liam stepped inside and started talking immediately. “Wow, your place is nice,” he said, looking around.\n\nIn the living room, the eldest household member, the grandmother, sat in a chair near the TV. She looked toward Liam as he walked in.\n\nLiam didn’t greet her. He walked past her chair and headed straight to the friend’s father. “So what do you do for work?” Liam asked, speaking loudly.\n\nThe grandmother said softly, “Hello,” but Liam kept talking over her without turning.\n\nHis friend’s mother offered slippers. Liam waved his hand and continued chatting, standing in the middle of the room and blocking the path.\n\nThe grandmother tried again. “Sit,” she said, patting the sofa.\n\nLiam responded to the father instead. “I’ve heard Taipei traffic is crazy,” he said, laughing.\n\nDuring dinner, Liam spoke mainly to the parents, leaning forward and talking across the table. When the grandmother began telling a story, Liam interrupted. “Oh yeah, I had something similar,” he said, raising his voice.\n\nThe grandmother stopped and looked down at her bowl.\n\nLiam continued, talking over everyone, barely making eye contact with the grandmother even when dishes were passed. When it was time for fruit, the grandmother reached for a slice, and Liam reached across her arm to take the larger piece first.\n\nThe friend’s mother refilled tea and glanced at the grandmother, who kept her gaze on the table."
      }
    },
    "principled_action": "Because the guest does not know the correct form of address, the guest asks a family member how to address the elder and then uses the suggested respectful title.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Nina Huang",
        "story": "Nina visited her coworker’s home in Taichung for a small dinner after a work event. At the doorway, her coworker whispered, “My grandma is inside.”\n\nNina stepped in and noticed an elderly woman seated by the tea table. Before approaching, Nina leaned toward her coworker and asked quietly, “How should I address her?”\n\nHer coworker replied, “Call her Ah-ma.”\n\nNina nodded and walked over, holding her gift bag with both hands. “Ah-ma, hello,” Nina said, bowing her head slightly. “Thank you for having me.”\n\nThe grandmother smiled. “Hello,” she said.\n\nNina offered the bag forward with both hands. “This is a small gift,” she said, then placed it where the coworker’s mother indicated.\n\nThe coworker’s mother said, “Please sit.”\n\nDuring dinner, Nina continued using the respectful title. When a dish of steamed fish came around, Nina asked, “Ah-ma, would you like a piece?” She waited for the nod, then used serving chopsticks to place a small portion onto the grandmother’s plate.\n\nThe grandmother said, “Okay,” and picked up her chopsticks.\n\nNina ate quietly and listened as the grandmother asked where Nina lived. Nina answered simply and kept her tone polite.\n\nAfter the meal, Nina stood to leave and said, “Ah-ma, thank you,” bowing her head again before putting on her shoes at the entry."
      }
    },
    "surface_action": "The guest uses polite forms of address, but the guest immediately pressures the elder for favors and treats the greeting as a transaction.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Zoe Wang",
        "story": "Zoe visited her boyfriend’s family in Tainan for the first time. At the entry, she saw the eldest household member, his grandmother, sitting near the living room window.\n\nZoe walked over and smiled. “Ah-ma, hello,” she said, bowing her head slightly. “Nice to meet you.”\n\nThe grandmother nodded. “Hello.”\n\nZoe continued, still using polite address. “Ah-ma, I heard you know the neighborhood committee,” she said, moving closer. “Could you help me get a parking permit? It would really help.”\n\nThe grandmother blinked and didn’t answer right away.\n\nZoe added quickly, “It won’t be hard. Just a call,” and laughed as if it were simple.\n\nZoe’s boyfriend’s mother said, “Let’s sit and eat first.”\n\nZoe nodded. “Of course,” she said, then turned back to the grandmother. “Ah-ma, really, please remember,” she said, touching her own wrist lightly as if reminding.\n\nDuring dinner, Zoe kept saying “Ah-ma” politely, but each time the grandmother spoke, Zoe steered it back. “Ah-ma, about the permit,” she said, leaning forward.\n\nThe grandmother looked down at her bowl and continued eating.\n\nWhen fruit arrived, Zoe said, “Ah-ma, if you help me, I’ll visit more,” smiling while pushing her phone across the table as if ready to take a contact.\n\nThe grandmother set her chopsticks down and reached for tea, and Zoe watched her closely, waiting for an answer."
      }
    }
  },
  {
    "id": "6",
    "category": "Exchange",
    "full_action": "When invited to someone’s home, the visitor brings a small gift such as fruit to express appreciation for the invitation.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Ying-xuan Sun",
        "story": "Ying-xuan was invited to her colleague’s home in New Taipei for a small dinner. Before heading over, she stopped at a neighborhood fruit shop and picked out a small box of neatly packed wax apples and a few oranges. The shopkeeper tied the handle and said, “Here you go.”\n\nAt the apartment door, Ying-xuan rang the bell with the fruit box held in both hands. Her colleague, Pei-jung, opened the door. “Come in,” she said.\n\nYing-xuan smiled and said, “Thanks for inviting me.” She held the fruit forward. “This is a small gift,” she added.\n\nPei-jung accepted it and said, “Oh, thank you.” She set it on the counter near the kitchen.\n\nYing-xuan changed into slippers and followed Pei-jung to the dining table where two other coworkers were already seated. “I brought fruit,” Ying-xuan said simply, then sat down.\n\nDuring the meal, Ying-xuan helped pass dishes and used serving chopsticks when needed. After dinner, Pei-jung brought the fruit box out and opened it.\n\n“Let’s eat some now,” Pei-jung said.\n\nYing-xuan handed small plates around and said, “Please,” as she placed slices on each plate.\n\nWhen it was time to leave, Ying-xuan stood at the entry and said, “Thank you for the meal,” then walked out into the hallway as the elevator arrived with a soft chime."
      }
    },
    "non_action": "When invited to someone’s home, the visitor arrives empty-handed and complains that the host should provide everything.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Samantha Green",
        "story": "Samantha went to her friend’s apartment in Taipei for a weekend dinner. She arrived with only her phone and keys, nothing in her hands. When the door opened, she stepped in and said, “I’m starving.”\n\nHer friend’s mother smiled and said, “Welcome.”\n\nSamantha kicked her shoes off near the entry and walked toward the living room. She looked at the table and said, “You didn’t get any snacks? The host should really have everything ready.”\n\nHer friend whispered, “It’s coming.”\n\nSamantha sat down and continued, “I mean, if you invite people, you should provide drinks, desserts, all of it. I didn’t bring anything because you’re the host.”\n\nHer friend’s mother brought out tea and placed cups down. Samantha picked one up and said, “Is this all? No soda?”\n\nDuring dinner, Samantha reached toward the center dishes and complained, “Why is there only one kind of fruit? You should have more variety.”\n\nHer friend’s father kept eating without speaking.\n\nWhen dessert came, Samantha said, “Next time, you should order something nicer,” and leaned back.\n\nHer friend’s mother began clearing plates. Samantha didn’t move to help and said, “Also, can you pack me some leftovers? I don’t want to buy food tomorrow.”\n\nHer friend’s mother carried the plates to the kitchen, and Samantha stayed on the sofa, scrolling on her phone while the family talked quietly in the dining area."
      }
    },
    "principled_action": "Because the visitor had no time to shop due to an emergency, the visitor explains briefly, offers to send a gift afterward, and expresses sincere thanks to the host.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Wei-xin Cheng",
        "story": "Wei-xin rushed to her friend’s home in Taoyuan for a dinner invitation after spending the afternoon at a hospital with a relative. She arrived at the apartment door with only her bag and a slightly tired face.\n\nWhen her friend, Shih-ya, opened the door, Wei-xin bowed her head slightly. “Thank you for inviting me,” she said.\n\nShih-ya looked at her and asked, “Are you okay?”\n\nWei-xin nodded. “There was an emergency today, so I didn’t have time to buy anything,” she said, keeping her voice calm. “I’m really sorry. I’ll send something tomorrow if that’s okay.”\n\nShih-ya waved her hand. “It’s fine. Come in,” she said.\n\nWei-xin changed into slippers and walked to the dining table. She added, “Thank you for still having me. I appreciate it.”\n\nDuring the meal, Wei-xin helped pass shared dishes and used serving chopsticks. She kept her phone off the table and asked, “Can I help bring plates?”\n\nAfter dinner, she took out her phone briefly and showed Shih-ya a message draft. “I’ll order fruit delivery tomorrow morning,” she said.\n\nShih-ya nodded. “Don’t worry about it,” she replied.\n\nWei-xin stood at the entry to leave and said, “Thank you for the meal,” then paused to let Shih-ya close the door.\n\nIn the elevator, Wei-xin tapped her phone and placed an order for a fruit basket to be delivered to Shih-ya’s address the next day."
      }
    },
    "surface_action": "The visitor brings a gift, but the visitor immediately hints that the gift obligates the host to provide special treatment.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Jing-yi Lo",
        "story": "Jing-yi visited her cousin’s home in Taipei for a small dinner and arrived carrying a bag of premium strawberries in a clear gift box. At the door, she held it up and smiled. “I brought something,” she said.\n\nHer cousin opened the door wider. “Come in!”\n\nJing-yi handed the strawberries over and said, “These are expensive, you know.” She stepped inside and looked around the living room.\n\nHer cousin laughed awkwardly. “Thank you,” she said, setting the box on the counter.\n\nJing-yi changed into slippers and added, “Since I brought this, you should give me the good seat,” gesturing toward the spot closest to the fan.\n\nHer cousin hesitated, then said, “Okay,” and moved a chair.\n\nDuring dinner, Jing-yi pointed at the best pieces on the fish plate. “Save those for me,” she said. “I brought strawberries.”\n\nAuntie poured soup, and Jing-yi said, “Mine first, please,” sliding her bowl forward.\n\nHer cousin’s younger brother reached toward the strawberries on the counter. Jing-yi called out, “Don’t touch yet, those are my gift,” and laughed.\n\nAfter the meal, her cousin offered tea. Jing-yi said, “Make it strong,” and added, “I deserve it after bringing that.”\n\nHer cousin opened the strawberry box and started washing them. Jing-yi sat back, watching closely, and said, “Give me the biggest ones,” as the water ran and the strawberries turned glossy under the tap."
      }
    }
  },
  {
    "id": "7",
    "category": "Civility",
    "full_action": "When planning to host visitors, the host invites the guests to meet at a restaurant or public venue to make the visit comfortable and convenient.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Lin Yating",
        "story": "Yating saw the message from her cousin and his wife: they would be in Taichung for one afternoon, free after the high-speed rail arrived. She opened LINE and typed, “You’ll be tired from traveling. Let’s meet somewhere easy.” She suggested a beef noodle shop near Taichung Station and added a pin. A few minutes later, her cousin replied with a thumbs-up sticker. On Saturday, Yating arrived early, asked for a table for three, and chose a seat with space for luggage. When they walked in carrying a suitcase, she stood and waved. “Here, sit here,” she said, pulling a chair out. She handed them menus and pointed to the cold drinks fridge. “You can pick anything you want,” she told them. When the bowls arrived, Yating slid chili oil and vinegar toward them and said, “If you want more soup, just tell the staff.” Her cousin’s wife asked about nearby sights, and Yating pulled up the map and circled a night market and a museum. After the bill came, Yating walked with them to the station exit and waited while they scanned their tickets."
      }
    },
    "non_action": "When planning to host visitors, the host refuses to meet anywhere reasonable and blames the guests for not accommodating them.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Chen Jiarong",
        "story": "Jiarong got a call from an old classmate who would be in Kaohsiung for a day and asked if they could meet somewhere near the MRT. Jiarong frowned and said, “Just come to my place.” His classmate explained they were staying near Sanduo and didn’t know the neighborhoods. Jiarong replied, “Then take a taxi. It’s not hard.” The classmate suggested a café by the department store, but Jiarong cut in, “I don’t go to those places. If you really want to see me, you’ll come.” On the day, his classmate sent a message: the rain was heavy and they were stuck on the wrong bus. Jiarong wrote back, “This is why I said come directly. You always make things complicated.” When the classmate asked for a nearby landmark, Jiarong replied, “You should have planned better,” and stopped answering. Two hours later, he sent another message: “I’m home. If you’re not here, don’t blame me.” He set his phone on the sofa and turned up the TV volume."
      }
    },
    "principled_action": "Because the host has caregiving duties at home, the host explains the constraint and suggests a nearby café that still respects the guests’ time and comfort.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Huang Meizhen",
        "story": "Meizhen’s former colleague texted that she and her teenage son would be passing through Tainan and hoped to catch up. Meizhen looked at the clock and then at her father dozing in his recliner. She opened LINE and replied, “I want to see you. I’m taking care of my dad at home these days, so I can’t go far.” She sent another message with a suggestion: a small café two blocks from her apartment, with easy seating and air-conditioning, and she included the address and opening hours. “If you’re okay with it, we can meet there at 3:00,” she wrote. The colleague replied, “Perfect.” That afternoon, Meizhen checked on her father, set a cup of water within reach, and asked her neighbor to listen for the doorbell. She walked to the café and chose a corner table. When her colleague arrived, Meizhen stood and bowed her head slightly. “Thank you for coming this way,” she said, taking their drink orders to the counter. Over iced lattes, they exchanged photos and talked about school schedules. At 4:20, Meizhen glanced at her phone, sent a quick message to her neighbor, and then asked the server for the check."
      }
    },
    "surface_action": "The host chooses a public venue, but the host uses the meeting to keep emotional distance and ignores the guests throughout the meal.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Wu Zixuan",
        "story": "Zixuan agreed to meet two visiting relatives in Taipei and picked a hotpot restaurant inside a busy mall, sending the reservation details in a short text. When they arrived, she was already seated, phone propped against her tea glass. “Over here,” she said, lifting her hand without standing. As they sat down, she kept scrolling and nodded while they explained their trip. The server asked for soup base choices, and Zixuan answered quickly without looking up. When meat plates arrived, her aunt tried to offer Zixuan a slice, but Zixuan waved it away and kept typing. A cousin asked, “How have you been?” Zixuan said, “Same,” and glanced back at the screen. Throughout the meal, she used one hand to drop vegetables into the broth and the other to reply to messages, the phone buzzing on the table. Her relatives talked to each other, occasionally pausing to see if she would join in. When the bill came, Zixuan tapped her card and immediately stood. “I have something after this,” she said, already walking toward the escalator as the restaurant door swung shut behind them."
      }
    }
  },
  {
    "id": "8",
    "category": "Business",
    "full_action": "In a meeting, the employee avoids publicly correcting a colleague and instead raises concerns privately or with careful phrasing that preserves the colleague’s face.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Chang Weiting",
        "story": "Weiting sat in a conference room in Taipei with her product team while her colleague, Shenghao, presented a timeline on the screen. As he spoke, Weiting noticed a date that conflicted with the vendor’s confirmed delivery. She kept her expression steady and waited until Shenghao finished the slide. When he asked, “Any questions?” Weiting raised her hand slightly and said, “Just to make sure I’m following, for the vendor delivery date, do we want to double-check the latest confirmation email?” Shenghao nodded and replied, “Yes, we can check.” The manager said, “Okay, we’ll verify after.” The meeting moved on to budget items. After the call ended, Weiting walked with Shenghao toward the pantry. “Shenghao, do you have a minute?” she asked quietly. At the counter, she pulled up the email on her phone and angled it toward him. “I saw the vendor moved the date to the 18th,” she said. Shenghao exhaled and said, “Oh, I used the older spreadsheet.” Weiting nodded and said, “No worries, we can update the slide before the client review,” and Shenghao opened his laptop to edit the file."
      }
    },
    "non_action": "In a meeting, the employee interrupts a colleague, calls them incompetent in front of everyone, and insists on embarrassing them to prove a point.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Lo Jianming",
        "story": "Jianming joined a weekly sync in a Taichung office as his colleague, Yuchen, explained a new process. Mid-sentence, Jianming cut in, “Stop. That’s wrong.” Yuchen froze with the laser pointer in his hand. Jianming leaned forward and said, “How can you be so incompetent? You don’t even understand the basics.” The room went quiet, and the manager’s eyes moved from Jianming to Yuchen. Yuchen tried to speak, but Jianming continued, “No, let me say it. You’re confusing everyone.” He grabbed the marker from the table, stood up, and wrote a correction on the whiteboard, speaking loudly as he did. “This is what we should do, not whatever you were saying,” he said. Yuchen stepped back toward his chair and looked down at his notes. Jianming turned to the group and asked, “Do you see? This is why we’re always delayed.” The manager cleared his throat and said, “Let’s continue,” while Jianming stayed standing with the marker still in his hand."
      }
    },
    "principled_action": "Because a safety-critical mistake must be stopped immediately, the employee flags the issue calmly, focuses on the task rather than blame, and follows up privately to reduce embarrassment.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Hsu Zixuan",
        "story": "Zixuan was in a factory-floor meeting in Taoyuan reviewing a machine maintenance checklist when her colleague read out a step that skipped a lockout procedure. Zixuan lifted her hand and said, “Hold on—can we pause on that step?” Her colleague stopped speaking. Zixuan pointed to the printed sheet and said, “For this machine, we need the lockout tag before opening the panel, otherwise the power could still be live.” She kept her voice even and looked at the checklist, not at her colleague. The supervisor nodded and said, “Right, we need lockout first.” Zixuan added, “Let’s update the sequence now so everyone has the same version,” and she wrote the corrected step number on the board. The meeting continued with the revised list. Afterward, Zixuan walked with her colleague toward the tool cabinet and said quietly, “Thanks for running the checklist today. The lockout step is easy to miss because the template is old.” She showed him the updated SOP on her phone and said, “I’ll send this to you so your next briefing is smoother,” and her colleague replied, “Okay, thanks,” as he scanned the QR code."
      }
    },
    "surface_action": "The employee avoids direct public correction, but the employee later circulates blame through group chats and damages the colleague’s reputation.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Tseng Yulin",
        "story": "Yulin sat through a team meeting in Taipei while her colleague presented a report with a few wrong figures. When the manager asked for comments, Yulin smiled and said, “Looks good, we can review details later,” and the meeting moved on. As soon as she returned to her desk, she opened the team’s LINE group and typed, “Someone’s numbers are off again,” then added a screenshot of the slide with a red circle around the mistake. A coworker replied with a shocked emoji, and another wrote, “Who made that?” Yulin answered, “You can guess,” followed by a laughing sticker. Later, she forwarded the screenshot to a smaller chat with two friends and wrote, “Same person as always.” When her colleague stopped by and asked, “Did you notice anything I should fix?” Yulin said, “Nothing major,” without showing her screen. That evening, more messages appeared in the group chat, and Yulin reacted with a thumbs-up as the notifications stacked on her phone."
      }
    }
  },
  {
    "id": "9",
    "category": "Privacy",
    "full_action": "When political identity is uncertain, the protagonist avoids probing someone’s stance on Taiwan–China relations and keeps the conversation on safer topics.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Kuo Shunwei",
        "story": "Shunwei met a new neighbor in Taichung at the building’s mail area. The neighbor introduced himself and mentioned he had recently moved for work. As they waited for the elevator, the neighbor said, “It’s been interesting seeing how things are here,” and paused like he might bring up bigger topics. Shunwei smiled and nodded, but didn’t ask where he stood on anything. “Have you found a good breakfast shop nearby?” Shunwei asked instead. The neighbor blinked and then laughed. “Not yet,” he said. Shunwei pulled out his phone and said, “There’s a danbing place on the corner that opens early, and a soy milk shop across from the park.” The neighbor asked about commuting, and Shunwei explained which bus came often. On the elevator, they talked about the humidity and how to dry laundry on rainy days. When the doors opened on their floor, Shunwei said, “If you like hiking, Dakeng trails are nice,” and the neighbor replied, “I’ll check it out.” Shunwei waved and walked to his unit, unlocking the door as the neighbor’s elevator bell chimed again."
      }
    },
    "non_action": "When political identity is uncertain, the protagonist pressures the person to declare a stance and argues aggressively when the person hesitates.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Lai Zhenhong",
        "story": "Zhenhong sat next to a new acquaintance at a Taoyuan barbecue stall and quickly steered the talk toward politics. “So, be honest,” he said, leaning in. “Taiwan–China, what’s your stance?” The person hesitated and said, “I don’t really want to talk about that.” Zhenhong laughed and pressed, “Why not? Everyone has to pick a side.” The acquaintance looked down at their skewer and said, “I’m just here for work.” Zhenhong raised his voice. “That’s a non-answer,” he said. “Say it.” When the acquaintance tried to change the subject to food, Zhenhong interrupted again. “No, answer me,” he insisted, pointing with his chopsticks. The acquaintance said, “I don’t know you well,” and shifted their chair slightly away. Zhenhong scoffed and began arguing anyway, listing his own opinions rapidly. The vendor called out an order number, and the acquaintance stood up, paid quickly, and walked toward the night market crowd while Zhenhong kept talking at the table."
      }
    },
    "principled_action": "Because the topic comes up unexpectedly, the protagonist acknowledges it briefly, invites the person to skip the topic, and redirects the discussion to neutral shared interests.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Hsieh Yunzhi",
        "story": "Yunzhi met a colleague’s friend at a coffee shop in Taipei, and after a few minutes the friend mentioned news headlines that touched on Taiwan–China relations. The table went quiet for a beat. Yunzhi nodded once and said, “Yeah, that topic is everywhere lately.” Then she added, “If you’d rather not get into it, we can skip it.” She lifted her cup and smiled lightly. “What kind of work are you doing here?” she asked, shifting her body slightly toward the person. The friend exhaled and said, “I’m in UI design.” Yunzhi’s eyes brightened and she said, “Oh, then you probably have strong opinions about app layouts.” She pulled her phone out and showed a transit app screen. “This update confused me,” she said, scrolling. The friend leaned in and started explaining where the buttons should be. Yunzhi asked about favorite cafés to work in and whether they preferred laptops or tablets. When the server brought a slice of cake, Yunzhi slid it toward the middle and said, “Let’s share,” and the conversation stayed on design tools and local food."
      }
    },
    "surface_action": "The protagonist avoids direct questions, but the protagonist drops leading remarks and tests the person indirectly in a way that still creates tension.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Chen Jiale",
        "story": "Jiale met a new gym friend in Taichung after a workout, and they sat at a juice shop. The friend mentioned visiting family across the strait in the past, then stopped mid-sentence. Jiale smiled and didn’t ask a direct question, but he said, “Some people get very emotional about certain cross-strait topics,” dragging his straw around the lid. The friend nodded slowly. Jiale continued, “I mean, you can tell a lot about someone by what they share online,” and glanced at the friend’s phone screen when it lit up with a notification. The friend turned the phone face down. Jiale laughed and said, “Not saying anything, just curious what kind of news you read.” The friend answered vaguely, “Mostly sports.” Jiale replied, “Sports is safer,” and then added, “Except when teams’ names become political.” The friend took a long sip and looked toward the street. Jiale changed the topic to hiking routes but slipped in, “Some trails have flags everywhere,” watching the friend’s reaction. The friend nodded once and said, “I usually go early when it’s quiet,” then checked the time and stood to leave."
      }
    }
  },
  {
    "id": "10",
    "category": "Rites",
    "full_action": "During meals connected to memorial contexts, the diner carefully avoids any chopstick placement that resembles incense offerings, especially placing chopsticks upright in a bowl.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Lin Jiaru",
        "story": "Jiaru attended a family meal in Kaohsiung after visiting a memorial hall, and everyone gathered at a round table in a quiet restaurant. Bowls of rice and dishes of braised pork and vegetables were set out. Jiaru picked up her chopsticks and watched how her aunt placed hers: resting flat across the small chopstick holder. When Jiaru paused to sip soup, she made sure to lay her chopsticks down horizontally on the holder instead of sticking them into her rice bowl. Her younger cousin started to set his chopsticks upright for a moment while reaching for a drink, and Jiaru gently touched his wrist and pointed to the holder without speaking. He looked down and moved the chopsticks to rest flat. The table stayed mostly quiet, with only small exchanges like “Pass the fish” and “Here, more tofu.” When the server came to refill tea, Jiaru lifted her cup with both hands and thanked them. After the meal, Jiaru folded her napkin and placed her chopsticks neatly beside the bowl, parallel to the table edge, as her uncle stood to pay at the counter."
      }
    },
    "non_action": "During meals connected to memorial contexts, the diner places chopsticks upright in a bowl and jokes about funeral rituals at the table.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Qiu Yongsheng",
        "story": "Yongsheng joined a family meal in Taichung after a memorial visit, and the group sat around a round table with bowls of rice already served. As soon as he finished a bite, Yongsheng stuck his chopsticks straight down into his rice bowl and leaned back. “Looks like incense, huh?” he said with a laugh, nodding toward the bowl. His aunt’s hand paused midair as she reached for a dish. Yongsheng kept going. “So when do we start chanting?” he joked, making a small sing-song sound. A cousin looked down at his plate and stopped chewing. Yongsheng tapped the chopsticks, leaving them upright, and said, “Relax, it’s just a joke.” Someone quietly slid a chopstick holder closer to him, but Yongsheng ignored it and grabbed his tea, leaving the chopsticks standing. The server arrived with a new dish and placed it in the center, and Yongsheng pointed at it and said, “At least the food is alive,” then laughed again while the lazy Susan turned."
      }
    },
    "principled_action": "Because the diner is unfamiliar with the setting, the diner watches others, asks quietly for guidance, and places chopsticks flat to avoid offense while honoring the occasion.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Huang Yuxuan",
        "story": "Yuxuan attended her boyfriend’s family meal in Chiayi after they returned from a memorial visit, and she sat beside his mother at a round table. The dishes arrived quickly, and everyone picked up chopsticks without much chatter. Yuxuan held her chopsticks but hesitated when she set her bowl down, unsure where to rest them. She watched her boyfriend’s mother place her chopsticks flat across a small holder, then leaned slightly closer and asked in a low voice, “Auntie, should I put my chopsticks here when I pause?” His mother nodded once and pointed to the holder. “Yes, put them there,” she said quietly. Yuxuan nodded and placed her chopsticks flat, parallel to the holder, keeping them out of the bowl. When she reached for tea, she again set the chopsticks down flat first. A cousin passed a plate of vegetables, and Yuxuan took a small portion and said, “Thank you,” then returned the plate. As the lazy Susan turned, she kept following the others’ rhythm—eat, set chopsticks down flat, lift bowl, sip, then set chopsticks down again—while the restaurant’s ceiling fan spun overhead."
      }
    },
    "surface_action": "The diner avoids the taboo placement, but the diner treats the memorial context lightly and distracts others with playful behavior that breaks the solemn intent.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Liao Zixuan",
        "story": "Zixuan sat with her relatives in Tainan for a meal after a memorial visit, and the table was set with rice bowls and shared dishes. She was careful not to stick her chopsticks upright; each time she paused, she laid them flat on the holder beside her bowl. Still, she kept trying to lighten the mood with antics. She used her chopsticks to make a tiny “drumroll” on the holder and whispered, “Ta-da,” when the fish arrived, smiling at her cousin. Her aunt looked up briefly and then looked back down at her bowl. Zixuan took a photo of the dishes and held her phone over the lazy Susan, saying, “Wait, don’t move, I need the angle,” while someone’s hand hovered to turn it. When a younger cousin asked for tofu, Zixuan made a playful “airplane” motion with the tofu piece before placing it in his bowl. Her uncle cleared his throat and said, “Eat,” and Zixuan nodded, set her chopsticks flat again, and reached for her tea. The server came to collect an empty plate, and Zixuan scooted her chair back to make room."
      }
    }
  }
]