[
  {
    "id": "1",
    "category": "Interaction",
    "full_action": "The visitor practices humility by avoiding boasting and by not displaying wealth in a way that draws attention or competition.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Sionele Fakahau",
        "story": "Sionele arrived at a cousin’s home in Vava‘u for a Sunday lunch. He wore a simple tupenu and a plain shirt, and he kept his newer phone in his pocket instead of placing it on the mat. In the kitchen, relatives were moving pots and cutting watermelon. \n\n'Ha‘u, nofo,' his aunt said, patting the mat. \n\nSionele sat and greeted each person with a short 'Mālō e lelei.' When someone asked about his job overseas, he answered with a few facts. '‘Oku ou ngaue he falemahaki. ‘Oku lahi e taimi ngaue,' he said, and then asked about their garden and whether the taro had grown back after the last rain. \n\nA younger cousin brought out a shiny watch to show the group. Sionele looked at it briefly and nodded, then returned his gaze to the food being set down. He didn’t mention what he owned or what he earned. \n\nWhen the plates came, he waited until elders began eating before taking food. After lunch he helped carry bowls to the sink, rolling up his sleeves and rinsing them one by one."
      }
    },
    "non_action": "The visitor brags about money and status, shows off expensive items, and pressures others to admire them.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Brandon Cole",
        "story": "Brandon walked into a gathering in Tongatapu wearing a flashy belt and a bright watch that caught the light. Before sitting, he held his wrist up so the men nearby could see it. 'This is real. I bought it in Auckland. Cost more than most cars here,' he said loudly. \n\nPeople on the mats looked up. One man gave a small nod. \n\nBrandon sat and pulled a phone from his pocket, turning it over so the logo showed. 'I upgraded again. You should see my place too—three bedrooms, new furniture, everything. Back home I’m doing really well,' he said, glancing around to catch reactions. \n\nA woman tried to talk about the food, but Brandon kept steering it back. 'I can pay for everyone’s tickets if you want. Seriously, you’d be amazed what I make,' he said, then laughed and leaned forward. \n\nWhen someone didn’t respond, Brandon nudged him with his elbow. 'Go on, tell them. It’s impressive, right?' he said, raising his eyebrows. The man looked away toward the doorway. Brandon stood up again and walked around the room, showing photos of his car on his phone while people held their cups still."
      }
    },
    "principled_action": "If the visitor must discuss resources for a practical reason, the visitor states facts briefly and shifts attention back to the group rather than self-promotion.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Meleane Katoa",
        "story": "Meleane met the school committee in Nuku‘alofa to plan transport for a sports day. They sat around a table in a classroom with a fan clicking overhead. The chairperson asked, '‘E lava ha tokoni ki he ngaahi me‘a pa‘anga mo e truck?' \n\nMeleane nodded once. '‘Oku ou ma‘u ha truck ‘e taha he ‘aho ko ia, pea ‘e lava ke u totongi e hinu ki he folau ‘e ua,' she said, keeping her voice steady and short. She didn’t add anything else about her own situation. \n\nThen she turned to the group. 'Ka ‘oku fiema‘u ke tau vahevahe e ngaahi fatongia. Ko hai te ne tokanga‘i e vai? Ko hai e kau fai‘umu?' \n\nA man offered to bring coolers. Meleane wrote it down on a paper and slid the pen to him. When someone thanked her, she answered, '‘Oku sai pē,' and asked about pickup times for the children from each village. \n\nThey mapped the route on the board. Meleane listened and nodded, and when the chairperson asked again about money, she repeated only the amount for fuel and then pointed back to the list of tasks. The bell rang at the end of the school day."
      }
    },
    "surface_action": "The visitor avoids explicit bragging but uses subtle comparisons and name-dropping to signal superiority, undermining humility while seeming modest.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Samuela Langi",
        "story": "Samuela joined a small dinner at a home in Vava‘u, sitting with relatives while plates were passed around. When someone asked where he had been working, he smiled modestly and said, '‘Oku ou ngaue pē,' then added, 'Na‘e ‘i ai pē ha meeting mo e CEO ‘o e company he uike kuo‘osi, nothing big.' \n\nA cousin blinked. 'CEO?' \n\nSamuela waved his hand lightly. '‘Oku ‘ikai ko ha me‘a, ko e ngaahi tangata lahi pē. Pea na‘e ui mai foki ‘a e minister’s advisor he phone, just to check something,' he said, dropping the names as if they were ordinary. \n\nHe didn’t say he was rich, but he compared. '‘I he feitu‘u na‘a ku ‘i ai, ‘oku vave ange e me‘a kotoa. ‘Oku ‘ikai ke tau tatali fuoloa.' He laughed softly and looked around. \n\nWhen someone mentioned a used car, Samuela said, '‘Oku lelei ia—na‘a ku toe almost buy that model, but I went with the newer one because of safety.' He kept eating while speaking, smiling as if minimizing it. \n\nAn aunt set down a bowl and asked him to help carry chairs. Samuela stood, adjusted his shirt, and said, 'Sure,' then mentioned again, 'This is like when we did it at the hotel event,' as he lifted two chairs at once."
      }
    }
  },
  {
    "id": "2",
    "category": "Embodiment",
    "full_action": "When interacting with higher rank, the visitor uses respectful body language, such as lowering the head and avoiding prolonged direct eye contact.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Tavita Mo‘unga",
        "story": "Tavita accompanied his uncle to meet a senior church leader in Nuku‘alofa about a youth event. They entered a small office beside the sanctuary where the leader sat with a notebook. Tavita stayed a half-step behind his uncle and kept his head slightly lowered as greetings were exchanged. \n\n'Mālō e lelei,' Tavita said, eyes dipping toward the leader’s hands and the notebook rather than holding a long stare. \n\nThe leader asked a question about timing. Tavita answered calmly, glancing up only briefly and then back down. He kept his shoulders relaxed and his hands together in front of him. When the leader spoke, Tavita nodded once, listening without leaning in. \n\nThe leader pointed to a calendar on the desk. Tavita stepped closer only when invited, then stopped at the edge of the desk without towering over it. He looked at the dates, then lowered his gaze again. \n\nHis uncle spoke most of the time. When Tavita needed to add a detail, he waited for a pause and spoke softly, keeping his head slightly lowered. The leader wrote a note and slid the calendar page forward. Tavita reached out with both hands and took the paper, then stepped back to his place."
      }
    },
    "non_action": "The visitor stares intensely at a higher-status person and uses assertive body language that ignores local signals of deference.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Connor Mills",
        "story": "Connor met a high-status official at a formal gathering in Tongatapu and walked straight up to him while people were still arranging seats. The official was seated on a chair near the front, speaking with an attendant. Connor stood close, squared his shoulders, and stared directly into the man’s eyes without looking away. \n\n'We need to talk right now,' Connor said, voice firm. He planted his feet wide and crossed his arms. \n\nThe official looked up briefly and then toward the attendant. Connor leaned forward over the armrest, keeping his face close and his gaze locked. 'I sent emails. You didn’t reply. So I’m here. Tell me what you’re going to do,' he said, still staring. \n\nA woman nearby whispered, 'Fakamolemole,' and touched Connor’s elbow. Connor shrugged her off and continued. He pointed a finger as he spoke and tapped the chair arm with his knuckles. \n\nThe official’s attendant stepped between them slightly. Connor shifted to the side to keep the official in his direct line and kept staring, blinking hard. People on the mats stopped chatting and watched. Connor didn’t sit, didn’t step back, and kept his stance over the seated man while talking."
      }
    },
    "principled_action": "If the visitor needs to show attentiveness, the visitor uses brief eye contact combined with respectful posture and calm tone rather than prolonged staring.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Lina Fakatava",
        "story": "Lina attended a meeting at a school in Vava‘u with the principal, a man many families addressed carefully. She sat on a chair slightly to the side, hands folded on her lap. When the principal spoke, Lina looked up briefly to show she was listening, then lowered her gaze to the papers in front of her. \n\n'‘Io, ‘oku ou fanongo,' she said in a calm tone, keeping her posture straight without leaning toward him. \n\nThe principal asked her to confirm a date. Lina lifted her eyes for a moment, nodded, and answered, '‘Aho Lulu, he 10:00,' then looked back down to her notes. She didn’t hold eye contact long, and she kept her shoulders relaxed. \n\nWhen the principal explained a rule change, Lina listened without interrupting, occasionally making brief eye contact at the ends of sentences, then returning to her paper. She spoke only after a pause. 'Fakamolemole, ‘e lava ke u ‘eke ha me‘a si‘i?' she asked, voice low. \n\nThe principal nodded. Lina asked her question in one sentence and waited. When the answer came, she nodded and said, 'Mālō ‘aupito,' then tucked her pen into her notebook. The principal reached for a stamp and pressed it onto a form with a firm click."
      }
    },
    "surface_action": "The visitor avoids eye contact outwardly but shows disrespect through impatient gestures and dismissive facial expressions.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Owen Price",
        "story": "Owen was introduced to an elder who led a local committee in Tongatapu. Owen kept his eyes down and didn’t look directly at the elder’s face, but his body moved restlessly. While the elder spoke, Owen sighed and rolled his eyes toward the ceiling, then looked back down quickly as if hiding it. \n\nThe elder explained the order of speaking for the meeting. Owen stared at the floor, tapping his foot fast and drumming his fingers on his knee. His mouth tightened, and he smirked slightly when the elder paused to choose words. \n\n'Fakamolemole,' the elder said, continuing. \n\nOwen didn’t interrupt with words, but he waved his hand in a small shooing motion, as if trying to hurry the elder along. He checked his watch twice, then rubbed his face and exhaled loudly. A woman beside him glanced at Owen’s hand movements and then back to the elder. \n\nWhen the elder asked Owen a question, Owen kept his eyes down and answered in a short, clipped sentence, then made a dismissive little shrug. He kept his gaze away, but his expression stayed tight and impatient. The elder placed his pen on the table and adjusted the papers into a neat stack."
      }
    }
  },
  {
    "id": "3",
    "category": "Dining",
    "full_action": "At the start of a meal, the guest lets the host assign seating and follows the host’s guidance, including taking a central seat when offered.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Tane Houma",
        "story": "Tane arrived at a home in Nuku'alofa as the evening meal was being prepared and stood near the doorway with his sandals in hand. The host greeted him and said, 'Come in, wait here.' Mats were laid out, and family members sat in positions that left a clear space in the center. The host gestured toward a spot and said, 'You sit here in the middle.' Tane nodded, stepped onto the mat, and took the central seat offered without choosing another place. He adjusted his tupenu, folded his legs in, and kept his hands on his knees. The host’s wife placed cups near the center, and Tane waited until one was offered. 'Mālō,' he said, taking it. When another guest arrived, Tane stayed put as the host pointed out the remaining seats, guiding everyone into place. After Grace, the host began serving, starting with the guests in the center. Tane accepted his plate and ate steadily, following the pace of the group. When the host asked him to pass the serving spoon to the left, Tane did so carefully and returned his hands to his lap. The host’s son brought a tray of fruit and set it down in front of Tane’s seat."
      }
    },
    "non_action": "The guest chooses their own seat without guidance, takes the best place by force, and ignores the host’s seating plan.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Adam Price",
        "story": "Adam stepped into the front room in Vava'u and saw mats laid out with an open space in the center. Before the host could speak, Adam walked straight to the middle and dropped down. 'I’ll sit here,' he said, spreading his arms as if claiming the spot. The host gestured to a seat near the side and said, 'Please sit there; we have a place for you.' Adam shook his head and replied, 'No, the middle is best.' As more relatives entered, the host tried again, pointing to where elders were meant to sit, but Adam stayed where he was. When an older man approached, Adam didn’t move and said, 'There’s room somewhere else.' The host’s wife paused with a stack of plates and looked toward the host. Adam leaned back and called, 'Bring the food here,' as if directing the serving. The host began to assign seats to others around Adam’s chosen place, adjusting the circle to fit. Adam stretched his legs outward into the open space and said, 'This is fine,' while the host rearranged cups and bowls to avoid his knees. When Grace started, Adam shifted to get comfortable in the center, still in the seat he chose without being assigned."
      }
    },
    "principled_action": "If the guest needs a particular seat for accessibility, the guest explains briefly and asks the host for help choosing an appropriate seat without disrupting the host’s plan.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Mikaele Lavulavu",
        "story": "Mikaele arrived at a family meal in Nuku'alofa with a cane and paused at the doorway while the host greeted him. Mats were laid out, and the host began pointing out where people should sit. Mikaele said quietly, 'I need a spot where I can stretch my leg a little and get up easily.' He added, 'Can you help me choose a place that fits your seating?' The host nodded and replied, 'Yes, sit near the wall by the doorway.' Mikaele thanked him and moved carefully to the assigned spot, keeping his cane beside him. He sat down with his back close to the wall, leaving the central space open as the host continued directing others. When an elder was guided to the central seat, Mikaele stayed in place and adjusted his leg inward so his foot didn’t point toward the circle. He waited through Grace with his hands on his knees. After the prayer, the host served the elders first, then the guests. Mikaele accepted his plate and said, 'Mālō,' eating without shifting the seating around him. When he needed water, he asked softly, 'Could you pass the cup?' and took it when it was placed beside him. At the end, he used his cane to stand and carried his plate to the kitchen sink."
      }
    },
    "surface_action": "The guest sits where assigned but complains about the seat and makes the host feel criticized despite following the instruction.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Clara Evans",
        "story": "Clara entered the home in Vava'u and waited as the host pointed to a spot on the mat near the wall. 'Sit here, please,' the host said. Clara sat where she was assigned, folding her legs in, but immediately looked around and said, 'This is the worst spot, isn’t it?' The host replied, 'It’s fine,' and continued guiding other guests. Clara kept her seat but added, 'I can’t see the food from here,' and shifted her torso to look toward the center. When a cup was placed beside her, she said, 'It’s far away from everything,' and nudged it closer. The host’s wife set bowls in the middle, and Clara murmured, 'I guess the good seats are over there,' while staying where she was. During Grace, she lowered her head, then after 'Āmen' she said, 'My legs will go numb here,' still sitting in place. The host began serving and placed a plate in front of her, and Clara said, 'Thank you,' followed by, 'Next time I need a better seat,' as she lifted the plate. She ate from the assigned spot, commenting each time someone passed near her, 'Careful, it’s tight back here.' When the fruit tray was set down, the host placed it in the center and Clara reached forward from her seat while saying, 'See, it’s hard to reach from this seat,' and took a slice."
      }
    }
  },
  {
    "id": "4",
    "category": "Rites",
    "full_action": "At formal occasions where kava is served, the guest follows the protocol respectfully and accepts the gendered serving arrangement as directed by the hosts.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Sione Kata",
        "story": "Sione arrived at a formal kava gathering in a relative’s hall in Nukuʻalofa and saw mats laid in a large circle. Men were seated in designated places, and women sat to the side where bowls and cups were arranged. A young woman prepared the cup while an older man spoke quietly to the organizer.\n\nSione waited near the entrance until an uncle gestured. “Sit here,” the uncle said, pointing to an open space on the mat.\n\nSione lowered himself carefully, tucking his legs in and keeping his hands in his lap. When the speaking began, he stayed silent and watched the center.\n\nA call went out, and the cup-bearer moved across the mat with the filled cup. Sione looked forward and did not reach for it early. The cup was offered to another man first. When it was Sione’s turn, the cup-bearer held it out.\n\n“Mālō,” Sione said softly and took the cup with both hands. He waited until the nearby men finished their claps, then drank and returned the cup promptly.\n\nHe clapped in time with the others and kept his eyes down as the cup-bearer moved back to her place, then he adjusted his tupenu and remained seated for the next round."
      }
    },
    "non_action": "At a kava occasion, the guest ignores the protocol, interrupts the serving order, and argues about the arrangement in a way that disrupts the event.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Ethan Cole",
        "story": "Ethan attended a formal kava night in Nukuʻalofa with a local colleague. The mats were arranged carefully, and a group of women sat to one side, preparing cups while men sat around the bowl.\n\nAs the first call was made, Ethan leaned forward and stood up from his spot. “Wait, I want to try,” he said, walking toward the center. His colleague reached out, “Ethan—” but Ethan kept going.\n\nA cup-bearer was moving with a filled cup to someone seated near the head. Ethan stepped into the path and held out his hand. “Give it here,” he said.\n\nThe cup-bearer stopped and looked to an elder. An older man said something sharply in Tongan. Ethan frowned. “Why are you giving it to him first?” he asked. “That makes no sense.”\n\nSomeone motioned for him to sit. Ethan shook his head. “Also, why are the women over there doing all the serving? They should be sitting with everyone,” he said, raising his voice.\n\nA few men shifted on the mats. The cup-bearer backed away, holding the cup close to her chest.\n\nEthan pointed toward the center. “This is outdated,” he said. “Just let people grab a cup.”\n\nAn elder lifted his hand in a stopping gesture, and the speaking halted while Ethan continued talking over him."
      }
    },
    "principled_action": "If the guest cannot drink kava for medical reasons, the guest explains briefly, remains present, and follows all other ceremonial instructions to honor the occasion.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Meleane ‘Ulukalala",
        "story": "Meleane attended a formal kava ceremony in a village hall near Muʻa with her husband’s family. The mats were arranged neatly, and the kava bowl sat in the center. She took her seat where her sister-in-law indicated and kept her hands folded.\n\nWhen the cup-bearer began moving around the circle, Meleane watched the order and stayed still. As the call approached their side, her husband whispered, “Your turn might come.”\n\nMeleane nodded and leaned slightly toward the man overseeing the ceremony when there was a pause. “Fakamolemole,” she said in a low voice. “I can’t drink kava because of medicine.”\n\nThe man looked at her face and gave a small nod, then turned back to the center. When her name was called, the cup-bearer approached with the cup and held it out.\n\nMeleane lifted both hands, palms slightly forward. “Mālō ‘aupito,” she said softly, and shook her head once.\n\nThe cup-bearer turned smoothly and offered the cup to the next person without stopping the flow. Meleane clapped in rhythm with everyone else and kept her posture steady.\n\nWhen the speaking continued, she remained seated, eyes down, and followed each cue to clap and pause, then accepted a cup of water from her sister-in-law when it was quietly placed beside her."
      }
    },
    "surface_action": "The guest follows the kava steps outwardly but treats the ceremony like a joke, undermining respect while appearing compliant.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Rory Jensen",
        "story": "Rory sat on a mat at a formal kava event in Nukuʻalofa, guided into place by his host. He kept his legs tucked in and waited as the first speaker began.\n\nWhen the cup-bearer approached with the filled cup, Rory held out both hands and took it as everyone clapped. He raised the cup, but instead of drinking immediately, he grinned at the person next to him and whispered, “Cheers,” making a small toast gesture.\n\nThe man beside him stared forward and didn’t respond. Rory took a sip and handed the cup back, then clapped with the others.\n\nAs the next round started, Rory leaned back slightly and mimed a dramatic gulping motion with his throat, as if performing for an invisible audience. He covered his mouth to stifle a laugh and looked around.\n\nThe cup-bearer moved past, and Rory wiggled his eyebrows at his host. His host’s face stayed neutral.\n\nWhen a chant-like call was made, Rory echoed it softly under his breath with an exaggerated accent, then smiled to himself. He still followed the cues to clap and stay seated.\n\nWhen the cup came again, Rory accepted it properly, but after returning it he nudged his friend and whispered, “This is like a ritual from a movie,” then chuckled while the speaking continued."
      }
    }
  },
  {
    "id": "5",
    "category": "Belief",
    "full_action": "On Sunday, the visitor treats the day as Sabbath by prioritizing worship and rest and avoiding ordinary work and business activities.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Lavinia Mafi",
        "story": "Lavinia was staying with cousins in Nukuʻalofa for the weekend. On Sunday morning, she woke to the sound of ironing and low voices as family members prepared for church. She put away her laptop and slid her notebook into her bag without opening it.\n\nIn the kitchen, her cousin asked, “Do you need to send emails today?”\n\nLavinia shook her head. “Not today,” she said, and helped set cups on the tray.\n\nThey walked to the church together, Lavinia in a simple dress and sandals. Inside, she followed her cousin’s lead, standing and sitting when others did. After the service, she returned home and sat on the veranda while the family changed into comfortable clothes.\n\nA message notification flashed on her phone. Lavinia looked at the screen, then turned it face down on the table. “I’ll answer tomorrow,” she said to no one in particular.\n\nThe afternoon moved quietly: a shared meal, then conversation in the front room while a ceiling fan turned slowly. When a neighbor came by to ask about buying something, Lavinia listened as her uncle said, “Not today,” and she nodded.\n\nLater, as the sun lowered, Lavinia lay a mat in the shade, leaned back with her hands behind her head, and closed her eyes while children played softly nearby."
      }
    },
    "non_action": "On Sunday, the visitor demands that others work, schedules business tasks, and treats Sabbath observance as an obstacle to override.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Derek Shaw",
        "story": "Derek visited Tonga for a short stay and spent Sunday at a host family’s home in Nukuʻalofa. In the morning, the household moved quietly, dressing for church and setting food aside.\n\nDerek came into the living room with his laptop open. “I need you to help me print a contract,” he said to his host, Tevita. “And can you call the shop? I want to buy a SIM and get some supplies.”\n\nTevita hesitated. “It’s Sunday,” he said.\n\nDerek frowned and tapped his keyboard. “We’re losing time,” he replied. “Just drive me. It’ll take ten minutes.”\n\nTevita’s sister passed by in a church dress and paused at the doorway. Derek raised his voice slightly. “I also need to schedule a meeting. Can you tell your cousin to come here and translate? Now.”\n\nTevita said, “We go church.”\n\nDerek shut his laptop with a snap and stood. “Fine, but after, we work,” he said. “I’ll pay for fuel.”\n\nAfter church, Derek immediately opened his laptop again and set it on the dining table. “Okay, Tevita, sit down,” he said, pulling out papers. “We’ll do this now.”\n\nWhen Tevita’s mother said the family would rest, Derek pointed at the documents and said, “This can’t wait,” then pushed the papers closer to her."
      }
    },
    "principled_action": "If a genuine emergency requires action on Sunday, the visitor limits activity to what is necessary and expresses respect for the day’s religious meaning.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Anaisi Tu’ihala",
        "story": "Anaisi stayed with her aunt in a village outside Nukuʻalofa and planned a quiet Sunday. They attended church in the morning and returned home for lunch. Anaisi set her phone on the shelf and sat with her cousins.\n\nIn the early afternoon, a call came through from her younger brother. Anaisi answered and heard him speak fast. “There was an accident. I need the insurance number and the hospital contact,” he said.\n\nAnaisi stood and stepped onto the veranda. “Okay,” she said, keeping her voice low. She went to her bag and pulled out the folder with documents. She dialed the insurer’s emergency line and wrote down the reference number.\n\nHer aunt appeared in the doorway. Anaisi turned and said, “Sorry, aunty. It’s an emergency for my brother.”\n\nHer aunt nodded once. Anaisi kept the calls short—one to the hospital reception, one back to her brother. “Go straight there,” she told him. “Tell them your full name and the reference.”\n\nWhen she finished, she placed the folder back in her bag and returned inside. “Mālō, thank you for letting me do that,” she said to her aunt.\n\nShe turned the phone off and put it back on the shelf, then sat down on the mat as her cousins resumed their card game."
      }
    },
    "surface_action": "The visitor avoids asking for work on Sunday but complains constantly about the inconvenience, contradicting respect while following the rule.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Mason Bell",
        "story": "Mason spent Sunday at his partner’s family home in Nukuʻalofa. In the morning, he dressed for church and followed everyone down the road. He stood when others stood and sat when others sat.\n\nBack at the house, he left his laptop in his bag and didn’t ask anyone to drive him anywhere. Still, as lunch was set out, he kept glancing at his phone and muttering. “I can’t believe everything stops,” he said under his breath.\n\nHis partner’s cousin asked, “You okay?”\n\n“Yeah, yeah,” Mason replied. “Just hard to do anything, you know?” He slid his phone across the table and tapped the screen. “I have emails piling up.”\n\nAn uncle began a quiet conversation in the corner. Mason leaned back and said, “Where I’m from, you can just run to the store. It’s kind of inconvenient.”\n\nHis partner’s mother offered him more water. Mason smiled quickly. “Thank you,” he said, then added, “If it wasn’t Sunday, I’d get so much done.”\n\nIn the afternoon, the family rested in the living room. Mason didn’t open his laptop, but he sighed loudly, checked the time on his wristwatch, and said, “This is a long day,” while keeping his hands folded in his lap.\n\nWhen evening came, he walked to the gate and looked down the quiet street, then returned inside and set his phone back on the shelf."
      }
    }
  },
  {
    "id": "6",
    "category": "Kinship",
    "full_action": "When seated on floor mats, the visitor follows rank- and age-based placement, with elders or high-status people centrally seated and younger people placed toward the perimeter.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Talia Sika",
        "story": "Talia arrived at her fiancé’s family home in a village near Hihifo for a gathering. Inside the front room, woven mats covered the floor, and a central space was left open. An older man, the family’s senior uncle, sat already in a spot near the center, with a few elders beside him.\n\nTalia paused at the doorway and waited until her fiancé’s aunt motioned with her chin. “Sit over there,” the aunt said, pointing to an edge section near other younger relatives.\n\n“Mālō,” Talia said, and moved quietly along the wall so she didn’t step over anyone’s legs. She lowered herself onto the mat at the perimeter and tucked her skirt under her knees.\n\nAs more people entered, younger cousins filled in around the edges, while elders were guided toward the middle. A teenage boy started to sit closer to the central group, and his mother touched his shoulder and redirected him; he scooted back.\n\nTalia kept her posture still as plates and cups were brought in. When the senior uncle spoke, she watched without interrupting. A younger cousin leaned toward her and whispered a joke, but Talia raised a finger to her lips and looked forward.\n\nWhen a tray of food was carried around, Talia waited until it reached the elders first. Only after it was offered along the perimeter did she accept a plate with both hands and set it in front of her."
      }
    },
    "non_action": "The visitor takes a central seat without invitation, ignores rank-based placement, and refuses to move when corrected.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Chris Nolan",
        "story": "Chris visited a Tongan friend’s family in Nukuʻalofa and entered the living room where mats covered the floor. A central area was arranged with space for elders. People were still arriving, and an older woman sat near the middle.\n\nChris stepped over the edge of the mat and walked straight into the center. He lowered himself into an open spot close to the older woman, stretching his legs out. “This looks like the best seat,” he said, smiling.\n\nHis friend’s aunt approached and gestured toward the side. “Please, sit there,” she said, pointing to an area along the perimeter.\n\nChris shook his head. “I’m fine here,” he replied. “I won’t be in the way.”\n\nThe aunt’s hand stayed extended. “That place is for elders,” she said.\n\nChris leaned back and crossed his arms. “I came early,” he said. “It’s first come, first served.”\n\nPeople entering slowed and looked at him. An uncle spoke to Chris’s friend in Tongan, then the friend crouched beside Chris. “Bro, can you move? Just sit over there,” he whispered.\n\nChris waved him off. “No,” he said. “I’m comfortable.”\n\nAs more elders arrived, they hesitated at the entrance because the space was partly blocked. Chris remained seated, legs still out, while the aunt placed a cushion down elsewhere and guided an older man around him."
      }
    },
    "principled_action": "If the visitor needs a central seat for accessibility, the visitor asks the host quietly and accepts the host’s solution while remaining otherwise deferential.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Fane Taukolo",
        "story": "Fane attended a family meeting in a home near Vaini. Mats covered the floor and the center was arranged for elders and senior relatives. Fane’s knee had been swollen since the day before, and she moved carefully, avoiding deep bends.\n\nAt the doorway, she waited until her host, Sefina, came close. Fane spoke quietly. “Fakamolemole, my knee is not good today,” she said, touching her leg lightly. “Is there a place I can sit where I don’t have to fold it too much?”\n\nSefina looked around and nodded. She walked to an uncle and said something in Tongan, then returned. “Sit here,” she said, pointing to a spot near the side but with a small cushion against the wall.\n\nFane followed her slowly, making sure not to step over anyone. She lowered herself onto the cushion and kept her legs tucked in as much as she could. “Mālō ‘aupito,” she said to Sefina.\n\nAs elders settled into the central seats, Fane stayed near the wall and kept her hands in her lap. When an older aunt passed a tray, Fane shifted slightly to make room and then returned to stillness.\n\nDuring the discussion, she spoke only when addressed, answering briefly. When the meeting ended, she waited for elders to stand first, then used the wall for support as she rose and stepped aside to let others pass."
      }
    },
    "surface_action": "The visitor sits in the correct position but then acts entitled and dominates conversation, undermining the meaning of rank-based seating.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Leo Hart",
        "story": "Leo joined his partner’s extended family gathering in a home in Nukuʻalofa. When he entered, an aunt pointed to a place along the edge of the mat. Leo nodded and sat there, keeping his legs tucked in.\n\nAs soon as people settled, Leo leaned forward and began speaking loudly. “Okay, so here’s what we should do,” he said, gesturing with his hands. Elders sat near the center, listening to each other in low voices, but Leo kept talking over pauses.\n\nAn older uncle started a sentence and Leo jumped in. “Yes, exactly,” Leo said, then continued with his own plan. A few cousins on the perimeter exchanged glances.\n\nWhen someone tried to hand a tray past him, Leo didn’t shift at first. “Hold on, I’m explaining,” he said, keeping his arm extended as if to mark his point. The person waited, then moved around his back.\n\nLeo addressed the elders directly. “You should really consider a new approach,” he said, pointing toward the center. The senior aunt’s face stayed still as she listened.\n\nA cousin whispered, “Maybe let uncle speak,” but Leo waved him off without looking. He kept his eyes on the elders and kept talking, raising his voice at the end of each sentence.\n\nWhen the senior uncle finally spoke again, Leo nodded repeatedly and said, “Right, right,” then began another long explanation as the room stayed quiet around him."
      }
    }
  },
  {
    "id": "7",
    "category": "Exchange",
    "full_action": "In celebrations, the participant accepts that gifts may be exchanged publicly, such as mats and kahoa leis, and responds with appreciation.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Sione Leka",
        "story": "Sione attended a family celebration in Nukuʻalofa held in a community hall. The room was filled with chairs along the sides, and in the center people gathered around a table where gifts were stacked: folded mats, wrapped boxes, and several kahoa leis.\n\nWhen his name was called, Sione stood and walked forward. An aunt placed a kahoa lei around his neck, adjusting it carefully. Sione held the lei lightly with one hand so it wouldn’t slip.\n\n“Mālō ‘aupito,” he said, looking at the aunt, then turned to the group and nodded.\n\nAnother relative lifted a folded mat and presented it. Sione accepted it with both hands and angled it so it wouldn’t drag on the floor. People clapped, and Sione waited until the clapping softened.\n\n“Thank you,” he said again, voice steady. “Mālō. Thank you for the gift.” He stepped back to make room for the next person.\n\nA cousin guided him to a chair and took the mat to stack with others. Sione sat down and kept the kahoa resting across his shoulders. When the next recipient walked forward, Sione joined the clapping and looked toward the givers.\n\nLater, when an older relative came near his seat, Sione stood briefly and said, “Thank you for honoring me,” then sat again as the music started and children danced in front of the table."
      }
    },
    "non_action": "During a public gift exchange, the participant complains about the display and refuses to participate in front of others.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Holly Rivera",
        "story": "Holly attended a celebration in a hall in Nukuʻalofa with her partner’s family. Music played softly while people gathered around a table of gifts—mats folded neatly and kahoa leis draped over baskets.\n\nWhen it came time for public giving, an aunt announced names one by one. Holly’s partner’s cousin whispered, “They will call you too.”\n\nHolly crossed her arms. “Why do they have to do this in front of everyone?” she said, loud enough for nearby cousins to hear.\n\nSoon, the aunt called, “Holly.” People turned. Holly stayed in her chair.\n\nHer partner nudged her knee. “Go,” he whispered.\n\nHolly shook her head. “No,” she said. “This is so performative.” She looked toward the table and added, “I’m not doing some public display.”\n\nThe aunt paused and called again, “Holly.” A few claps started and then stopped.\n\nHolly lifted her hands in a stopping gesture. “I’m fine,” she said. “Skip me.”\n\nAn older man near the center looked toward her. Someone murmured in Tongan. Holly continued, “I don’t want people watching me accept stuff. It’s embarrassing.”\n\nThe aunt lowered the kahoa lei she had picked up and moved to the next name, glancing down at her list.\n\nHolly remained seated, jaw tight, as the next recipient walked forward and the clapping resumed around her."
      }
    },
    "principled_action": "If the participant is uncomfortable being singled out, the participant accepts politely, keeps reactions modest, and thanks the giver afterward in a calmer moment.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Luseane Vola",
        "story": "Luseane attended a birthday celebration in Nukuʻalofa where relatives filled the hall and gifts were displayed openly. Mats were stacked on one side and kahoa leis hung over a chair back. When the giving began, people gathered close and names were called.\n\nLuseane felt her chest tighten as she heard her name approaching on the list. She kept her hands folded and watched the floor. Then the aunt called, “Luseane.”\n\nLuseane stood and walked forward without rushing. The aunt placed a kahoa lei around her neck. Luseane touched it lightly and nodded once. “Mālō ‘aupito,” she said.\n\nA cousin handed her a folded mat. Luseane accepted it with both hands and held it close to her body. People clapped, and she kept her face still, looking toward the givers.\n\n“Thank you,” she said quietly, then stepped back and returned to her seat. She placed the mat beside her chair and sat down again.\n\nLater, when the noise softened and people were lining up for food, Luseane approached the aunt near the serving table. “Aunty,” she said, voice low, “thank you for the lei and the mat. I appreciate it.”\n\nThe aunt smiled and squeezed her hand.\n\nLuseane adjusted the kahoa on her shoulders, then carried her plate of food to a corner table and began eating while the band tested microphones."
      }
    },
    "surface_action": "The participant accepts publicly but then ridicules the gift in private, contradicting appreciation while keeping public form.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Jason Pike",
        "story": "Jason attended a celebration in Nukuʻalofa with his partner’s family. In the hall, mats and kahoa leis were arranged for public giving. When his name was called, Jason stood and walked forward.\n\nAn aunt placed a kahoa lei around his neck and a cousin handed him a folded mat. Jason smiled and nodded. “Mālō,” he said, then lifted the mat slightly as people clapped. “Thank you,” he added, turning toward the group.\n\nHe returned to his seat and sat down, holding the mat beside him. A few minutes later, his partner leaned close and asked, “You okay?”\n\nJason whispered, “Yeah,” and kept clapping for others.\n\nAfter the ceremony ended and people drifted outside to talk near the parking area, Jason stepped behind the hall with his partner. He tugged at the kahoa and said in a low voice, “This thing is heavy,” then laughed quietly.\n\nHis partner frowned. Jason continued, “And a mat? What am I supposed to do with that?” He shifted the folded mat under his arm and smirked.\n\nA cousin came around the corner looking for him. Jason straightened his face quickly and said, “All good,” then lifted the mat higher as if to show he had it.\n\nHe walked back inside, placed the mat on the gift stack, and adjusted the kahoa on his shoulders as the next song began."
      }
    }
  },
  {
    "id": "8",
    "category": "Civility",
    "full_action": "In social life, the visitor accepts “Tongan time” by staying relaxed about lateness and not treating minor delays as disrespect.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Hina Taufa",
        "story": "Hina was visiting friends in Nuku‘alofa and had agreed to meet them at a small kava circle behind a house in Ma‘ufanga. She arrived at the time they mentioned and found only the tanoa set up and a few cups stacked beside it.\n\nA neighbor waved. “They’re coming,” he said.\n\nHina nodded and sat on the mat near the edge. She took out her phone, then put it away and watched a boy sweep the yard with a coconut-frond broom. When another woman walked past, Hina said, “Mālō e lelei,” and the woman replied without stopping.\n\nAfter a while, a friend’s cousin appeared carrying a bag of kava. “Sorry, the taxi took time,” he said.\n\nHina shifted to make space. “It’s okay,” she said, and helped him set the bag down.\n\nMore people arrived in small groups, greeting each other and adjusting their seats. Someone offered Hina a cup of water. She accepted it and took a sip.\n\nWhen her friend Langi finally sat down across from her, Langi said, “You waited long.”\n\nHina smiled slightly and reached forward to pass an empty cup to the person mixing. “All good,” she said, as the first bowl was ladled out."
      }
    },
    "non_action": "The visitor becomes visibly annoyed by lateness, scolds others, and demands strict punctuality in casual settings.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Mark Jensen",
        "story": "Mark stood outside a café near the central market in Nuku‘alofa, tapping his foot on the pavement. He checked his watch again and again, then held it out toward the street as if the time might change.\n\nWhen his friend Sione finally arrived with two cousins, Sione lifted a hand. “Mālō, Mark.”\n\nMark didn’t return the greeting. “You’re thirty minutes late,” he said. “This is unacceptable. When you say three o’clock, you show up at three.”\n\nSione blinked. “We stopped to pick up my cousin—”\n\n“I don’t care,” Mark cut in. He pointed at the café door. “I’ve been waiting here like an idiot. Next time, set an alarm. Write it down. Be punctual.”\n\nOne cousin glanced at the ground and shifted his bag from one shoulder to the other. A woman at a nearby stall looked over and then turned back to her vegetables.\n\nSione tried to smile. “Let’s just sit and order.”\n\nMark shook his head. “No. I’m not rewarding this. If you can’t be on time, don’t make plans with me,” he said, and he raised his voice. “This is basic respect.”\n\nSione stepped back, and Mark walked toward the café entrance, still talking as he pushed the door open."
      }
    },
    "principled_action": "If the visitor has a fixed commitment, the visitor communicates the time constraint early and suggests a practical plan while remaining courteous.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Leilani Siaosi",
        "story": "Leilani was staying with relatives in Vava‘u and planned to meet her cousin for lunch before a church choir practice. In the morning, she sent a message: “I’m free until 2:00 because I have practice at 2:30. If you’re running late, we can do takeaway and eat at your place.”\n\nAt noon, she walked to the small takeaway shop near the road and waited by the counter. She ordered two plates of fish and cassava and kept one covered.\n\nHer cousin Peni arrived after a while, wiping sweat from his forehead. “Sorry, the car had no petrol,” he said.\n\nLeilani nodded. “No worries,” she said. “I bought food already so we can save time. We can eat at yours, then I’ll head out by two.”\n\nPeni looked at the covered plate. “Mālō, that helps.”\n\nThey walked together, and Leilani adjusted the bag so it wouldn’t spill. At Peni’s house, she set the plates on the mat and checked her phone once.\n\nWhen it was close to two, Leilani stood and said, “I’m going now so I can change for practice.”\n\nPeni handed her a bottle of water. “Drive safe,” he said, and Leilani stepped outside and started down the path toward the main road."
      }
    },
    "surface_action": "The visitor claims to be relaxed but repeatedly checks the time and pressures people with sighs and complaints.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Talia Ngata",
        "story": "Talia sat under the mango tree in a yard in Nuku‘alofa, waiting for relatives to gather before heading to a birthday lunch. She leaned back and said, “It’s fine, I’m chill,” but her hand kept sliding to her phone.\n\nShe unlocked it, stared at the time, and locked it again. A few minutes later, she sighed loudly and looked toward the gate. “Still no one,” she muttered.\n\nHer cousin Sia walked past carrying a bowl. “They’ll come,” Sia said.\n\nTalia smiled quickly. “Yeah, yeah, I’m not stressed,” she said, then checked her watch and clicked her tongue. “But we’re wasting the whole day.”\n\nWhen an aunt stopped to tie her ta‘ovala, Talia exhaled and said, “We could have left already. The food will get cold.”\n\nThe aunt didn’t answer and kept tying the knots.\n\nTalia stood, paced two steps, and sat again. “I’m relaxed,” she repeated, then sent a message: “Where are you? Hurry.” She set her phone face-up on the mat and tapped the screen as if it might call people faster.\n\nA car horn sounded outside, and Talia immediately lifted her phone and said, “Finally,” as she rose and smoothed her skirt."
      }
    }
  },
  {
    "id": "9",
    "category": "Business",
    "full_action": "The organizer avoids asking people to do demanding work on Sunday and schedules heavy tasks for other days to respect Sabbath observance.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Taufanau Vaka",
        "story": "Taufanau was coordinating a community clean-up for a youth group in Nuku‘alofa. On Friday afternoon, he gathered volunteers outside the church hall and held a clipboard.\n\n“We’ll do the heavy work on Saturday,” he said. “We can clear the overgrown weeds and carry the sacks then. Sunday we rest.”\n\nA teenager asked, “What about the rubbish behind the fence? It’s a lot.”\n\nTaufanau nodded. “Saturday morning,” he repeated, and wrote down names. “Bring gloves. We’ll start after breakfast.”\n\nOn Saturday, the group met early. Taufanau assigned pairs to rake, lift, and load. He helped carry bags to the truck, counting them as they went.\n\nBy late afternoon, the pile was gone. Taufanau wiped his hands and said, “That’s enough for today. We’ll leave the light things for Monday, like sorting the tools.”\n\nOn Sunday, he didn’t send any messages about work. When a volunteer texted, “Should we meet today?” Taufanau replied, “No, enjoy Sunday. We continue Monday.”\n\nMonday morning, he arrived at the hall and set the tools in a neat line, then handed out a small list of tasks that didn’t involve lifting."
      }
    },
    "non_action": "The organizer insists that people work hard on Sunday and frames refusal as laziness or disobedience.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Paulo Kuli",
        "story": "Paulo ran a small building crew in Tongatapu and wanted to finish a fence quickly. On Sunday morning, he sent messages to every worker: “Come now. We work hard today. No excuses.”\n\nAt midday, he stood at the worksite in his boots and called again. “Where are you?” he said into his phone.\n\nOne worker, Sione, answered quietly. “Boss, it’s Sunday. I’m with family.”\n\nPaulo raised his voice. “That’s laziness,” he said. “If you respect me, you show up. If you don’t come, don’t expect pay next week.”\n\nAnother worker arrived and stood awkwardly by the posts. Paulo pointed at a stack of timber. “Lift it. Move faster,” he ordered.\n\nA man at the gate said, “I can’t today.”\n\nPaulo stepped closer and jabbed a finger toward the ground. “You think church makes you special? Work is work. Obey the schedule,” he said.\n\nThe man turned away. Paulo shouted after him, “Don’t come back if you won’t follow instructions.”\n\nHe then turned to the few workers present and said, “You carry all the panels. We finish today,” as he kicked a pile of nails closer and handed out hammers."
      }
    },
    "principled_action": "If a true emergency requires action on Sunday, the organizer asks politely, limits the request to what is necessary, and expresses gratitude for any help provided.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Sionele ‘Akau‘ola",
        "story": "On Sunday afternoon in Nuku‘alofa, Sionele received a call from the church hall caretaker. “Water is leaking from the storage room,” the caretaker said. “It’s running into the floor.”\n\nSionele put on a clean shirt and walked to the hall, stopping at the gate to call two nearby volunteers. “I’m sorry to ask on Sunday,” he said. “There’s a leak. Can you help for a short time to stop the water? Only the urgent part.”\n\nOne volunteer replied, “We can come.”\n\nAt the hall, Sionele met them at the door. He spoke quietly. “Thank you. We’ll just turn off the main valve and move the boxes away from the wet spot.”\n\nThey entered, and Sionele pointed to the corner where water was pooling. He lifted two cardboard boxes and placed them on a table, then handed another box to the volunteer.\n\nThe caretaker showed the valve outside. Sionele turned it slowly until the water sound stopped.\n\n“That’s it,” Sionele said. “We’re done now.”\n\nHe wiped the floor with a towel and told the volunteers, “Mālō ‘aupito for coming,” then walked with them to the gate and shook each hand before they left."
      }
    },
    "surface_action": "The organizer avoids demanding work on Sunday but pressures people through guilt and repeated messaging, contradicting respect while keeping outward compliance.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Nilesi Fe‘ao",
        "story": "Nilesi coordinated a fundraising committee in Vava‘u and needed volunteers to move tables for an event. On Saturday night she sent a message: “We won’t do heavy work on Sunday.”\n\nOn Sunday morning, her phone buzzed as she typed again. “Just thinking about how much we still have to do,” she wrote in the group chat. “It’s a shame if things look bad because people didn’t help.”\n\nA member replied, “Sunday is for church.”\n\nNilesi answered, “Yes, of course. I respect that,” then sent another message an hour later: “If the hall isn’t ready, everyone will notice. I guess I’ll do it alone.”\n\nIn the afternoon, she posted a photo of the stacked tables with the caption: “Still waiting.” She added, “No one has time for the committee.”\n\nA volunteer called her. “Do you want us to come now?”\n\nNilesi said, “No, no, don’t come. It’s Sunday,” but her voice tightened. “I’ll remember who showed up when we needed help.”\n\nLater, she sent one more message: “I’m carrying things myself. Pray for me,” and she sat on her couch refreshing the chat until someone replied.\n\nWhen Monday came, she greeted the volunteers at the hall with, “Thanks for finally coming,” and handed them the heavy folding tables without looking up."
      }
    }
  },
  {
    "id": "10",
    "category": "Privacy",
    "full_action": "When noticing a personal item, the visitor avoids pointed admiration of that specific object so the owner does not feel obliged to offer it as a gift.",
    "full_stories": {
      "GPT-5.2": {
        "name": "Kesaia ‘Ulukalala",
        "story": "Kesaia visited a cousin’s home in Nuku‘alofa on a weekday evening. In the corner of the room, she noticed a neatly folded ta‘ovala with fine weaving and a polished wooden kava cup displayed on a shelf.\n\nHer cousin, Maka, followed her gaze. “Sit,” he said, pointing to the mat.\n\nKesaia nodded and sat without walking toward the shelf. “Your house is tidy,” she said, looking around at the framed family photos instead of focusing on the cup.\n\nMaka’s sister brought tea and placed cups in front of them. Kesaia thanked her and asked, “How was your work this week?”\n\nAs they talked, a child reached up to touch the kava cup. Maka gently moved the child’s hand away. Kesaia watched for a moment and then shifted her eyes back to the tea tray.\n\nLater, when Maka offered a tour of the new kitchen cabinets, Kesaia stood and followed him, keeping her hands at her sides. She didn’t pause at the shelf.\n\nMaka asked, “Do you want to see the things my father made?”\n\nKesaia smiled politely. “Maybe another time,” she said, and returned to her seat.\n\nWhen she left, she thanked Maka and his sister, accepted a small piece of cake wrapped in paper, and walked out through the gate without mentioning the ta‘ovala or the cup."
      }
    },
    "non_action": "The visitor repeatedly praises a specific personal item and hints that they want it, creating social pressure for the owner to give it away.",
    "non_stories": {
      "GPT-5.2": {
        "name": "Tui Halafihi",
        "story": "Tui sat in his friend Vili’s living room in Nuku‘alofa and kept looking at a new wristwatch resting on the table beside Vili’s phone. The watch face caught the light whenever someone moved.\n\nTui leaned forward. “That watch is beautiful,” he said. “Wow. That one is really nice.”\n\nVili smiled once. “Yes, I bought it last month.”\n\nTui reached closer, not touching it yet. “This exact one, I’ve wanted it for ages,” he said. “It suits you, but it would suit me too.” He laughed and looked around at the others.\n\nVili picked up the watch and slipped it onto his wrist. Tui stared. “How much was it?” he asked. “You know, if you don’t need it, I could use it.”\n\nVili’s sister poured tea and paused with the kettle mid-air.\n\nTui kept going. “I’m serious. That brand is hard to find here. You’re lucky. Maybe you can give it to me, and you buy another one later.”\n\nVili’s smile faded. “No, it’s mine,” he said.\n\nTui tilted his head. “But you already have other watches,” he replied, and he tapped the table near Vili’s wrist. “Just think about it,” he said, as the room fell quiet and the tea was poured without conversation."
      }
    },
    "principled_action": "If the visitor realizes they created pressure, the visitor clarifies that they are only admiring and explicitly says they are not asking for the item.",
    "principled_stories": {
      "GPT-5.2": {
        "name": "Fineasi Latu",
        "story": "Fineasi visited his uncle’s home in Vava‘u and noticed a carved wooden paddle hanging on the wall. The carving was detailed, with small patterns along the handle. Fineasi looked up and said, “That carving is really well done.”\n\nHis uncle, Sione, nodded. “My friend made it.”\n\nFineasi stepped closer and added, “It’s beautiful. The lines are so clean.” He realized his voice was carrying, and he saw his aunt glance toward the paddle.\n\nFineasi took a step back and raised both palms slightly. “Uncle, I’m only admiring,” he said. “I’m not asking for it. I just wanted to say it looks good.”\n\nSione’s shoulders relaxed. “Okay,” he said.\n\nFineasi sat down on the mat and shifted the conversation. “How is the boat running these days?” he asked.\n\nSione began talking about the engine, and Fineasi listened, nodding. When his uncle stood to fetch a tool from the shed, Fineasi stayed seated and helped pass cups of tea along the mat.\n\nLater, the aunt brought out cassava and fish. Fineasi accepted his plate and said, “Mālō ‘aupito,” keeping his eyes on the food and the people instead of the wall.\n\nWhen it was time to leave, he shook Sione’s hand at the door and said, “Thank you for having me,” then stepped off the veranda and walked down the path."
      }
    },
    "surface_action": "The visitor avoids direct requests but keeps asking about the item’s value and ownership, increasing pressure while sounding polite.",
    "surface_stories": {
      "GPT-5.2": {
        "name": "Salote Fakahau",
        "story": "Salote sat in her neighbor’s home in Nuku‘alofa and noticed a small gold necklace lying in an open dish on the dresser. She didn’t point at it directly, but her eyes kept returning to it.\n\nHer neighbor, Nita, poured tea. “Sugar?” Nita asked.\n\nSalote shook her head. “No, thank you,” she said, then added casually, “That necklace—who owns it?”\n\nNita glanced over. “It’s mine.”\n\nSalote nodded slowly. “Ah. Is it real gold?” she asked, keeping her tone light. “How much would something like that cost here?”\n\nNita set the sugar bowl down. “I got it from my sister.”\n\nSalote leaned forward a little. “From overseas?” she asked. “Is it 18k? Does it have a certificate? It must be worth a lot.”\n\nNita’s cousin, sitting nearby, stopped scrolling on his phone.\n\nSalote smiled and waved her hand. “I’m not asking for it,” she said quickly. “I just like to know these things. If someone wanted one, how much would they pay?”\n\nNita picked up the necklace and placed it back into the dish, then slid the dish farther from the edge of the dresser.\n\nSalote continued, “And do you wear it every day, or only for special days?” while she lifted her tea cup and watched Nita’s hands."
      }
    }
  }
]